{
    "articles": [
        {
            "title": "NEPSE dips 27 points; Life Insurance sector takes 2.65% hit",
            "description": "Nepal's sole secondary market, the Nepal Stock Exchange (NEPSE), continued its downward trend on Thursday, shedding 27.84 points or 1.32%, settling at 2,080.87 points.",
            "url": "https://thehimalayantimes.com/business/nepse-dips-27-points-life-insurance-sector-takes-265-hit"
        },
        {
            "title": "Sustainability and existential philosophy on display",
            "description": "The Kala Salon in Thamel is currently the epicentre of artistic discourse in the Valley as it hosts two thought-provoking exhibitions, ‘Foraging Chroma’ by Meena Gurung, and ‘From Zero to Sunya’ by Cinzia, which commenced on March 10.",
            "url": "https://thehimalayantimes.com/lifestyle/sustainability-and-existential-philosophy-on-display"
        },
        {
            "title": "Comprehensive approach needed to address complex challenges of climate change: PM Dahal",
            "description": "Prime Minister Pushpa Kamal Dahal 'Prachanda' has underlined the need of a comprehensive strategy to address complex challenges of climate change, health and social justice.",
            "url": "https://thehimalayantimes.com/kathmandu/comprehensive-approach-needed-to-address-complex-challenges-of-climate-change-pm-dahal"
        },
        {
            "title": "Gold price rebound by Rs 800 per tola, silver surges by Rs 50",
            "description": "​​​​​​​The gold market regained some of its lost ground on Thursday, with price increasing by Rs 800 per tola in the domestic market.",
            "url": "https://thehimalayantimes.com/business/gold-price-rebound-by-rs-800-per-tola-silver-surges-by-rs-50"
        },
        {
            "title": "In Pictures: Samyak festival",
            "description": "Devotees adorned in the idol of the deity Dipankara Buddha parade around the ancient city during the Samyak festival,",
            "url": "https://thehimalayantimes.com/photo-gallery/in-pictures-samyak-festival"
        },
        {
            "title": "Nepal's leap forward in kidney care: But gender discrimination persists",
            "description": "World Kidney Day is being celebrated today across the world with various events. The theme of this year's World Kidney Day is \"Kidney Health for All – Advancing equitable access to care and optimal medication practice\".",
            "url": "https://thehimalayantimes.com/opinion/nepals-leap-forward-in-kidney-care-but-gender-discrimination-persists"
        },
        {
            "title": "Nepathya to perform in enchanting Ilam hills",
            "description": "The concert in Ilam is organized in collaboration with Nyupi Tharpa Choling Gumba, aimed at preserving religious heritage and promoting tourism through music.",
            "url": "https://thehimalayantimes.com/entertainment/nepathya-to-perform-in-enchanting-illam-hills"
        },
        {
            "title": "What is the Darien Gap? And why are more migrants risking this Latin American route to get to the US?",
            "description": "Cellphone service stops once people enter the dense forest; migrants rely on the paid “guides” and fellow migrants to make it through.",
            "url": "https://thehimalayantimes.com/world/what-is-the-darien-gap-and-why-are-more-migrants-risking-this-latin-american-route-to-get-to-the-us"
        },
        {
            "title": "Nepal-India border coordination meeting held",
            "description": "During the meeting, security officials from both countries also agreed to work together to control criminal activities in the Nepal-India border area.",
            "url": "https://thehimalayantimes.com/nepal/nepal-india-border-coordination-meeting-held"
        },
        {
            "title": "Protests drove Nepal's king off the throne 16 years ago. Now, protests are trying to bring him back",
            "description": "“Come back king, save the country. Long live our beloved king. We want a monarchy,” the crowd chanted at a rally last month in Kathmandu.",
            "url": "https://thehimalayantimes.com/nepal/protests-drove-nepals-king-off-the-throne-16-years-ago-now-protests-are-trying-to-bring-him-back"
        },
        {
            "title": "New Province Chiefs take oath of office",
            "description": "President Ramchandra Paudel administers the oath of office and secrecy to the newly appointed province chiefs today.",
            "url": "https://thehimalayantimes.com/nepal/new-province-chiefs-take-oath-of-office"
        },
        {
            "title": "HoR reaffirms confidence on PM Dahal for third time",
            "description": "Prime Minister Pushpa Kamal Dahal 'Prachanda' has secured a vote of confidence in the House of Representatives (HoR) for the third time.",
            "url": "https://thehimalayantimes.com/nepal/hor-reaffirms-confidence-on-pm-dahal-for-third-time"
        },
        {
            "title": "PNG wins title of Tri-nation International T20 series",
            "description": "Nepal faced a defeat against Papua New Guinea (PNG) in the final match of the Tri-nation International T20 Series held in Hong Kong.",
            "url": "https://thehimalayantimes.com/kathmandu/png-wins-title-of-tri-nation-international-t20-series"
        },
        {
            "title": "NEPSE records 2 point decline, finance sector leads gains",
            "description": "The Nepal Stock Exchange (NEPSE) saw a 2.48-point decline, settling at 2,108.72 points by the close of Wednesday's trading session, marking a 0.11% decrease.",
            "url": "https://thehimalayantimes.com/business/nepse-records-2-point-decline-finance-sector-leads-gains"
        },
        {
            "title": "PM Dahal presents proposal in parliament, seeking vote of confidence",
            "description": "CPN (Maoist Centre) Chairperson and Prime Minister Pushpa Kamal Dahal 'Prachanda' has presented a proposal in the House of Representatives today as per the Rule 155 of the House of Representatives Regulations, 2079BS, seeking a vote of confidence in accordance with Article 100, Sub-Article (2) of the Constitution of Nepal.",
            "url": "https://thehimalayantimes.com/kathmandu/pm-dahal-presents-proposal-in-parliament-seeking-vote-of-confidence"
        },
        {
            "title": "Economic indicators gradually improving: PM Dahal",
            "description": "Prime Minister Pushpa Kamal Dahal 'Prachanda' has said the country's economic indicators are on a positive trajectory due to the consistent efforts.",
            "url": "https://thehimalayantimes.com/nepal/economic-indicators-gradually-improving-pm-dahal"
        },
        {
            "title": "Nepal's beautiful nature and rich culture attracts world: President Paudel",
            "description": "President Ram Chandra Paudel has said that Nepal has become a center of attraction in the globe for its beautiful nature and glorious culture.",
            "url": "https://thehimalayantimes.com/kathmandu/nepals-beautiful-nature-and-rich-culture-attracts-world-president-paudel"
        },
        {
            "title": "English language barrier: How it prevents use of technology",
            "description": "A few months ago, I could be seen trekking across the hilly, rugged terrain of my village in Bajhang – in an arduous one-hour journey to the ward office.",
            "url": "https://thehimalayantimes.com/opinion/english-language-barrier-how-it-prevents-use-of-technology"
        },
        {
            "title": "Gold price dip by Rs 1,000 per tola; Silver follows suit",
            "description": "The gold price, which had held steady at a record high of Rs 126,000 per tola over the past three days, saw a drop of Rs 1000 per tola on Wednesday.",
            "url": "https://thehimalayantimes.com/business/gold-prices-dip-by-rs-1000-per-tola-silver-follows-suit"
        },
        {
            "title": "PM Dahal taking vote of confidence in parliament today",
            "description": "Prime Minister Pushpa Kamal Dahal 'Prachanda' is taking a vote of confidence in the meeting of the House of Representatives (HoR) scheduled for today.",
            "url": "https://thehimalayantimes.com/kathmandu/pm-dahal-taking-vote-of-confidence-in-parliament-today"
        },
        {
            "title": "Japan hands over medical equipment to Kathmandu Cancer Center in Bhaktapur",
            "description": "​​​​​​​The Japan government has handed over the medical equipment to Kathmandu Cancer Center (KCC) in Changunarayan Municipality, Bhaktapur, today.",
            "url": "https://thehimalayantimes.com/kathmandu/japan-hands-over-medical-equipment-to-kathmandu-cancer-center-in-bhaktapur"
        },
        {
            "title": "NEPSE marks 2.85% gain, crossing 2,100 points; Life Insurance, Microfinance sectors lead",
            "description": "The Nepal Stock Exchange (NEPSE) witnessed a significant surge on Tuesday, with the market rallying by 58.58 points, marking a substantial 2.85% increase and surpassing the 2,100-point mark to settle at 2,111.24 points by the day's close.",
            "url": "https://thehimalayantimes.com/business/nepse-marks-285-gain-crossing-2100-points-life-insurance-microfinance-sectors-lead"
        },
        {
            "title": "Dahal elected National Assembly Chair",
            "description": "Narayan Prasad Dahal, the candidate of the ruling coalition, has been elected to the post of National Assembly Chairperson.",
            "url": "https://thehimalayantimes.com/kathmandu/dahal-elected-national-assembly-chair"
        },
        {
            "title": "Tri-nation Int'l T-20 Cricket Series: Nepal sails into final edging PNG",
            "description": "Nepal edged Papua New Guinea in the second match of the Tri-nation International T-20 Series to enter the finals.",
            "url": "https://thehimalayantimes.com/sports/tri-nation-intl-t-20-cricket-series-nepal-sails-into-final-edging-png"
        },
        {
            "title": "Repeated fall of political coalitions: Increasing disenchantment of the people",
            "description": "Political coalitions have formed the living reality of Nepali politics because of the existing provisions in the constitution that has made it virtually impossible to have a majority by any political party.",
            "url": "https://thehimalayantimes.com/opinion/repeated-fall-of-political-coalitions-increasing-disenchantment-of-the-people"
        },
        {
            "title": "Bajura siblings left in limbo amid parental disappearance, remarriage",
            "description": "Two young siblings from Himali Rural Municipality-7 of Bajura find themselves caught in the crossfire of their parents' absence and remarriage, leaving them stranded and vulnerable.",
            "url": "https://thehimalayantimes.com/nepal/bajura-siblings-left-in-limbo-amid-parental-disappearance-remarriage"
        },
        {
            "title": "Draft bill on IT and cyber security seeks transparent, accountable use of AI",
            "description": "A draft bill designed to manage IT and cyber security has underlined the use of innovative technology.",
            "url": "https://thehimalayantimes.com/science-and-tech/draft-bill-on-it-and-cyber-security-seeks-transparent-accountable-use-of-ai"
        },
        {
            "title": "Transportation halted on Karnali Bridge after 14 support wires damaged partially in fire",
            "description": "Transportation on the Karnali Bridge has been halted after the damage in 14 support wires when it caught fire from a truck on Monday.",
            "url": "https://thehimalayantimes.com/kathmandu/transportation-halted-on-karnali-bridge-after-14-support-wires-damaged-partially-in-fire"
        },
        {
            "title": "Dahal, Sharma file candidacies for NA Chair",
            "description": "The ruling alliance and opposition have filed their separate candidacies for the post of National Assembly Chairperson.",
            "url": "https://thehimalayantimes.com/kathmandu/dahal-sharma-file-candidacies-for-na-chair"
        },
        {
            "title": "Japan provides 12 recycled fire engines to five provinces",
            "description": "The Japan government has provided a total of 12 recycled fire engines to the five provinces, Koshi, Lumbini, Madhesh, Bagmati, and Gandaki, under the Grant Assistance for Grassroots Human Security Projects (GGP) of the Government of Japan, on Monday.",
            "url": "https://thehimalayantimes.com/kathmandu/japan-provides-12-recycled-fire-engines-to-five-provinces"
        },
        {
            "title": "9th Edition of Nepal-Pakistan Friendship T20 Cricket Tournament-2024 concludes",
            "description": "The 9th Edition of Nepal-Pakistan Friendship T20 Cricket Tournament-2024 has concluded in Kathmandu, on Sunday.",
            "url": "https://thehimalayantimes.com/sports/9th-edition-of-nepal-pakistan-friendship-t20-cricket-tournament-2024-concludes"
        },
        {
            "title": "Rain, snowfall likely to occur today",
            "description": "The western low pressure system has partially affected Nepal.",
            "url": "https://thehimalayantimes.com/nepal/rain-snowfall-likely-to-occur-today"
        },
        {
            "title": "Media experts, journalists stress women's editorial leadership crucial for inclusive media content",
            "description": "Leading media experts and seasoned women journalists of Nepal have sought to address the pressing need for dismantling embedded newsroom stereotypes and fostering greater gender diversity in media leadership roles.",
            "url": "https://thehimalayantimes.com/kathmandu/media-experts-journalists-stress-womens-editorial-leadership-crucial-for-inclusive-media-content"
        },
        {
            "title": "Unsolicited advice to the Nepali Congress: Reform or face obsolescence",
            "description": "Against the backdrop of Nepal's struggle for democracy and sovereignty from autocratic Rana regime, the Nepali National Congress (NNC) was formed in 1946. Amidst subsequent transformations, the party found its enduring identity as the Nepali Congress (NC) in 1950 that was firmly committed to championing democratic principles.",
            "url": "https://thehimalayantimes.com/opinion/unsolicited-advice-to-the-nepali-congress-reform-or-face-obsolescence"
        },
        {
            "title": "Festivals fostering unity in diversity-Speaker Ghimire",
            "description": "Speaker of the House of Representatives, Devraj Ghimire wished may the Lhosar festivals be celebrated in a less expensive manner in a way to preserve the vanishing tradition.",
            "url": "https://thehimalayantimes.com/nepal/festivals-fostering-unity-in-diversity-speaker-ghimire"
        },
        {
            "title": "DPM Yadav assumes office",
            "description": "On this occasion, he has signed his first decision aimed at removing delays in surgical services observed at federal and provincial hospitals, ensuring prompt services.",
            "url": "https://thehimalayantimes.com/kathmandu/dpm-yadav-assumes-office"
        }
    ],
    "current_page": 4
}