{
    "Spotify attacks Apple&#x27;s &#x27;outrageous&#x27; 27% commission": {
        "title": "Spotify has launched an outspoken attack on new transaction fees of up to 27% being levied by Apple in the US",
        "news": "Spotify has launched an outspoken attack on new transaction fees of up to 27% being levied by Apple in the US.On Wednesday, Apple announced it would permit app developers to sell products in places other than its own store - but only if they still paid commission.Spotify said that was &quot;outrageous&quot; and accused Apple of &quot;stopping at nothing&quot; to protect its profits. It is urging the British government to prevent similar fees being levied in the UK.Apple has been approached for comment. The firm introduced the fees in the US as a result of a long-running legal battle with Fortnite developer Epic Games.The court found in favour of Apple on multiple issues, but it fell foul of a law by not allowing app developers to tell people about other ways of paying, including through links that bypass Apple&#x27;s own App Store payment system.Apple charges the biggest developers a 30% fee to use this system, though smaller developers pay around 15%, and 85% of developers don&#x27;t pay a fee at all.As a result of the ruling, Apple has introduced a new set of rules in the US which will allow people to subscribe to services without using its system, but it will charge developers up to a 27% commission to do so.According to court documents filed by the firm, it said the commission charge was compliant with the court ruling, adding that App Store developers benefit from Apple&#x27;s services.&quot;All App Store developers - including those who place buttons or links with calls to action in their apps - benefit from (among other things) Apple&#x27;s platform integrity,&quot; it said in the filings.It also listed other benefits developers receive, including: &quot;marketing and external advertising, and a safe environment for users to download and purchase apps and in-app content.&quot;Spotify has reacted with fury, saying the policy &quot;flies in the face&quot; of the US court&#x27;s attempt to enable greater competition.&quot;Once again, Apple has demonstrated that they will stop at nothing to protect the profits they exact on the backs of developers and consumers under their app store monopoly,&quot; it said in a statement. Spotify has a history of attacking Apple over its fees. In October 2023 it accused it of having an &quot;insane&quot; level of control over the internet.Now, it says the UK government should intervene.&quot;The UK&#x27;s Digital Markets, Competition and Consumer Bill must put an end to this false posturing, which is essentially a recreation of Apple&#x27;s fees.&quot;We strongly urge UK lawmakers to pass the bill swiftly to prevent Apple from implementing similar fees, which will help create a more competitive and innovative tech industry for UK consumers and businesses.&quot;The Government put forward its digital markets bill last year aimed at curbing the power of the tech giants. The bill would empower authorities to &quot;consider targeted measures&quot; regarding app store transactions to maintain open and competitive digital markets, a spokesperson for the Government told the BBC. However, the spokesperson declined to say if authorities would intervene in Apple&#x27;s case after the bill passes.&quot;It is not for us to comment on specific cases,&quot; the person said. "
    },
    "Apple watch: US upholds ban on sale over patent dispute": {
        "title": "Apple has once again been banned from selling two smartwatch models in the US, while a legal battle continues over a patent dispute",
        "news": "Apple has once again been banned from selling two smartwatch models in the US, while a legal battle continues over a patent dispute.The tech giant was earlier allowed to sell its Series 9 and Ultra 2 watches while proceedings were ongoing - but a US appeals court has since reversed that decision.Imports of watches are also affected.On Thursday, Apple said it will release watches without the disputed blood oxygen feature to keep them on shelves.It is the latest turn in a dispute between the firm and medical technology company Masimo.Masimo and spin-off Cercacor have accused the iPhone maker of poaching key staff and taking other steps to steal technology it developed to measure oxygen levels in the blood.In October, the US International Trade Commission said it agreed that Apple had violated some patent rights and issued an order barring certain imports and sales. This had been due to go into effect in late December but was paused while the appeal was underway.Most versions of Apple&#x27;s watches, including the Series 9 and Ultra 2, have included the feature since 2020. The SE model does not.The affected watches cannot be imported from 17:00 ET (22:00 GMT) on Thursday.Masimo&#x27;s founder and chief executive Joe Kiani said the ruling showed that &quot;even the largest and most powerful companies must respect the intellectual rights of American inventors and must deal with the consequences when they are caught infringing others&#x27; patents&quot;.Apple said that it &quot;strongly disagreed&quot; with the US International Trade Commission&#x27;s view that it had violated some patent rights.&quot;Pending the appeal, Apple is taking steps to comply with the ruling while ensuring customers have access to Apple Watch with limited disruption,&quot; the company said in a statement.Apple now has the lion&#x27;s share of the global smartphone market, as it knocked Samsung off the top spot for the first time in 12 years.It accounted for more than a fifth of phones shipped last year, according to data from the International Data Corporation released this week."
    },
    "Apple overtakes Samsung as world&#x27;s biggest phonemaker": {
        "title": "Apple now has the lion&#x27;s share of the global smartphone market, knocking Samsung off the top spot for the first time in 12 years",
        "news": "Apple now has the lion&#x27;s share of the global smartphone market, knocking Samsung off the top spot for the first time in 12 years.The American phone giant accounted for more than a fifth of phones shipped last year, according to data from the International Data Corporation (IDC).Samsung took 19.4% of the market share with Chinese phonemakers Xiaomi, OPPO and Transsion following behind.Smartphone sales have been faltering as many people upgraded in the pandemic.The IDC reports that almost 1.2 billion smartphones were sold last year - a drop of more than 3% on the previous year. It is the lowest amount sold in a decade, with many consumers tightening their purse strings in the face of economic challenges and high interest rates. Experts predict the market will recover this year.Apple&#x27;s riseStill, the IDC said Apple - which sold more than 234 million phones last year - is &quot;the biggest winner&quot;.&quot;Not only is Apple the only player in the Top 3 to show positive growth annually, but also bags the number 1 spot annually for the first time ever,&quot; said the IDC&#x27;s Nabila Popal. &quot;All this despite facing increased regulatory challenges and renewed competition from Huawei in China, its largest market.&quot; Huawei has recently made strides in making its own chips, after being banned from buying chips that were made using US technology over claims the company poses a national security risk to Washington. Offers to trade in old models as well as interest-free financing plans are also driving demand for premium devices like Apple.Samsung slumpIt&#x27;s disappointing news for Samsung which - until now - had the top spot as the world&#x27;s largest maker of memory chips, smartphones and televisions.  Recently, the South Korean electronics giant warned its profits would drop more than expected as global demand for consumer electronics remains weak.It is also facing competition from cheaper Android models including Transsion and Xiaomi which are getting a boost from both price-savvy consumers and emerging markets.The IDC also said the smartphone market is entering a &quot;very interesting time&quot;, with a growing number of Android-providers splintering the market and customers increasingly prioritising foldable phones and AI capabilities. "
    },
    "Apple Vision Pro: $3,499 headset finally gets release date": {
        "title": "Apple has announced its long-awaited Vision Pro headset will go on sale on 2 February in the United States",
        "news": "Apple has announced its long-awaited Vision Pro headset will go on sale on 2 February in the United States.US customers have been given the option to pre-order the $3,499 (Â£2,749) mixed-reality device from mid-January, though no date has been set for a UK launch.It is the first major new product to be released by the firm since the Apple Watch launched in 2015.After years of rumours during development, the company revealed the headset in June 2023.But there have been issues since then. According to the Financial Times, Apple has more than halved its production forecasts, dropping from an estimated one million units to 400,000 in 2024.As well as the release date, Apple also announced the device will have 256GB of storage, and it clarified that the headset&#x27;s eye-tracking technology can function by monitoring just one dominant eye, for people who do not have full use of both their eyes.But interestingly the firm is trying to separate the headset from other devices on the market, telling developers for the device to instead brand their apps as &quot;spatial computing&quot;.&quot;Don&#x27;t describe your app experience as augmented reality (AR), virtual reality (VR), extended reality (XR), or mixed reality (MR),&quot; it said in a blog post targeting developers.Apple has also released a trailer online, featuring characters from films donning goggles and helmets, in what feels like an attempt to recreate the hype around the launch of the iPhone in 2007.If successful, this could be a new multi-billion dollar source of income for Apple. But as many people all over the world struggle to afford life&#x27;s basics, the high price tag is likely to keep this in the realm of a toy for the well-off.Hands-onThe BBC had the opportunity to try out the Vision Pro in June last year, and found mixed reality to be a mixed bag.   We were among the few news organisations in the world allowed to test out the device - but no photos or filming were allowed. Unlike many existing headsets, Apple has detached the battery, so it doesn&#x27;t sit heavy on your head - although it does mean the battery has to sit beside you instead, attached to a cable.The user experience is classic, minimalist Apple. Once the headset is on, you see the room around you but you&#x27;re not seeing it through glass, you&#x27;re seeing it through the many on-board cameras. This is the &quot;mixed-reality&quot; experience - digital content projected on to your surroundings.You physically press a single button on the top right-hand side of the headset, and up pops familiar app icons you&#x27;ll recognise if you have used an iPhone - iMessage, Photos, Apple TV (there will be more as developers make them). And from then on it&#x27;s all about gesture control - the headset tracks where you are looking so when you look at an app and pinch your thumb and forefinger together, it opens.You can choose your level of immersion using a physical dial to turn up or down the size of whatever it is that you&#x27;re looking at. It can fill the entire room or appear like a TV screen superimposed against your wall. But if someone walks in front of you in real life, you can see them no matter how immersed you are.Still, whenever there was an issue with the demo, an Apple employee would remind us that it was not a finished product, and Apple&#x27;s ban on any filming during the demonstration meant that these issues couldn&#x27;t be recorded or shared online. Read Zoe&#x27;s full review here."
    },
    "Apple pays out over claims it deliberately slowed down iPhones": {
        "title": "Apple has begun making payments in a long-running class action lawsuit over claims it deliberately slowed down certain iPhones in the US",
        "news": "Apple has begun making payments in a long-running class action lawsuit over claims it deliberately slowed down certain iPhones in the US.Complainants will receive a cut of a $500m (Â£394m) settlement which works out to around $92 (Â£72) per claim.Apple agreed to settle the lawsuit in 2020, stating at the time it denied any wrongdoing but was concerned with the cost of continuing litigation.A similar case under way in the UK is seeking Â£1.6bn in compensation.The US case dates back to December 2017, when Apple confirmed a long-held suspicion among phone owners by admitting it had deliberately slowed down some iPhones as they got older.It said that as batteries aged, their performance decreased, and so the &quot;slowdown&quot; lengthened the phones&#x27; lifespan.But it was accused of throttling the performance of certain iPhones without telling its customers, and the uproar resulted in Apple offering a cut-price battery replacement to fix the problem.It led to the US legal action. At the time of the settlement, it was estimated that each person might receive as little as $25 each but the actual pay-out appears to be almost four times that sum.In the UK, Apple lost a bid to block a similar mass action lawsuit last November.The case, first brought by Justin Gutmann in June 2022, represents an estimated 24 million iPhone users.Apple has previously called the lawsuit &quot;baseless&quot; and said &quot;we have never - and would never - do anything to intentionally shorten the life of any Apple product, or degrade the user experience to drive customer upgrades&quot;.Mr Gutmann told the BBC he was pleased to hear about payments being made in the US, but warned it does not have any bearing on the UK case.&quot;It doesn&#x27;t advance our position here, they haven&#x27;t admitted anything - they&#x27;ve settled,&quot; he said.&quot;It&#x27;s a moral victory but not much use to me. I&#x27;ve got to plough on and pursue the case in the UK jurisdiction.&quot;He said Apple was &quot;fighting tooth and nail&quot; against the UK class action, which will next appear at the Court of Appeal who will consider a call from the firm to halt the case.He said it was difficult to put a timeline on what would come next but hopes it will go to trial in late 2024 or early 2025."
    },
    "&#x27;Apple nerds&#x27; wanted to find Luton&#x27;s lost orchards": {
        "title": "A new project is hoping to &quot;help people fall back in love with orchards&quot; in their town",
        "news": "A new project is hoping to &quot;help people fall back in love with orchards&quot; in their town. Luton Orchards is asking residents to uncover the town&#x27;s fruit-growing history and map out where trees remain. Project founder and coordinator Konni Deppe believes the number of orchards in Luton has fallen by 90% over the past century. She hopes by joining her &quot;citizen science&quot; scheme, people will take a fresh interest in urban fruit-growing.&quot;Orchards are good on so many levels - they are wildlife habitats, but also work for people, providing food, nature and mental wellbeing,&quot; she said. Image caption, Konni Deppe helped to plant People&#x27;s Park orchard in High TownMs Deppe &quot;caught the apple bug&quot; after helping to plant People&#x27;s Park orchard in 2019, which includes plums, pears, apples and gages. She points out one tree which is a Luton variety - Pam&#x27;s Delight. It was first grown in 1958 by Alfred Hull and named after his daughter Pam. Listen: What happened to all Luton&#x27;s orchards?&quot;I kick-started the project to understand what we&#x27;ve had in the past, what we&#x27;ve lost - and also to look at the orchards we have now, to see how we can care for them.  &quot;I want to know, how can we make orchards part of our local traditions?&quot;Image source, Jeff &amp; Dave WittsImage caption, Alfred Hull developed apple variety Pam&#x27;s Delight in Luton in 1958Funded by Heritage Lottery money and armed with old Ordnance Survey maps, Ms Deppe has located 150 historic orchards in Luton - compared to the 15 sites that exist now. &quot;There were three kinds - orchards on farms, commercial plantations and fruit trees attached to pubs. &quot;I am really hoping there&#x27;s still the odd tree in someone&#x27;s pub garden.&quot;She is appealing to &quot;fruit tree fans&quot; for help, whether that is desk research, sharing memories or learning pruning skills. &quot;The first step is to have a look at the old locations to see if there is anything left,&quot; she said.&quot;And we want to hear from anyone with memories of orchards, of going scrumping, of fruit farming in the area.&quot;Image source, Luton Orchards/Ordnance SurveyImage caption, Lost orchards, like this one in Round Green, are being marked on special mapsMaking sure Luton&#x27;s fruit trees do not go to waste is another aspect of the project. Ms Deppe and her friends organised an &quot;apple amnesty&quot; with Penrose Roots, collecting 250kg (550lb) of surplus apples from people&#x27;s gardens and community orchards. The apples were turned into juice at Apple Cottage press in Radwell, near Baldock, and sold at Christmas markets.&quot;The juice flew off the shelves. People are really surprised - and pleased - to buy Luton apple juice,&quot; she said. Image source, Luton OrchardsImage caption, Luton apple juice was made using surplus crops from across the townMs Deppe hopes in future they will be able to press enough apples to provide juice for half of the town, but she said more hands on deck were needed. &quot;We&#x27;ve reached peak community orchard, we need more people to help care for fruit trees,&quot; she said.&quot;People and fruit trees are tightly connected. It&#x27;s not something you plant and then forget about.&quot;If we can find the &#x27;apple nerds&#x27; of Luton, that would be amazing.&quot; Follow East of England news on Facebook, Instagram and X. Got a story? Email eastofenglandnews@bbc.co.uk or WhatsApp  0800 169 1830"
    },
    "US lifts ban on imports of latest Apple watch": {
        "title": "Apple&#x27;s latest smart watches can resume being sold in the US after the tech company filed an emergency appeal with authorities",
        "news": "Apple&#x27;s latest smart watches can resume being sold in the US after the tech company filed an emergency appeal with authorities.Sales of the Series 9 and Ultra 2 watches had been halted in the US over a patent row. The US&#x27;s trade body had barred imports and sales of Apple watches with technology for reading blood-oxygen levels.Device maker Masimo had accused Apple of poaching its staff and technology.It comes after the White House declined to overturn a ban on sales and imports of the Series 9 and Ultra 2 watches which came into effect this week. Apple had said it &quot;strongly disagrees&quot; with the ruling. The iPhone maker made an emergency request to the US Court of Appeals, which proved successful in getting the ban lifted.Earlier this month, Apple had &quot;pre-emptively&quot; removed the devices from its US site and from stores in the country. Sales elsewhere have not been affected.The US International Trade Commission (USITC) order, issued in October, was subject to a 60-day review by the president, who has the power to veto the decision. That review period ended on Christmas Day, when the White House decided to keep the ban in place.The office of the United States Trade Representative Ambassador, Katherine Tai, said on Tuesday that it had decided not to reverse the USITC&#x27;s decision after &quot;careful consultations&quot;.Apple halts some Watch sales in the USApple sales dip again despite iPhone boost Apple had asked for a stay on the ban until Customs and Border Protection (CBP) could consider whether the redesigned versions of its watches, which do not include the disputed technology, violated Masimo&#x27;s patents. CBP was due to make its decision on 12 January, according to an Apple spokesperson. The USITC found in October that Apple infringed two patents owned by medical device maker Masimo Corporation.The California-based company had accused Apple of poaching key staff and taking other steps to steal technology it developed to measure oxygen levels in the blood.Most versions of Apple&#x27;s smart watches have included the disputed blood oxygen feature since 2020.  Its lower cost SE models do not. Previously sold watches will also not be affected by the ban.  In a statement given on Tuesday, Apple said: &quot;We strongly disagree with the USITC decision and resulting exclusion order, and are taking all measures to return Apple Watch Series 9 and Apple Watch Ultra 2 to customers in the US as soon as possible&quot;."
    },
    "Apple halts some Watch sales in the US": {
        "title": "Apple will stop selling its latest watches in the US, after the US found it had violated patent rights",
        "news": "Apple will stop selling its latest watches in the US, after the US found it had violated patent rights. An order barring sales and imports of watches with the disputed blood oxygen feature is due to go into effect on 26 December. Apple has said it plans to appeal the decision but would &quot;pre-emptively&quot; remove the devices from its US site 21 December and from stores in the country after Christmas Eve.  Sales elsewhere are not affected. &quot;Apple strongly disagrees with the order and is pursuing a range of legal and technical options to ensure that Apple Watch is available to customers,&quot; Apple said.The issue stems from a dispute with California-based medical device firms Masimo and spin-off Cercacor, which have accused the iPhone giant of poaching key staff and taking other steps to steal technology it developed to measure oxygen levels in the blood. Most versions of the company&#x27;s smart watches, including the Series 9 and Ultra 2, have included the feature since 2020. The SE model of the watch does not. In October, the US&#x27;s International Trade Commission said it agreed that Apple had violated some patent rights and issued an order barring certain imports.At the time Masimo chief Joe Kiani said it sent a &quot;powerful message that even the world&#x27;s largest company is not above the law&quot;.The International Trade Commission order is subject to a 60-day review by the president, who has the power to veto the decision. That review period is due to end 25 December.Intervention is typically rare, though former president Barack Obama did intervene on behalf of Apple in a different dispute in 2013.Apple has also said it will appeal the International Trade Court decision and ask for the order to be suspended while the appeal is decided.The dispute is part of a broader fight with Masimo over the oxygen technology. Apple has separately filed its own claims of patent infringement against Masimo.A jury trial over Masimo&#x27;s claims of theft ended in a mistrial earlier this year. Apple shares fell more than 1% on the news, though analysts said the timing would allow holiday sales to proceed without serious damage.The company&#x27;s wearables division, which includes the Watch, accounted for nearly $40bn, or about 10% of the firm&#x27;s overall sales in the 12 months ended 30 September. "
    },
    "Why you may not get Kashmir&#x27;s famed apples easily": {
        "title": "On a chilly and foggy winter day, hundreds of apple farmers in Pulwama district of Indian-administered Kashmir stored their harvest in a temporary tin shelter installed at the fruit market, anticipating the arrival of traders who would purchase their produce",
        "news": "On a chilly and foggy winter day, hundreds of apple farmers in Pulwama district of Indian-administered Kashmir stored their harvest in a temporary tin shelter installed at the fruit market, anticipating the arrival of traders who would purchase their produce. The farmers were anxious as the quality of apples this year had not been the best and would affect the price they&#x27;d get. Kashmir is known in India for its variety of apples. But a series of challenges - from the onslaught of fungal scab, the impact of climate change, and a range of economic hurdles - has thrown the flourishing industry into a state of crisis. Apples are classified into A, B and C categories based on their size, colour and quality. A is the premium category while B and C are those infected with scab (venturia inaequalis) -â\u0080¯B being less infected than C. &quot;Around 40% of the apple production [this year] has been C-grade,&quot; says Ghulam Nabi Mir, an orchardist from Pulwama.â\u0080¯ The horticulture department of Jammu and Kashmir says apple, walnut and almond farming provide direct and indirect employment to about 2.3 million people in the region.â\u0080¯ Exports from the Himalayan region&#x27;s orchards amount to over two million tonnes annually, generating approximately 120bn rupees ($1.44 bn, Â£1.14bn) in revenue - which is almost twice as much as the region&#x27;s tourism sector, Ejaz Ayoub, an independent Srinagar-based economist, told the BBC.  But unusual weather patterns are beginning to take a toll. &quot;Unseasonal rainfall in April-May led to scab affecting the crop,&quot; says Abdula Gaffar Qazi, 50.â\u0080¯&quot;Even when some farmers sprayed pesticides, the rain washed it away.&quot; â\u0080¯  Extreme weather patterns impact the size, quality and quantity of the crop, says Dr Tariq Rasool Rather, a senior scientist at Sher-e-Kashmir University of Agricultural Sciences.â\u0080¯ Image source, Umer AsifImage caption, Apple trade generates almost twice as much revenue as the region&#x27;s tourism sector, experts sayDepending on whether scab affects the crop during the summer or spring season, apple quality can decline to a B or C grade. Ghulam Mohammad Bhat, 58, a farmer from the Chadoora area of Kashmir&#x27;s Budgam district, says he has never witnessed such unusual weather patterns in the region before.â\u0080¯ &quot;Hailstorm in May damaged my crop,&quot; he says, adding that a prolonged dry spell in August and September caused water scarcity, leading to diminished colour in the apples. Mr Bhat&#x27;s apple orchard is spread over five acres but more than half of the trees are infected with scab.â\u0080¯ Data from Jammu and Kashmir&#x27;s meteorology department shows the frequency of severe weather occurrences in the ecologically sensitive Kashmir Valley has increased over the past seven years. Over 550 people have been killed in extreme weather events in Jammu and Kashmir between 2010 and 2022, it says. On 18 July 2021, Kashmir witnessed the hottest July in eight years with a record temperature of 35C (95F).  Earlier that year in January, the valley had also recorded the coldest night in 30 years. According to Faizan Arif Keng, an independent weather forecaster in Kashmir, the region witnessed dry weather with temperatures approximately 12C above normal from March to mid-April this year, resulting in early flowering of apple crops. But the weather then changed abruptly and temperatures remained below normal until June.â\u0080¯ &quot;This &#x27;false spring&#x27; damaged the crop,&quot; he says.â\u0080¯ Extreme weather makes crop transportation also a major challenge for farmers.â\u0080¯ Harvest starts in autumn season.â\u0080¯But the valley remains cut off from the rest of the world in winters because of the landslides on the treacherous Srinagar-Jammu national highway, the only road that connects the region to the other states of the country.â\u0080¯ It&#x27;s common to see hundreds of trucks carrying apples stranded for days if landslides block the highway.â\u0080¯ Vijay Taira, vice-president of the Kashmir Apple Merchants Association in the Azadpur fruit market in Delhi, says there&#x27;s been an influx of Iranian apples in India&#x27;s fruit markets. This, growers say, affects the Kashmiri apple&#x27;s market share and its price &quot;Only two weeks ago, a box of Kashmiri apples would sell at 1,000-1,300 rupees in India&#x27;s fruit markets,&quot; says Ahmad Bashir, president of the Kashmir Valley Fruit Growers Cum Dealer Union (KVFG).â\u0080¯&quot;Now, it is being sold at 800 rupees a box, which does not even cover the cost of production.&quot;  The Indian government&#x27;s decision to waive off a 20% tariff on apples imported from the United States has also left farmers in distress over drop in prices, he says. Image source, Umer AsifImage caption, Extreme weather patterns impact the size, quality and quantity of the crop, a senior scientist saysIn November, KVFG wrote to Prime Minister Narendra Modi, seeking his intervention in resolving the crisis. The region&#x27;s horticulture department says these issues can only be resolved at the federal level. &quot;We have raised these concerns with the government,&quot; says Manzoor Ahmad Mir, deputy director of the department. &quot;Only they can take a call [on it].&quot;â\u0080¯ Kashmiri apple farmers also worry the government is not cracking down on dealers selling spurious or sub-standard pesticides.â\u0080¯ &quot;If the pesticides were of reliable quality, the scab in our orchards would be less,&quot; Mr Bhat says. Shafiqa Khalid, also a deputy director at the region&#x27;s horticulture department, says strong action has been taken against accused dealers and criminal cases have been filed against them. Problems arise when farmers don&#x27;t heed advisories regarding pesticide spray schedule, she says. When apple farmers don&#x27;t make good income, the &quot;consumption which drives the domestic economy&quot; is directly impacted, Mr Ayoub, the economist, explains.â\u0080¯ &quot;The money flows in the market and reaches many people associated with different kinds of trade,&quot; he says. &quot;So, if the money stops, people from all walks of life will be impacted."
    },
    "Boy campaigns against Apple&#x27;s &#x27;nerd&#x27; glasses emoji": "",
    "Apple to bridge message divide - but keeps green bubbles": {
        "title": "Hopes have risen that the era of green and blue message bubbles on iPhones might eventually come to an end",
        "news": "Hopes have risen that the era of green and blue message bubbles on iPhones might eventually come to an end. Currently only iMessages from iPhones have blue bubbles.Apple says it will support a new messaging standard that will make it easier to send texts between phones. But messages from Android phones will still appear as green bubbles, suggesting those who want the bubble divide to burst may have a long wait. The company said it will introduce support for a new messaging standard - Rich Communication Services (RCS) - on iPhones and iOS devices from 2024.RCS is a standard designed to make it easier for phones on different operating systems to exchange messages.The move, first reported by 9to5Mac, has been viewed as a sea-change for Apple.Apple plans to introduce support for the messaging standard in a software release later next year.An Apple spokesperson told the tech publication that RCS would be better for users seeking to message users of rival phones compared to SMS or MMS. &quot;This will work alongside iMessage, which will continue to be the best and most secure messaging experience for Apple users&quot; the spokesperson said.Google, which develops the Android phone operating system, has been the biggest competitor calling on Apple to enable RCS.Its &quot;get the message&quot; campaign has emphasised that besides frustration for some users met with green-coloured messages on iPhones or iOS devices, SMS and MMS messages are not protected by end-to-end encryption.Recent EU rules for digital platforms may have also encouraged Apple&#x27;s adoption of RCS. The bloc&#x27;s Digital Markets Act (DMA) requires providers of major digital services - so called core services -  to introduce ways for users of their platforms to easily interact with rival platforms - including sending messages between rival systems.The Financial Times reported in early November that Google and other firms had written to the European Commission, urging it to declare Apple&#x27;s iMessage a core service that should be interoperable with rivals like WhatsApp.Apple has argued iMessage shouldn&#x27;t be subject to these rules, but the European Commission had said in September it was investigating whether Apple&#x27;s iMessage should be deemed a core service.Earlier this year Apple was forced to ditch its signature lightning port on new iPhones to meet EU requirements for a common charging cable.Apple&#x27;s announcement comes days after phone manufacturer Nothing launched a way for owners of its latest smartphone to send iMessages to iPhone users. The company said its app Nothing Chats would offer a bridge between iPhone and Android handsets and let users connect via blue bubble messages. Responding to the news of Apple adopting RCS the company posted on X (formerly Twitter), &quot;looks like they got the message&quot;."
    },
    "Google sends a third of Safari ad revenue to Apple": {
        "title": "New detail on just how much Google is willing to pay to be a go-to search engine has slipped out in court in the US, where the tech giant is on trial defending itself from monopoly claims",
        "news": "New detail on just how much Google is willing to pay to be a go-to search engine has slipped out in court in the US, where the tech giant is on trial defending itself from monopoly claims. An expert testifying on behalf of Google said it sends 36% of the advertising revenue it makes on Apple&#x27;s Safari web browser to the iPhone maker. The relationship between the two firms is at the heart of the monopoly case.Prosecutors say their dealings have illegally restricted competition.The lead lawyer for Google &quot;visibly cringed&quot; when the specific share of ad revenue sent to Apple was revealed, according to Bloomberg.Google has maintained that its dominance of online searches is due to having a superior product. The high-stakes trial pitting Google against the US Department of Justice started in September. Many of the proceedings have been shielded from public view, to protect trade secrets.But some details have emerged. All told, Google paid more than $26bn to other companies, including Apple, Samsung and Mozilla, be installed as the default search engine, according to statements heard at the trial. Analysts on Wall Street have estimated that amounted to more than $18bn for Apple alone. University of Chicago professor Kevin Murphy, who revealed the share of advertising revenue Google sends to Apple from traffic on Safari, was testifying that the hefty sums Google and parent company Alphabet pay are evidence of the stiff competition in the market - one of the arguments advanced by Google.  The trial is expected to wrap up in the coming days, after a parade of witnesses, who have included Alphabet chief Sundar Pichai and Microsoft boss Satya Nadella. Prosecutors from the US Department of Justice are seeking stiff penalties, including an end to anti-competitive practices. A ruling against Google could have major implications for the tech industry, even if it falls short of a break-up of the company. Judge Amit Mehta, who has been overseeing the proceedings, is not expected to rule on the case until early next year."
    },
    "Apple co-founder Steve Wozniak suffers minor stroke": {
        "title": "Apple co-founder Steve Wozniak is on his way home after suffering a minor stroke, according to US media reports",
        "news": "Apple co-founder Steve Wozniak is on his way home after suffering a minor stroke, according to US media reports.Mr Wozniak told ABC News a MRI scan confirmed he had a stroke whilst attending the World Business Forum in Mexico City.The 73-year-old was taken to hospital after passing out at the conference, according to the CNN news website.The BBC has contacted representatives of Mr Wozniak for comment.Better known in the tech world as Woz, Mr Wozniak is a Silicon Valley veteran who co-founded Apple with Steve Jobs in 1976 and invented the first Apple computer.Apple went on to become the most valuable company in the world. The computing pioneer signed a letter in March alongside Elon Musk calling for a pause in the development of the most powerful artificial intelligence (AI) models.AI could make scams harder to spot - WozniakHe called for the regulation of AI when he spoke to the BBC in May 2023, fearing the technology would be harnessed by &quot;bad actors&quot;.He said: &quot;AI is so intelligent it&#x27;s open to the bad players, the ones that want to trick you about who they are."
    },
    "Apple should pay â\u0082¬13bn Irish tax, argues EU lawyer": {
        "title": "A legal adviser to the European Court of Justice has argued a ruling allowing Apple to avoid paying â\u0082¬13bn (Â£11bn) in back taxes should be overturned",
        "news": "A legal adviser to the European Court of Justice has argued a ruling allowing Apple to avoid paying â\u0082¬13bn (Â£11bn) in back taxes should be overturned.The move is the latest in the long-running saga between the EU, the US tech giant and the Irish government.Three years ago, a ruling which found Apple had been given illegal tax breaks by the Irish government was overturned.But Advocate General Giovanni Pitruzzella at the Court of Justice said the case should be reviewed again.He argued a series of legal errors had been made and the ruling in Apple&#x27;s favour had failed &quot;to assess correctly the substance and consequences of certain methodological errors that, according to the Commission decision, vitiated the tax rulings&quot;.The legal opinion is not a final verdict and is non-binding, but the court does tend to agree with such opinions in the majority of cases.In response to the latest twist, an Apple spokesman said that the initial ruling allowing the firm to avoid paying back taxes was &quot;very clear that Apple received no selective advantage and no state aid&quot;.&quot;We believe that should be upheld,&quot; they added.Amazon v EU: Has the online giant met its match?Apple has â\u0082¬13bn Irish tax bill overturned In 2016, the European Commission decided Apple had received unfair preferential treatment from the Irish government, allowing it to pay a much lower rate of tax than other companies.The Commission said this constituted illegal aid given to Apple by the Irish state.The affair became a symbol of the Commission&#x27;s efforts to clamp down on what it saw as massive tax avoidance by multinational giants.The Irish government has argued that Apple should not have to repay the back taxes, deeming that its loss was worth it to make the country an attractive home for large companies.Ireland, which has one of the lowest corporate tax rates in the EU, is Apple&#x27;s base for Europe, the Middle East and Africa.Although corporation tax rates for businesses are set nationally, and are not subject to the EU&#x27;s jurisdiction, the trade bloc does have extensive powers to regulate state aid and in this case, it argued that by applying very low tax rates to Apple, Ireland was granting it an unfair subsidy.  Two years ago, the lower court, known as the General Court, ruled that the European Commission&#x27;s decision that Apple should pay back taxes was legally flawed and should be set aside, but that ruling itself could now be overturned after the latest twist."
    },
    "Somerset: Tonnes of apples wash up after Storm CiarÃ¡n": {
        "title": "Two tonnes of apples have washed into the corner of an orchard after recent stormy weather blew them off the trees",
        "news": "Two tonnes of apples have washed into the corner of an orchard after recent stormy weather blew them off the trees.Somerset Cider Brandy, based near Martock, said it is now giving them away after high winds and floods in Storm CiarÃ¡n caused the unusual sight.Matilda Temperely, from the cider farm, said: &quot;We won&#x27;t be able to pick these apples with our harvesting machine as it&#x27;s a bit soggy.&quot;There&#x27;s a couple of tonnes of apple that people can help themselves to.&quot;Image source, Matilda TemperelyImage caption, The company said there is a &quot;nice mix of bittersweets&quot;Ms Temperley said the loss will not impact their full harvest as they have &quot;got a lot of apples in our fields&quot;.&quot;There&#x27;s about 300 tonnes of apples in the rest of our orchards,&quot; she said.Somerset Cider Brandy is based at Pass Vale Farm in Burrow Hill on the Somerset levels and has pressed cider for hundreds of years.It also runs the popular Cider Bus at Glastonbury Festival every year.Image source, Matilda TemperelyImage caption, The orchards were badly flooded during Storm CiarÃ¡nIn a post on its Facebook page, it welcomed people to come and collect any of the washed up apples.Ms Temperely said: &quot;We still have one orchard field that is fully underwater, which at the moment, you can only access with a canoe.&quot;The storm has caused a very strange sight but we have to expect more of this type of weather especially with climate change.&quot;Follow BBC West on Facebook, X and Instagram. Send your story ideas to: bristol@bbc.co.uk "
    },
    "Apple sales dip again despite iPhone boost": {
        "title": "Apple sales have continued to fall, despite strong demand for its iPhones and services like streaming platform Apple TV+",
        "news": "Apple sales have continued to fall, despite strong demand for its iPhones and services like streaming platform Apple TV+.The tech giant says revenues dipped 1% to $89.5bn (Â£73.3bn) in the three months to 30 September when compared with the same period last year.Sales of its Mac computers and iPads struggled after a post-lockdown surge in interest.It marks the fourth quarter in a row where sales have fallen year on year.In an update to investors, the firm said that profits had reached $23bn, helped by a new record for iPhone sales in the three-month period.The amount it took from services such as iCloud and Apple Music also hit a high, bringing in $22.3bn for the California-based firm, up 16% from a year before.But it cited concerns over potential supply chain issues hampering deliveries of its new iPhone 15 Pro and Pro Max devices.Apple chief executive Tim Cook said it was &quot;working hard to manufacture more&quot;. &quot;We do believe that later this quarter, we&#x27;ll reach a supply-demand balance,&quot; he said.Apple boss makes surprise China visitApple forced to ditch lightning in new iPhone 15Mr Cook said he felt the firm had its &quot;strongest line-up of products ever&quot; heading into the key Christmas trading period.The latest update suggested, however, that other Apple items had been failing to capture the customer&#x27;s imagination more recently.Its Mac computers, for example, saw sales drop to $7.6bn for the quarter, down from $11.6bn the year before.The company revealed its latest iPhone line-up in September at a highly anticipated conference.It announced that the iPhone 15 would not feature its proprietary lightning charging port, after the European Union forced the change. Instead, it uses a USB-C cable as the &quot;universally-accepted standard&quot;.It has also faced challenges elsewhere, with economic uncertainty weighing on consumers in the Chinese market.On Thursday, the company said that sales in China had dipped by 2.5%, although Mr Cook said that after accounting for foreign exchange rates its business there had grown year on year.The executive made a surprise visit to China last month, meeting gamers in the city of Chengdu.It marked his second visit to China - a key market for Apple - this year, as the firm&#x27;s operations in the country have been complicated by Covid restrictions and US-China tensions.In March, Mr Cook said he felt Apple had a &quot;symbiotic&quot; relationship with China, a key manufacturing base. "
    },
    "Apple alert: India opposition says government tried to hack phones": {
        "title": "Some Indian opposition leaders have accused the government of trying to hack into their phones after receiving warning messages from Apple",
        "news": "Some Indian opposition leaders have accused the government of trying to hack into their phones after receiving warning messages from Apple.Apple&#x27;s alert said it believed the recipient was &quot;being targeted by state-sponsored attackers&quot;.It did not specify who the attackers could be.When contacted by the BBC, Apple said that it did not attribute the threat notifications to any specific state-sponsored organisation.Federal ministers dismissed the allegations, with one calling it &quot;destructive politics&quot;.But he added that the government would &quot;investigate to get to the bottom of these notifications&quot;.So far, around a dozen opposition politicians have confirmed that they got the message from Apple. The list has MPs including Shashi Tharoor and KC Venugopal from the Congress party, Mahua Moitra from the Trinamool Congress and Priyanka Chaturvedi from the Shiv Sena UBT. Congress leader Rahul Gandhi also said that several people who worked in his office got the alert. &quot;We are not scared. You can do as much [phone] tapping as you want, I don&#x27;t care. If you want to take my phone, I will give it to you,&quot; Mr Gandhi said at a press conference.Some journalists - including Siddharth Varadarajan, a founding editor of news website The Wire - said they received the message too.Federal information technology minister Ashwini Vaishnaw posted on X (formerly Twitter) that the government has asked Apple to join its investigation &quot;with real, accurate information on the alleged state sponsored attacks&quot;.On its support page for users, Apple says that &quot;state-sponsored attackers are very well-funded and sophisticated, and their attacks evolve over time&quot;, adding that they target a &quot;very small number of specific individuals and their devices&quot;.It also says that it can&#x27;t give more details about what prompts it to issue these threat notifications as &quot;that may help state-sponsored attackers adapt their behaviour to evade detection in the future&quot;.Apple added: &quot;Detecting such attacks relies on threat intelligence signals that are often imperfect and incomplete. It&#x27;s possible that some Apple threat notifications may be false alarms, or that some attacks are not detected."
    },
    "Apple boss Tim Cook makes surprise China visit": {
        "title": "Apple chief executive Tim Cook has made a surprise visit to China",
        "news": "Apple chief executive Tim Cook has made a surprise visit to China.Though in an upbeat mood as he met gamers in the city of Chengdu, the company faces flagging iPhone demand in the country, analysts suggest.It is his second trip to China this year - in March he said Apple had a &quot;symbiotic&quot; relationship with China, a key manufacturing base.But the firm&#x27;s operations in the country have been complicated by Covid and US-China tensions.Mr Cook&#x27;s visit included a trip to Apple&#x27;s Taikoo Li store to meet young players of Tencent&#x27;s Honour of Kings online battle game.&quot;The energy tonight was off the charts!&quot; he wrote on the Chinese social media platform Weibo.Honour of Kings started in Chengdu but was now &quot;a global phenomenon on the App Store&quot;, he told the state-run China Daily newspaper. He hoped that Chinese developers could repeat this success with software for Apple&#x27;s new Vision Pro augmented reality headset, which would also use a Chinese manufacturer, the report said.This year marks Apple&#x27;s third decade in the country. Mr Cook, who has been CEO since 2011, is regarded as the architect of Apple&#x27;s embrace of Chinese manufacturing, but the relationship has had its ups and downs in recent years. Covid restrictions hit production in China, and geopolitical tensions with the US have added to supply chain concerns. Recently the company has sought to increase production in India. Sales of its latest iPhone have not matched previous models, according to analysts who spoke to Bloomberg. They blamed sinking demand in China, and intensifying competition from rivals.Tough US export controls on advanced technology have made it hard for Chinese firms such as Huawei to produce models that can match the iPhone.But the launch in August of Huawei&#x27;s sell-out Mate 60 Pro phone, which contained advanced Chinese-made chips, suggested rivals were catching up.Mr Cook&#x27;s visit coincides with news of other Chinese tech advances.Chinese tech giant Baidu revealed on Tuesday that it had released the latest version of its Ernie AI model.Ernie 4.0 was, it claimed, a match for OpenAI&#x27;s GPT-4 systemAt a launch event led by Baidu chief executive Robin Li, the AI was shown writing a martial arts novel and creating advertising posters and videos.China now has a number of domestically developed large language models, but AI developers face tight restrictions.And when the BBC tried out an earlier version of Ernie the bot deflected questions about sensitive subjects such as the date of the Tiananmen Square crackdown (4 June 1989), or the name of a jailed former senior Communist Party figure (Bo Xilai), with the response: &quot;Let&#x27;s talk about something else.&quot;"
    },
    "Why your new Apple iPhone 15 is overheating": {
        "title": "Apple has blamed a bug in its operating system and updates to apps such as Instagram for its new iPhone 15 overheating",
        "news": "Apple has blamed a bug in its operating system and updates to apps such as Instagram for its new iPhone 15 overheating. Since the latest model of the smartphone went on sale in September, some users have complained the devices are getting too hot to touch.Apple said there was a bug when updating iOS 17 on the phone.But it also claimed that changes to third party apps are &quot;causing them to overload the system&quot;.iPhone users have come to expect their devices to become hotter during the initial set-up or when they are being backed up, due to the amount of processing power being used and the handset working overtime - but these issues with the iPhone 15 have been worse. Users took to social media to complain the new phones were searing.This Twitter post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on TwitterThe BBC is not responsible for the content of external sites.Skip twitter post by Amit raj singh chawlaAllow Twitter content?This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitterâ\u0080\u0099s cookie policy, external and privacy policy, external before accepting. To view this content choose â\u0080\u0098accept and continueâ\u0080\u0099.Accept and continueThe BBC is not responsible for the content of external sites.End of twitter post by Amit raj singh chawlaApple said that the device may feel warmer in the first few days &quot;after setting up or restoring the device because of increased background activity.&quot;The company said: &quot;We have identified a few conditions which can cause iPhones to run warmer than expected.&quot;This includes a bug in iOS 17 which is the latest version of Apple&#x27;s software which is accessible for its most recent models. It said that &quot;another issue involves some recent updates to third-party apps that are causing them to overload the system,&quot; and it is working with app developers on fixes that are in the process of being rolled out.Among the apps blamed for the problem are Instagram, Uber and the video game Asphalt 9, according to Apple.Instagram already fixed the issue with its app last week.The upcoming iOS 17 bug fix will not reduce performance in order to address the iPhone&#x27;s temperature.Apple stressed that the warming phones is not related to the new titanium casing that houses the iPhone 15 Pro and iPhone 15 Pro Max instead of the stainless steel used on older smartphones.It also dismissed speculation that the overheating problem was anything to do with the new USB-C port that allowed it to comply with a mandate issued by European regulators.Apple said the issue is not a safety or injury risk and will not impact the phone&#x27;s long-term performance."
    },
    "Herefordshire festival celebrates apple heritage": {
        "title": "Herefordshire&#x27;s historic connections with apples and the cider industry are to be celebrated in a 16-day festival featuring live music and other activities",
        "news": "Herefordshire&#x27;s historic connections with apples and the cider industry are to be celebrated in a 16-day festival featuring live music and other activities.AppleFest has been held for several years in Hereford with hundreds attending activities in 2022. This year&#x27;s event launches on Saturday with ciders and apple juice on offer alongside live performances.Herefordshire is renowned for its orchard heritage.Cider has been produced in the county for hundreds of years, starting on farms before moving to factory production from the 19th Century.Herefordshire is still known as one of the best cider-producing areas in the world, the county council said.Events on Saturday in High Town, Hereford, will also include free children&#x27;s activities and a market.Follow BBC West Midlands on Facebook, Twitter and Instagram. Send your story ideas to: newsonline.westmidlands@bbc.co.uk"
    },
    "Isaac Newton apple tree saplings auction raises more than Â£30k": {
        "title": "An auction of 10 saplings from the apple tree that inspired Sir Isaac Newton has raised more than Â£30,000 to help the upkeep of his birthplace",
        "news": "An auction of 10 saplings from the apple tree that inspired Sir Isaac Newton has raised more than Â£30,000 to help the upkeep of his birthplace.It is believed the scientist&#x27;s home in Woolsthorpe Manor, Lincolnshire, is where he saw an apple fall in 1666, which led to him discovering gravity.The online auction, which closed on Friday evening, raised Â£31,410.The National Trust, which runs the property, said the highest bid was Â£5,000.Andy Jasper, director of gardens and parklands at the trust, said interest had been &quot;phenomenal&quot;, having received more than 1,800 inquiries from potential bidders.Image source, National TrustImage caption, National Trust&#x27;s Andy Jasper said the response to the auction had been &quot;incredible&quot;&quot;It&#x27;s been incredible. It&#x27;s been one of the most fulfilling and rewarding experiences that we&#x27;ve had. We&#x27;ve never done this before,&quot; he said.It is the first time the saplings have been auctioned and the trust hoped the sale would mean the tree&#x27;s legacy could continue with the &quot;exact same genetic material to be preserved for a long time&quot;, Mr Jasper said. &quot;It&#x27;s such a famous tree and anything could happen to it - a storm could come along, a pest or disease could get to it, or it could even get vandalised.&quot;But the 10 people that end up with this tree could actually become custodians of this unique genetic material and allow us to actually clone again and put that back into Woolsthorpe, the birthplace of Isaac Newton.&quot;Image source, Bettmann/Getty ImagesImage caption, Sir Isaac Newton (1642-1727) carried out scientific research at his home in Woolsthorpe ManorBlue Diamond Garden Centres, which ran the public auction, previously said half of the money raised through the auction would be donated to help the trust with the upkeep of the manor.Funds generated from the sale would be spent on new fencing around the tree at the manor, as well as conservation of the grounds and property, Mr Jasper said.The winning bidders will be presented with the saplings at an event on 21 October.Sir Isaac, who is buried in Westminster Abbey, is credited with laying the foundations for our scientific age, with his laws of motion and theory of gravity underpinning much of modern physics and engineering.Follow BBC East Yorkshire and Lincolnshire on Facebook, X (formerly Twitter), and Instagram. Send your story ideas to yorkslincs.news@bbc.co.uk"
    },
    "Apple to buck layoff trend by hiring UK AI staff": {
        "title": "Apple&#x27;s chief executive Tim Cook said the firm wants to hire more staff in the UK, in contrast to redundancies seen across the tech sector",
        "news": "Apple&#x27;s chief executive Tim Cook said the firm wants to hire more staff in the UK, in contrast to redundancies seen across the tech sector.He said the company wants to take on more staff to work in artificial intelligence (AI).It comes a day after Fortnite-maker, Epic Games, announced it was cutting 16% of its workforce.Big firms including Amazon, Meta, Google and Microsoft have cut tens of thousands of jobs since 2022.Mr Cook has been critical of the trend of tech layoffs and in May, he called it a &quot;last resort&quot;.Instead, he told the PA news agency when asked about AI and jobs in the UK: &quot;We&#x27;re hiring in that area, yes, and so I do expect [investment] to increase.&quot;Companies are pouring money into AI. Amazon announced an investment of up to $4bn (Â£3.3bn) in San Francisco-based AI firm Anthropic on Monday.That followed Microsoft&#x27;s multibillion dollar investment in ChatGPT maker OpenAI in January.Technology Secretary Michelle Donelan said Apple&#x27;s decision was &quot;another vote of confidence in our burgeoning tech sector&quot;.&quot;Apple&#x27;s ongoing investment in brilliant British talent highlights our global credentials as both an AI and technology superpower,&quot; she wrote on X, the microblogging site formerly known as Twitter.Antony Walker, deputy chief of techUK, the industry association, said: &quot;The transformative nature of AI will certainly boost staff headcount in AI businesses over the next couple of years.&quot;But he added: &quot;In the long term, the skills need of the AI-powered economy of the future is harder to predict. That is why businesses and government should work together on a long-term strategy that puts training in digital skills and lifelong learning at the core.&quot; Meanwhile, Tim Pullan, CEO of ThoughtRiver, which provides AI for legal professionals, said he thought the global economy was at the start of &quot;an AI-driven revolution&quot;.&quot;It&#x27;s vitally important that the UK is at the forefront of this transformation,&quot; he said.&quot;As a country, we have huge potential to grow as an AI superpower, and I&#x27;m sure this is the start of a trend which will see more and more companies looking to take advantage of the UK&#x27;s deep tech expertise, and the UK benefiting from the investment and innovation that this will bring.&quot;Copyright concernsMr Cook said AI was behind several prominent features on Apple devices, such as software that detects if a person has fallen or been in a crash, as well as more commonly-used tools such as predictive typing.&quot;It&#x27;s literally everywhere on our products and of course we&#x27;re also researching generative AI as well, so we have a lot going on,&quot; he said.Generative AI - artificial intelligence which can create media based on text prompts - continues to be a target of investment for big firms despite widespread concerns over its impact of copyright, or ownership.That is because the software &quot;learns&quot; by analysing a massive amount of data often sourced online and people are concerned it draws on their copyrighted work.It has led to high-profile lawsuits in the US, with authors George RR Martin and John Grisham suing OpenAI over claims their books were used to train the system."
    },
    "Apple to update iPhone 12 in France over radiation": {
        "title": "Apple will update its iPhone 12 in France after fears about radiation, the country&#x27;s digital minister says",
        "news": "Apple will update its iPhone 12 in France after fears about radiation, the country&#x27;s digital minister says.Jean-Noel Barrot said Apple would deliver a software update for users in the country in the coming days.Sales of iPhone 12 were halted in France after a regulator detected too much electromagnetic radiation. Apple was told to fix the issue.The firm said the new update would only apply to users in France, where it said a specific testing protocol existed.The American tech giant suggested the radiation findings were a result of that testing regime, and that it was &quot;not a safety concern&quot;.The planned update raises questions over Apple&#x27;s plans for iPhone 12, which was released just three years ago, in other countries.Mr Barrot said that the radio frequency regulator (ANFR) would test the new update to check its compliance before iPhone 12 is allowed back on sale in the country.The World Health Organization has previously sought to allay fears about radiation emitted by mobile phones.It says on its website there is no evidence to conclude that exposure to low level electromagnetic fields is harmful to humans.In a statement sent to AFP news agency, Apple said the radiation finding in France was &quot;related to a specific testing protocol used by French regulators and not a safety concern&quot;. It said the iPhone 12 complied with emissions rules worldwide, but it would &quot;issue a software update for users in France to accommodate the protocol used by French regulators&quot;.The ANFR previously told Apple that if it could not resolve the issue via a software update, it would have to recall every iPhone 12 sold in the country.The regulator found iPhone 12&#x27;s Specific Absorption Rate (SAR) to be above what is legally allowed in France.The iPhone 12 smartphone was first released in September 2020 and it is still sold worldwide.France halts iPhone 12 sales over radiation levelsEuropean regulators examine iPhone 12 alert on radiation levels5G judged safe by scientists but faces tougher radiation rulesApple told BBC News earlier this week it was contesting the ANFR&#x27;s review.It said it had provided the regulator with lab results from both itself and third parties, which it said showed the device was compliant with all the relevant rules.But Mr Barrot gave Apple a two-week deadline, and said he believed there could be &quot;a snowball effect&quot; as France shared its findings with other regulators across the European Union (EU).Regulators from Belgium, the Netherlands and Germany said on Thursday they were now also looking into the issue.Germany&#x27;s BNetzA network agency told the BBC the French investigation could lead to measures that would apply to all EU members states.The UK and US have not announced any action following the French ban."
    },
    "iPhone 15: Apple forced to ditch lightning charger": {
        "title": "Apple has confirmed its new iPhone will not feature its proprietary lightning charging port, after the EU forced the change",
        "news": "Apple has confirmed its new iPhone will not feature its proprietary lightning charging port, after the EU forced the change.The tech giant said that the iPhone 15, unveiled at its annual event on Tuesday, would use a USB-C cable as the &quot;universally accepted standard&quot;.  A new Apple Watch series was also unveiled with a more advanced chip. But one analyst said a lack of &quot;headline-grabbing&quot; updates from Apple this year would disappoint some.&quot;It isn&#x27;t a surprise given the maturity of the iPhone and Watch,&quot; said Ben Wood from CCS Insight.&quot;It reflects just how refined the iPhone and Watch devices are and how tough it has become to deliver truly disruptive updates every year.&quot;Apple released a USB-C-to-lightning port adapter for Â£29 ($36). The product connects the lightning port accessories people will have built up over the years to its new USB-C-enabled iPhones or iPads. The latest iPhone handset, which goes on sale next week, is the first since 2012 to feature an alternative charging port. Image caption, Some Apple devices - such as the iPad Pro and Mac laptops - use USB-C (left) while the iPhone uses Lightning (right)The firm said the USB-C cable - which already works with many Apple laptops and iPads - will also work on new versions of its AirPods Pro earphones and wired EarPods headphones.The EU had told the tech giant to ditch its proprietary charging ports to make life easier for consumers, save them money, and help reduce e-waste by encouraging re-use of chargers. However, some warn the move will lead to a rise in discarded cables in the years to come. Perhaps in response, Apple used its launch event on Tuesday to make a series of environmental pledges about its new devices, including making the new Apple Watch range carbon neutral for the first time. New iPhone, new charger: Apple bends to EU rulesBBC editor tries out Apple&#x27;s $3,499 headsetIt will also increase the amount of recycled materials being used in batteries and other parts of the new Watch and iPhone.The company also confirmed it would no longer use leather in any of its accessories and pledged to become carbon neutral as a business by 2030.Apple boss Tim Cook said the new iPhone 15 range included the &quot;best and most capable iPhones we&#x27;ve ever made&quot;.The iPhone 15 and 15 Plus have been given brighter screens and improved camera systems, while the high-end iPhone 15 Pro and Pro Max now come with a titanium frame, meant to improve its strength.The Pro and Max also have an &quot;action button&quot; in place of the mute switch that can be customised for a variety of functions.The new Apple Watch will feature gesture control - double tapping two fingers together on the same hand where the device is worn enables wearers to answer or end a call. But some experts questioned whether consumers would be prepared to pay the high price tags for the devices given that they are not hugely different to their predecessors.How much is the new iPhone?The iPhone 15 starts at Â£799 and the iPhone 15 Pro starts at Â£999 in the UK.&quot;Convincing users to fork out for these new devices will not be easy during a cost-of-living crisis,&quot; said Paolo Pescatore, analyst and founder of PP Foresight. &quot;Some will see the new features as incremental, [although] collectively they enhance the overall experience which is priceless among Apple&#x27;s core user base.&quot;Apple&#x27;s shares were down slightly on Tuesday, failing to reverse a sharp drop last week sparked by reports that the Chinese government had banned officials from using iPhones. Huawei&#x27;s release of a new smartphone series in China had fuelled the investor unease.The global smartphone market has slumped from shipping 294.5 million total phones to 268 million in the second quarter of 2023. But Apple&#x27;s shipments fell the least of any major smartphone maker, dropping from 46.5 million phones to 45.3 million, according to analysts Counterpoint Research."
    },
    "Can new Apple iPhone 15 thunder without lightning?": {
        "title": "As I write this there are still several hours before Apple unveils the latest version of its best-selling product, the iPhone",
        "news": "As I write this there are still several hours before Apple unveils the latest version of its best-selling product, the iPhone. In the last few weeks we&#x27;ve seen the handset come under pressure separately from both the EU and China. Globally, smartphone sales in general are slowing, and Apple&#x27;s highly anticipated virtual reality headset - which the firm seemed to be positioning as a potential future iPhone - won&#x27;t go on sale until next year. When it does it will have a whopping $3,500 (Â£2,780) price tag. And so, in the meantime, we get to meet the 16th generation of a device which changed the smartphone landscape forever when it launched in 2007. It may be, ahem, mature, but it still commands enormous interest today - there are already more than 230 million Google search results for the phrase &quot;iPhone 15&quot;, despite no official previews from Apple itself.If you dive in and start reading the speculation and &quot;leaks&quot; buzzing around, you&#x27;ll see that the iPhone 15 models are likely to be a little lighter than their predecessors, with an improved chip, better battery life, better camera and titanium chassis. You may feel that I could have written something pretty similar this time last year, or the year before that. I probably did.Apple handset generations, like most devices, tend to feature incremental improvements most of the time. It&#x27;s one of the issues blamed for slowing sales worldwide. People are holding on to their devices longer - not only because they are expensive both financially and environmentally - but also because there&#x27;s no longer the same burning justification to treat yourself to an upgrade.&quot;I think Apple probably realise they&#x27;ve reached a point where there&#x27;s such a critical mass of iPhones that simply maintaining those volumes is a phenomenal achievement,&quot; Ben Wood, a smartphone expert at the analysts CCS Insight told me.He agrees that while we probably won&#x27;t see a radically different iPhone on stage at Apple&#x27;s annual September event in the US this evening, what we will see is the theatre of a wealthy company well-versed in performing for its fan club.Having said that, there is one physical development you won&#x27;t have seen before, and if you&#x27;re in Europe, you&#x27;ll certainly notice it. The iPhone 15 will almost certainly have a USB-C charging cable point. Currently iPhones rely on a proprietary lightning cable, while most other devices - including others made by Apple - tend to use USB-C. The crucial physical difference is that the two are different shapes. So if, for example, you have an iPhone and a Kindle, your iPhone charger won&#x27;t fit in the port for your Kindle and vice versa. Apple has long insisted that diversifying products always leads to greater innovation. It has also pushed wireless charging as an alternative for several years - all handsets since the iPhone 8 have been compatible. Nonetheless, the EU has had enough, and declared that all portable devices need to be compatible with a universal charger by December 2024. And the rest of the consumer tech sector isn&#x27;t about to convert to lightning, even if Apple were to allow it.But you might be justified in adding that cable to your cable drawer (you know the one) rather than ditching it - Ben Wood says there&#x27;s a booming market in second hand iPhones, especially in Africa. &quot;iPhones are getting into the hands of people who couldn&#x27;t previously afford themâ\u0080¦ and it locks them into the Apple ecosystem,&quot; he said.The EU isn&#x27;t the only territory laying down the law. Last week China reportedly banned the iPhone from state-run buildings (as you can imagine, there are rather a lot of those) on security grounds. This has less to do with the phone itself and more to do with the ongoing tech tussle between China and the US - but it caused Apple&#x27;s share price to wobble. The majority of people in China use Android devices, but the iPhone is the best-selling premium (by which I mean top-dollar) handset.It&#x27;s additionally awkward for Apple because it still makes products there. It has been trying to move away - the iPhone 14 is assembled in India, for example - but it still needs Chinese-based companies and factories. Apple still needs China then. But how much do the rest of us need - or want - the new iPhone? We&#x27;re about to find out.Follow Zoe Kleinman on X (Twitter) @zsk"
    },
    "Armagh: Tasting the Orchard County&#x27;s zingy, crisp apples": {
        "title": "With more than 4,000 acres of Armagh&#x27;s countryside dedicated to growing apples, it&#x27;s little wonder that it&#x27;s known as the Orchard County",
        "news": "With more than 4,000 acres of Armagh&#x27;s countryside dedicated to growing apples, it&#x27;s little wonder that it&#x27;s known as the Orchard County.It is thought the fruit has been grown there for more than 3,000 years.The evolution of their locally produced cider is being championed at the annual food and cider weekend.This year&#x27;s event, which runs until Sunday, will have British cider experts like Bill Bradshaw and Gabe Cook in attendance.They believe Armagh&#x27;s offering is a match for British and French competition thanks to the Armagh Bramley, its most celebrated apple, which was granted protected geographical indication status in 2012.&quot;They are amazing here - it gives a more acid-driven or acid-led style of cider - really fresh,&quot; says Bill.&quot;It&#x27;s the one that people start to use and build upon and that&#x27;s what helps to give it its unique characteristic for the region.&quot;They&#x27;re also growing some beautiful cider fruit, traditional British and French varieties that contain tannin, much like you would get from a grape, and they add a layer of complexity and balance out the cider.&quot;Image caption, British cider experts Bill Bradshaw and Gabe Cook say the apples in Armagh are fantasticStanding in an orchard with row upon row of apple trees, it&#x27;s hard not to see connections with French vineyards.That is something Gabe is keen to highlight.&quot;The thing to consider is that you make cider like you make a wine,&quot; he says.&quot;You don&#x27;t brew cider, although they present more like a beer. You take fantastic varietals, each different in terms of its texture, aromatic nature.&quot;Bramley gives you really high acid, zingy, crisp and fresh.&quot;If you&#x27;ve a place that&#x27;s great for growing apples like it is is here in Armagh and you&#x27;ve got very talented apple growers like you do, that gives you the opportunity to have a fantastic raw material.&quot;Then it&#x27;s down to the playfulness and the skill of the cider maker to give it this amazing range and portfolio of different types of cider.&quot;An abundance of applesOne of those producers is Greg MacNeice of MacIvors, based at Ardress.He believes the annual festival is crucial for the continued development of the area&#x27;s cider industry.&quot;I&#x27;d say there are somewhere between 4,000 and 5,000 acres of apple orchards in Armagh,&quot; he says.&quot;There is a lot of diversity there in terms of small mixed farms who have apples as part of their mix, then larger farms that have really chosen to go with only apples.Image caption, Greg MacNeice says the festival is important for apple growers and cider makers&quot;The festival is something that has been building over the years and has been gaining popularity.&quot;It is a pedestal that as a grower and cider maker we can stand upon and shout about the products that we make.&quot;So it&#x27;s really important and every year more people are coming to sample the cider and eat the food.&quot;Five miles away on the outskirts of Portadown, Kathleen McKeever of Long Meadow Cider has been preparing not just for the festival but for the upcoming harvest.&quot;The trees are absolutely laden with apples and that is because we had very little frost at the end of April and the beginning of May so we have an abundance,&quot; she says.&quot;It really is starting to look like apple picking season - we hope to be able to start early next week.Image caption, With apple picking season on the horizon, apple bins are lining orchards up and down the county&quot;If you have a lovely mixture of heat and sun and a wee bit of rain it really does make a difference.&quot;The orchard is already lined out with our apple bins.&quot;We need to get fully prepared for our pickers coming in so that when they arrive on the farm they are good to go.&quot;What they pick will then be transformed into juices, ciders and vinegars.The juices can be turned around in days but it will be up to three months before the earliest batches of fresh cider are bottled.Plenty of time to prepare for next year&#x27;s festival."
    },
    "Apple shares slide after China government iPhone ban reports": {
        "title": "Shares in Apple have fallen for a second day in a row after reports that Chinese government workers have been banned from using iPhones",
        "news": "Shares in Apple have fallen for a second day in a row after reports that Chinese government workers have been banned from using iPhones.The firm&#x27;s stock market valuation has fallen by more than 6%, or almost $200bn (Â£160bn), in the past two days.China is the technology giant&#x27;s third-largest market, accounting for 18% of its total revenue last year.It is also where most of Apple&#x27;s products are manufactured by its biggest supplier Foxconn.The Wall Street Journal (WSJ) reported on Wednesday that Beijing had ordered central government agency officials to not bring iPhones into the office or use them for work.The following day, Bloomberg News reported that the ban may also be imposed on workers at state-owned companies and government-backed agencies.The instructions not to use iPhones were given to officials by their superiors in recent weeks, sources told the WSJ. Restrictions were also placed on other foreign-branded devices.iPhones were already banned in some agencies, the paper says, but its sources suggested this had now been widened.It has not been made clear how widely those instructions were disseminated through Chinese officialdom.The reports came ahead of the launch of the iPhone 15, which is expected to take place on 12 September.On Chinese social media some people who said they work for state-owned companies reported being told to stop using Apple devices by the end of September. One joked that they were poor and did not have the money to buy a new phone: &quot;What should I use for work?&quot; they wondered. China is one of Apple&#x27;s biggest markets, and iPhones are produced in the country, though recently Apple has increased production in India.There has been no official statement from the Chinese government in response to the reports.Apple did not immediately respond to a BBC request for comment.Knock-on effectApple has the world&#x27;s highest stock market valuation, standing at close to $2.8 trillion.As well as Apple shares falling, shares in some of its suppliers were also hit.Qualcomm, the world&#x27;s biggest supplier of smartphone chips, dropped by more than 7% on Thursday, while shares in South Korea&#x27;s SK Hynix were around 4% lower on Friday.Tensions between the US and China over technology have been rising steadily, with both parties imposing restrictions.This year, Washington, along with its allies Japan and the Netherlands, restricted China&#x27;s access to some chip technology.China retaliated by restricting exports of two materials key to the semiconductor industry.Beijing is also reportedly preparing a new $40bn investment fund to boost its chip making industry. Last week, during US Commerce Secretary Gina Raimondo&#x27;s visit to Beijing, Chinese tech giant Huawei unexpectedly unveiled its Mate 60 Pro smartphone.On Friday, the company launched presales of the Pro+ model of the phone.Canada-based technology research firm, TechInsights, said the phone contained a new 5G Kirin 9000s processor, developed for Huawei by China&#x27;s largest contract chipmaker SMIC.TechInsights analyst Dan Hutcheson said it &quot;demonstrates the technical progress China&#x27;s semiconductor industry has been able to make&quot;.This is a &quot;big tech breakthrough for China,&quot; investment firm Jefferies said in a research note.This week, US congressman Mike Gallagher, who is the chairman of the House of Representatives committee on China, called on the Commerce Department to further restrict exports to Huawei and SMIC.Security updateMeanwhile, on Thursday Apple released an emergency software update for a vast number of old and current devices after a security vulnerability was discovered being used by unknown hackers. The update was released after digital rights investigators at Citizen Lab discovered attackers hacking Apple devices of specific targets using a novel and unheard of technique. Apple also found a similar so-called &quot;exploit&quot; itself so issued both updates as part of a rapid security response to customers. It is the 15th time this year that Apple has been forced to issue sweeping security updates."
    },
    "Isaac Newton apple tree saplings auctioned in UK first": {
        "title": "Ten saplings from the apple tree that inspired Sir Isaac Newton are being auctioned to raise money for the future care of his birthplace",
        "news": "Ten saplings from the apple tree that inspired Sir Isaac Newton are being auctioned to raise money for the future care of his birthplace.An apple falling at the scientist&#x27;s childhood home in Woolsthorpe Manor, Lincolnshire, in 1666 is believed to have inspired him to discover gravity.The National Trust, which runs the property, said it was the first time the saplings were being auctioned.Andy Jasper, from the trust, said he hoped the tree&#x27;s legacy would continue.&quot;This auction will allow that exact same genetic material to be preserved for a long time,&quot; he said. &quot;If a storm came along or a pest or a disease hit that tree, we would actually want to go to a different place where those other saplings are going to be kept.&quot;So the idea for this auction is for 10 people or organisations to become a custodian of this horticultural heritage, so if something ever did happen to that dear old tree we would be able to go back and take cuttings and put it back in exactly the place where Sir Isaac Newton sat.&quot;Image source, Bettmann/Getty ImagesImage caption, Sir Isaac Newton (1642-1727) carried out scientific research at his home in Woolsthorpe ManorMr Jasper, head of gardens and parklands at the trust, said he hoped the saplings would &quot;grow to still be around in 400 years&#x27; time&quot;.Blue Diamond Garden Centres, which is running the online public auction, said it was a &quot;once in a 350-year opportunity to secure the legacy Sir Isaac Newton created, for future generations&quot;. Managing Director Alan Roper said half of the money raised through the auction would be donated to help the trust with the upkeep of the manor.Mr Jasper said the funds would be spent on new fencing around the tree at the manor, as well as conservation of the grounds and property.The auction, which runs until 29 September, opened on Monday morning and had received more than 800 inquiries from interested bidders before it began, Mr Jasper said. He said the saplings would be presented to the new buyers at an event on 21 October.Image source, National Trust/James DobsonImage caption, Conservationists hope the tree will be preserved for future generationsThe falling apple in the garden of Woolsthorpe Manor prompted Newton to consider the theory of gravity.Mr Jasper said his &quot;mathematical plotting&quot; of apples falling from the tree at his home meant &quot;we knew exactly which tree he was sitting under&quot;.&quot;That tree has been very special for the nation for a long time,&quot; he said.Newton, who is buried in Westminster Abbey, is credited with laying the foundations for our scientific age, with his laws of motion and theory of gravity underpinning much of modern physics and engineering.Follow BBC East Yorkshire and Lincolnshire on Facebook, Twitter, and Instagram. Send your story ideas to yorkslincs.news@bbc.co.uk."
    },
    "New iPhone, new charger: Apple bends to EU rules": {
        "title": "Apple&#x27;s latest iPhone will almost certainly feature a USB-C charge point when it is unveiled on 12 September",
        "news": "Apple&#x27;s latest iPhone will almost certainly feature a USB-C charge point when it is unveiled on 12 September.The firm&#x27;s phones currently use its proprietary Lightning adaptor, unlike rivals, including Samsung.A European Union law requires phone manufacturers to adopt a common charging connection by December 2024 to save consumers money and cut waste.Most new Apple products such as the latest iPads already use USB-C, but the firm had argued against the EU rule.When it was introduced in September 2021, an Apple representative told BBC News: &quot;Strict regulation mandating just one type of connector stifles innovation rather than encouraging it, which in turn will harm consumers in Europe and around the world.&quot; Lightning to USB-C adaptors are already available from other electronics brands including Amazon, and all iPhones since the iPhone 8 which launched in 2017 have supported wireless charging. As the current iPhone 14 now looks to be the last Apple device to exclusively use it, this could mark the beginning of the end of the Lightning cable - which retails on the Apple store for Â£19.It&#x27;s unclear whether this will be a global change to the product, although the tech giant is less likely to make a different version of the handset for the European market alone.The changes are anticipated in the new iPhone 15 and iPhone 15 Pro devices which are set to be unveiled next week at the firm&#x27;s annual autumn event.According to a report by Bloomberg news, benefits of the switch for users will include customers being able to use a single charger for iPads, Macs and iPhones, as well as faster download speeds.The EU common-charger rule covers a range of &quot;small and medium-sized portable electronics&quot;, according to the EU, including:mobile phonestabletse-readersmice and keyboardsGPS (global positioning system) devicesheadphones, headsets and earphonesdigital camerashandheld videogame consolesportable speakers.Any of these charged using a wired cable will have to have a USB Type-C port, regardless of who makes the devices.Laptops will also have to abide by the rules but manufacturers have longer to make the changes.According to the EU, it will save consumers &quot;up to â\u0082¬250m [Â£213m] a year on unnecessary charger purchases&quot; and cut 11,000 tonnes of waste per year."
    }
}