{
    "articles": [
        {
            "title": "Historic Chorten structure found in Tilaurakot",
            "url": "/news/historic-chorten-structure-found-in-tilaurakot",
            "description": "KAPILVASTU, March 4: Archaeologists discovered a Chorten (a Budhhist monument) structure as historical evidence in Tilaurakot of Kapilvastu. A month ago, the historical and archaeological structure was found during the excavations......."
        },
        {
            "title": "PM Dahal attends grand opening of Visit Bharatpur this afternoon",
            "url": "/news/pm-dahal-to-attend-grand-opening-of-visit-bharatpur-this-afternoon",
            "description": "CHITWAN, March 1: Prime Minister Pushpa Kamal Dahal marked the beginning of the Visit Bharatpur-2024 this afternoon on the bank of the Narayani River."
        },
        {
            "title": "Pokhara to be declared Nepal’s tourism capital",
            "url": "/news/pokhara-to-be-declared-nepal-s-tourism-capital",
            "description": "KASKI, March 15: Pokhara is to be declared as the tourism capital of the country. Pokhara will be declared the tourism capital on March 17 in the presence of Prime Minister Pushpa Kamal Dahal."
        },
        {
            "title": "KMC issues 3-day ultimatum to remove unauthorized boards on Ring Road",
            "url": "/news/kmc-issues-3-day-ultimatum-to-remove-unauthorized-board-on-ring-road",
            "description": "KATHMANDU, March 15: Kathmandu Metropolitan City (KMC) has issued a three-day ultimatum for the removal of a hoarding board placed without approval by the Kathmandu Ring Road Improvement Project in the Thamel area along Ring......."
        },
        {
            "title": "NC demands Home Minister Lamichhane’s resignation",
            "url": "/news/nc-demands-home-minister-lamichhane-s-resignation",
            "description": "KATHMANDU, March 15: The Nepali Congress (NC) has demanded the resignation of Deputy Prime Minister and Home Minister Rabi Lamichhane."
        },
        {
            "title": "Nepali football team to play friendly match with Malaysia today",
            "url": "/news/nepali-football-team-to-play-friendly-match-with-malaysia-today",
            "description": "KATHMANDU, March 15: Nepali national men's football team is playing a friendly match with Malaysia today."
        },
        {
            "title": "Transport entrepreneurs introduce one-door system for night buses traveling from Jhapa to Kathmandu",
            "url": "/news/transport-entrepreneurs-introduce-one-door-system-for-night-buses-traveling-from-jhapa-to-kathmandu",
            "description": "KATHMANDU, March 15: The operators of night buses transporting passengers from various places in Jhapa, including Kakarbhitta, the major transport hub in eastern Nepal, to Kathmandu, have started a one-door system by keeping......."
        },
        {
            "title": "National Identification Number to be provided at time of birth registration",
            "url": "/news/national-identification-number-to-be-provided-at-time-of-birth-registration",
            "description": "KATHMANDU, March 15: The National Identification Number (NIN) will be provided at the time of birth registration from now onward. The Department of National ID and Civil Registration (DoNIDCR) has issued a circular to the......."
        },
        {
            "title": "Why is CIB chief Bajcharya being removed?",
            "url": "/news/why-is-cib-chief-bajcharya-being-removed",
            "description": "KATHMANDU, March 15: The team investigating the Suryadarshan Cooperative scam is about to be removed from the Central Investigation Bureau (CIB) of Nepal Police."
        },
        {
            "title": "Internal translocation of rhinos taking place in Chitwan",
            "url": "/news/internal-translocation-of-rhinos-taking-place-in-chitwan",
            "description": "CHITWAN, March 15: Six rhinos are being internally relocated in the Chitwan National Park (CNP) from today. The officials are working for the translocation of the rhinos with the increased number of endangered animals in......."
        },
        {
            "title": "‘Pressure cooker bomb’ exploded at Nepal Telecom tower in Sindhuli’s Dumja Danda",
            "url": "/news/pressure-cooker-bomb-exploded-at-nepal-telecom-tower-in-sindhuli-s-dumja-danda",
            "description": "KATHMANDU, March 15: A ‘pressure cooker bomb’ exploded on the tower premises of Nepal Telecom (NTC) located in Sunkoshi Rural Municipality-1 Dumja Danda of Sindhuli. An improvised cooker bomb exploded in the tower complex......."
        },
        {
            "title": "Govt and microfinance victims continue their talks for second day",
            "url": "/news/govt-and-microfinance-victims-continue-their-talks-for-second-day",
            "description": "KATHMANDU, March 15: The government and the protesting victims of microfinance finance institutions struggle committee are continuing their talks for the second consecutive day on Friday."
        },
        {
            "title": "Snowfall expected in various provinces over next three days",
            "url": "/news/snowfall-expected-in-various-provinces-over-next-three-days",
            "description": "KATHMANDU, March 15: Light snowfall is expected in various provinces over the next three days. The Meteorological Forecasting Division (MFD) has reported that Nepal is currently experiencing the influence of a westerly low-pressure......."
        },
        {
            "title": "Budget deficit surges to Rs 137.75 billion in first eight months of current FY",
            "url": "/news/budget-deficit-surges-to-rs-137-75-billion-in-first-eight-months-of-current-fy",
            "description": "KATHMANDU, March 15: Nepal faced a budget deficit of Rs 137.75 billion in the first eight months of the current fiscal year due to a surge in financial liability on debt service of the government."
        },
        {
            "title": "Nepal records HDI of 0.601, an improvement of 0.010 points in past two years",
            "url": "/news/nepal-records-hdi-of-0-601-an-improvement-of-0-010-points-in-past-two-years",
            "description": "KATHMANDU, March 15: Nepal’s Human Development Index (HDI) stood at 0.601 in 2023, an addition of 0.010 points to its HDI in 2021."
        },
        {
            "title": "Real estate sector remained stable during month of Falgun",
            "url": "/news/real-estate-sector-remained-stable-during-month-of-falgun",
            "description": "KATHMANDU, March 14: The real estate market has been stable during the Nepali month of Falgun (mid-February to mid-March). The number of transactions observed during Falgun was similar to that recorded in Magh (mid-January......."
        },
        {
            "title": "Nepal’s Southern Border Has Become An Open Regional Crossroads",
            "url": "/news/nepal-s-southern-border-has-become-an-open-regional-crossroads",
            "description": "In a post on ‘X’,  Home Minister of India Amit Shah said, ‘It (Government) has decided to construct a fence along the entire 1,643-kilometer Indo-Myanmar border. To facilitate better surveillance, a patrol track along the......."
        },
        {
            "title": "MoFA confirms death of seven more Nepali nationals in Russian Army amidst ongoing Russia-Ukraine conflict",
            "url": "/news/death-toll-hits-19-as-mofa-confirms-death-of-seven-more-nepali-nationals-in-russian-army-amidst-ongoing-russia-ukraine-conflict",
            "description": "KATHMANDU, March 15: The Ministry of Foreign Affairs (MoFA) officially confirmed on Thursday the deaths of seven additional Nepali nationals who were fighting alongside the Russian army in Ukraine."
        },
        {
            "title": "Step up Diplomatic Efforts to Bring Back Nepalis in Russian Army",
            "url": "/news/step-up-diplomatic-efforts-to-bring-back-nepalis-in-russian-army",
            "description": "In a sobering revelation, the Ministry of Foreign Affairs (MoFA) officially confirmed on Thursday the deaths of seven additional Nepali nationals who were fighting alongside the Russian army in Ukraine. This announcement......."
        },
        {
            "title": "Child serving time for mother&#039;s mistake in overcrowded Kalikot Jail",
            "url": "/news/child-serving-time-for-mother-s-mistake-in-overcrowded-kalikot-jail",
            "description": "KALIKOT, March 14: According to the law, only those who do something wrong should be punished. But in Kalikot district jail, young Gokarna Shahi has been serving time for his mother's mistake for four years."
        },
        {
            "title": "Petition filed at SC for legal recognition of live-in relationship in Nepal",
            "url": "/news/writ-petition-was-filed-in-sc-for-legal-recognition-of-living-together-in-nepal",
            "description": "KATHMANDU, March 14: A writ petition has been filed at the Supreme Court (SC) demanding legal recognition of the live-in relationship."
        },
        {
            "title": "NEPSE nosedives 27.84 points; daily turnover declines to Rs 3.94 billion",
            "url": "/news/nepse-nosedives-27-84-points-daily-turnover-declines-to-rs-3-94-billion",
            "description": "KATHMANDU, March 14: Nepal Stock Exchange (NEPSE) on Thursday plunged 27.84 points to close at 2,080.87 points."
        },
        {
            "title": "DPM Yadav calls for global cooperation to mitigate climate change impacts",
            "url": "/news/dpm-yadav-calls-for-global-cooperation-to-mitigate-climate-change-impacts",
            "description": "KATHMANDU, March 14: Deputy Prime Minister and Minister for Health and Population, Upendra Yadav, has said Nepal's health sector has been significantly affected by the consequences of climate change."
        },
        {
            "title": "Bhairahawa records 34.5 degrees Celsius",
            "url": "/news/bhairahawa-records-34-5-degrees-celsius",
            "description": "KATHMANDU, March 14: The temperature has gradually started rising in various districts of the country as the winter season ends, particularly in the Terai region of Nepal."
        },
        {
            "title": "MoFA confirms deaths of seven more Nepali nationals fighting alongside Russian Army in Ukraine",
            "url": "/news/mofa-confirms-deaths-of-seven-more-nepali-nationals-fighting-alongside-russian-army-in-ukraine",
            "description": "KATHMANDU, March 14: The Ministry of Foreign Affairs (MoFA) officially confirmed on Thursday the deaths of seven additional Nepali nationals who were fighting alongside the Russian army in Ukraine."
        },
        {
            "title": "Viber listed as social network in Nepal, Snapchat in the process",
            "url": "/news/viber-listed-as-social-network-in-nepal-snapchat-in-the-process",
            "description": "KATHMANDU, March 14:  Social networking app Viber is now listed in Nepal."
        },
        {
            "title": "HoR approves proposal for considering bill",
            "url": "/news/hor-approves-proposal-for-considering-bill",
            "description": "KATHMANDU, March 14: The House of Representatives (HoR) has approved the proposal seeking consideration of the Construction Materials (Management and Regulation) Bill, 2024."
        },
        {
            "title": "HoR session: NC seeks PM&#039;s reply over Lamichhane&#039;s appointment as home minister",
            "url": "/news/hor-session-nc-seeks-pm-s-reply-over-lamichhane-s-appointment-as-home-minister",
            "description": "KATHMANDU, March 14:  The main opposition Nepali Congress (NC) has sought a reply from the government regarding the appointment of Rastriya Swatantra Party (RSP) Chairman and lawmaker Rabi Lamichhane as the Deputy Prime Minister......."
        },
        {
            "title": "RPP Nepal cadres clash with police in Kathmandu",
            "url": "/news/rpp-nepal-cadres-clash-with-police-in-kathmandu",
            "description": "KATHMANDU, March 14: The police have charged batons on the participants of the massive ‘pressure demonstration’ organized by Rastriya Prajatantra Party Nepal."
        },
        {
            "title": "High-level probe commission submits report on gold smuggling to home minister after 5 months of investigation",
            "url": "/news/high-level-probe-commission-submits-report-on-gold-smuggling-to-home-minister-after-5-months-of-investigation",
            "description": "KATHMANDU, March 14: The high-level probe commission formed by the government last October to investigate the 61 kg gold smuggling case submitted its report prepared after five months of investigation to Home Minister Rabi......."
        }
    ],
    "current_page": 4
}