[
    {
        "title": "Excellent experience",
        "body": "We took the culinary food tour guided by Povan.<br />What a great experience!<br />Great local food, but above all great background stories related to the Malay people with their unique backgrounds.<br />Well recommended <br />Thank you Povan.",
        "date": "Written August 2, 2023"
    },
    {
        "title": "Really good food tour & more!!",
        "body": "What a fantastic food (& more!) experience with Siddoz! He took us around the ‘old centre’ tasting many different local specialities… we were full at the end of the tour & totally satisfied !! Not only did we taste & eat, Siddoz also gave us a guided tour of the area (unexpected) answering any questions we had regarding KL in a professional and lovely, relaxed manner. Big man Siddoz :) is a qualified guide so you can’t go wrong here! Highly recommended if you have a free 2-3 hrs in KL and like food! ",
        "date": "Written July 31, 2023"
    },
    {
        "title": "Exceptional Foof Tour!",
        "body": "Hands down the best food tour that we have ever been on! We read many great reviews about our guide, Siddoz, here on Trip Advisor. We wanted to also rave about our experience. Siddoz curated an excellent selection of tastings. Each dish was wonderful and got us excited about the next stop. Siddoz's extensive knowledge of the melting pot of cultures and cuisines found in Kuala Lumpur was icing on the cake.",
        "date": "Written July 28, 2023"
    },
    {
        "title": "Fantastic selection of traditional foods",
        "body": "Great variety of food, top tour, fantastic way to see the traditional foods of Malaysia. Recommended foodie tour for any age, thanks to our knowledgeable guide 😊.",
        "date": "Written July 24, 2023"
    },
    {
        "title": "Great Tour",
        "body": "Our tour guide was really friendly and learned a-lot.  Will go again when going back here in Malaysia with my family or friends.",
        "date": "Written July 19, 2023"
    },
    {
        "title": "Great experience!",
        "body": "Farris was great, and took us all around the market. Super knowledgeable about the food, would highly recommend.",
        "date": "Written July 17, 2023"
    },
    {
        "title": "Great food tour",
        "body": "Informative guide, excellent chance to visit and try local cuisine, much of which we wouldn’t ordinarily try. Would definitely recommend",
        "date": "Written July 16, 2023"
    },
    {
        "title": "Real local flavor of food & culture!",
        "body": "Highly recommended tour especially if Siddoz is guiding.<br />This isnt about food tasting only, which was amazing btw! Its about the ample time given to explain the culture, stories of important streets, the real flavor of ‘local culture’<br />Siddoz is highly intellectual person which really added a special flavour to whatever dishes we tried. <br />My family was so thankful! Siddoz you are the best!",
        "date": "Written July 7, 2023"
    },
    {
        "title": "Nice but Overpriced",
        "body": "It is a nice 2 hours (not 3 hours) walk in China town. Although we paid for 2 people, we were given one portion to share in each place and we had to even cut small deserts by two to try it (I think it was a good saving on us). We went to Indian place, then tried noodles in the market, then tried bacon, 2 fruits and soya desert. On the way, we were also offered an ice cream (was supposed to be shared again with my 15 yo son, but I asked to have two separate). Overall, I think the trip is interesting but overpriced for what it offers, I had to eat when I was back home.",
        "date": "Written July 6, 2023"
    },
    {
        "title": "Great tour!",
        "body": "We had a great time at the Foodtour. Very social, reliable and knowledgeable guide. Both children and adults were very satisfied. We highly recommend the trip.",
        "date": "Written July 1, 2023"
    },
    {
        "title": "Great experience",
        "body": "We are a family of 4 visiting KL for 3 nights and took the multicultural food tour with May on our first full day.\\nMay was so lovely and provided us an amazing amount of food that we would never have tried without her. She was also excellent at explaining the cultural importance of the food. She included a visit to a Hindu temple and a Chinese temple as well as some time in the Central Market and tips on where else to visit making it an all round excellent introduction to KL.\\nMay had obviously built up a great rapport with the local food vendors too.\\nI would definitely recommend spending time with May on one of her tours.",
        "date": "Written June 28, 2023"
    },
    {
        "title": "Our replacement guide, Faris, gets a 10!",
        "body": "Siddoz was not feeling well and called on his friend to do our tour instead. Faris was fantastic, leading us to different food stalls and explaining all the ingredients and processes in detail. We especially liked the clay pot chicken and rice dish, the finale. It turned into a great evening!",
        "date": "Written June 24, 2023"
    },
    {
        "title": "Great food tour!",
        "body": "Great food tour of a wide variety of local foods. The local knowledge that came with it was incredible",
        "date": "Written June 5, 2023"
    },
    {
        "title": "Highly recommend for first time visitors to KL",
        "body": "We had such an amazing tour with Siddoz. He not only showed us all the secret food spots around KL, but gave us a lot of insight into the diverse cultures too. We tried so many of the different local street food. Siddoz made us feel very welcome, and we would absolutely recommend this tour for anyone coming to KL. Word of advice: do not eat for a few hours beforehand so you have an empty stomach, or you’ll regret not being able to experience it all ! :)",
        "date": "Written May 30, 2023"
    },
    {
        "title": "One of the best tours I’ve ever done",
        "body": "The tour was fantastic, you’ll try local foods that you would not have found on your own. You’ll also tour special places like a temple and street art laneway. TK was very knowledgeable and hospitable, he even offered to drive me to the Petronas Twin towers once the tour was finished because they were next on my list to see. One of the best tours I’ve ever done.",
        "date": "Written April 25, 2023"
    },
    {
        "title": "Tasty food and good information",
        "body": "Nice and relaxt tour with entertaining information from our guide. We had tasty snacks and good food.",
        "date": "Written April 19, 2023"
    },
    {
        "title": "Hot Eats, Cool Streets",
        "body": "TK took us on a leisurely walk through Chinatown with stops at a variety of food options in and around Petaling Street. Most of the food was delicious but it was a very hot day so be prepared to sweat and eat!",
        "date": "Written April 17, 2023"
    },
    {
        "title": "Fun, informative, and delicious!",
        "body": "We did a tour with Povan and it was a highlight of our time in Kuala Lumpur. He was very patient and understanding when an afternoon thunderstorm made us late for our start time, and we still managed to get all of our samples without feeling rushed. He was a wealth of knowledge and we learned so much from him! He was also great about navigating the food preferences in our group. The food was fantastic and it was fun to eat so many varieties of food that we were eager to try.",
        "date": "Written April 3, 2023"
    },
    {
        "title": "Wonderful food tour with Ruth!",
        "body": "Our family including 2 teens had a wonderful time with Ruth visiting several restaurants over the course of 3 hours last week. <br /><br />We had a few food allergies and restrictions and Ruth was able to work out a plan / alternates for each of us!<br /><br />Even during Ramadan, when many food places are closed during daylight hours, there were many places still open and easy to get to. <br /><br />Ruth met us at the Central Market where we started with satay and drinks, and then we left Central Market and went to several different kinds of places such as fixed restaurants as well as food stands. We tried Chinese, Indian, and Malaysian foods including fruits. Overall it was a wonderful experience and Ruth was a great host. She is a great cook on her own and shared recipes with us as well.",
        "date": "Written April 2, 2023"
    },
    {
        "title": "Delicious Secret Street food in KL",
        "body": "Out food tour with TK was without a doubt the best tour we’ve ever done! TK took us to street food stalls we would have never found without him. He took care to understand what we liked and wanted and what we had already tried in Malaysia to make sure we tried something new. A lot of the stalls we ate at were 3rd or 4th generation owners and specialised in only one dish. Many owners didn’t speak strong English so we couldn’t have ordered without TK. He also showed us a Taoist temple and a few trendy hangouts. We have family travelling to KL next month and have already reccomended TKs tour to them - you should try it too!",
        "date": "Written March 24, 2023"
    },
    {
        "title": "Don’t miss walking and food tasting with Ruth",
        "body": "What a wonderful few hours, Ruth really went above and beyond. My wife and I lost count of the number of individual dishes we sampled somewhere between 12-18 and everyone a local experience.<br /><br />Ruth has a great grasp on local history and some great stories behind the dishes we sampled. She even managed to add in some requests that we had.<br /><br />We’ll be following some of her cooking advice!!!<br /><br />Thank you Ruth",
        "date": "Written March 15, 2023"
    },
    {
        "title": "Worth a few hours",
        "body": "The lady was informative and knowledgeable of KL. We visited locations that we would not have visited without her. The food was plentiful and very good quality",
        "date": "Written March 15, 2023"
    },
    {
        "title": "Excellent in every way",
        "body": "Povan, our guide, was exceptional. Great pace, quality and variety of food. He tailored the tour for us to make sure we got to taste Assam Laksa, which we were particularly interested in. Good mix of street food, fresh fruit, restaurant dishes, cultures and origins. Povan is a KL local and enthusiastic to share his love of the city. Perfect amount of time. Highly recommended",
        "date": "Written March 12, 2023"
    },
    {
        "title": "Fantastic Guide and Tasty Food!",
        "body": "We had one day to explore KL and thought a walking food tour would be a great way to experience some of the culture. Siddoz was a wonderful guide - extremely friendly, informative and altered the tour for us so we could grab a few personal items and head back earlier to the airport. All of the food was delicious! And tailored to our dietary requirements. We also learnt a fair bit about the history of KL and the Indian, Chinese & Malay cultures. Highly recommend the tour in general and especially with Siddoz!",
        "date": "Written March 8, 2023"
    },
    {
        "title": "Fantastic",
        "body": "Fantastic 3 hours of not just eating (lots!!) but learning more about Malaysian culture and history. Thanks so much Ruth!",
        "date": "Written February 17, 2023"
    },
    {
        "title": "Wonderful experience, definitely worth it",
        "body": "We took the multicultural food tour with May and it was absolutely wonderful! She picked great food and gave us so many tidbits of interesting information about the history and culture, and even gave us many tips on activities to do later on in our stay, both food-related and otherwise. The food was wonderful and I loved that we were able to try places we never would have known about or gone to on our own. There was so much great food that we couldn’t even eat it all and ended up taking some back with us. Even more though, May is genuinely kind, friendly and enthusiastic about her tour and went out of her way to get to know us and tailor our experience to what we wanted and liked. I highly recommend that anyone who wants a knowledgeable, friendly, engaging tour of authentic KL foods should book May and plan to have a great, delicious time!",
        "date": "Written February 4, 2023"
    },
    {
        "title": "Disappointed ",
        "body": "This tour is definitely weather dependent. Unfortunately I experienced a significant downpour during my tour which limited the walking required. The guide suggested abandoning the tour after an hour, but did not suggest a partial refund. I was not impressed. My estimate is that I enjoyed food priced at about 15 percent of the fee paid. That's a hefty profit margin.",
        "date": "Written January 23, 2023"
    },
    {
        "title": "Great food and cultural local experience ",
        "body": "Our guide was great she showed us around not only with a great selection of local food but also culture and insidere Tips.",
        "date": "Written January 19, 2023"
    },
    {
        "title": "Amazing experience with Chef Faris",
        "body": "Chef Faris did a fantastic job as a guide. He was super helpful helping me and my mom find the best shopping bargains and haggling for us even though it was a good tour lol. Amazing man!",
        "date": "Written January 17, 2023"
    },
    {
        "title": "TK, (our guide) was 5 stars, tour was 3",
        "body": "TK was a great guide and we had a good variety of food.  BUT,  Mondays are a bad day because many places are closed.  Also alot of other places close at 4pm so a 5pm tour is not recommended.   We would recommend this tour, but earlier in the day and not on Mondays.",
        "date": "Written January 3, 2023"
    },
    {
        "title": "Great Guide, Great Food - Don't Miss It",
        "body": "Siddoz was a fantastic guide! We had a 12 hour layover in Malaysia on our way back to Australia, so to fill the spare time we booked this 3 hour tour of KL's street food. It was a highly enjoyable experience that made this tour one of the highlights of an otherwise wonderful 2-week trip to India! The variety of foods was very impressive, showcasing Malaysia's unique blend of cultural influences, with a good mix of cuisines. Our favourites were the Laksa curry bowl, the pancake-type desserts and the cham. Siddoz was helpful, efficient, interesting and clearly knew his stuff. Would recommend!",
        "date": "Written December 28, 2022"
    },
    {
        "title": "A taste of Malaysia",
        "body": "Zack was friendly and full of interesting tit-bits of information. We had a great time! My favourite was the laksa and the pancakes. So good!",
        "date": "Written December 6, 2022"
    },
    {
        "title": "Great tour and food",
        "body": "Siddoz was a great guide and took us to some pretty cool local places. One of us is vegan and the other is not, but Siddoz managed to tailor a tour that suited us both. Thank you.",
        "date": "Written December 4, 2022"
    },
    {
        "title": "Fantastic Guide, Amazing Food, Bonus History",
        "body": "We had Siddoz as our guide and he was a fantastic guide, host, and source of information. He took us to exactly the kind of places we were hoping to try but would have never found on our own. The food choices here are overwhelming, it was so nice to have someone help us narrow things down and sort out our tastes. As a bonus he showed us some gorgeous temples, and provided historical, religious, and cultural context for the places we visited and the foods we ate. We left satisfied and full and with a new friend.",
        "date": "Written September 23, 2022"
    },
    {
        "title": "Food tour across Chinatown area.",
        "body": "Povan, the guide, was great. He gave us a glimpse of Chinatown's hidden places, local foods, traditions, history. The tasting was great, chinese, malay and indian dishes, though the stations were more 6 or 7, not 10; total dishes were more than that. Do it, don't miss the opportunity.",
        "date": "Written August 4, 2022"
    },
    {
        "title": "Learned so much in such a short time.",
        "body": "Very high-quality, private tour. Siddoz was extremely skilled at tailoring the tour and information provided to what we were interested in learning and eating. Highly recommend.",
        "date": "Written July 29, 2022"
    },
    {
        "title": "Eat your way through KL! You won’t regret it!",
        "body": "Anyone with teenage boys will tell you - they sure can eat! Our teens are absolute foodies and were thrilled with this tour, as were we. Povan was so accommodating- I messed up our tour timing and he was able to squeeze us in later in the day, plus he made sure to ask about food restrictions and allergies in advance. Povan was fun, informative and knew exactly what we would enjoy. Food was amazing!  Our favorite was the Kung Fu Cha and also the Roti-Prata. A must do for any foodie.",
        "date": "Written July 3, 2022"
    },
    {
        "title": "Fab private tour - can't wait to do it again...",
        "body": "Myself and my partner have high standards and expectations and this private local food tour did not disappoint and is a genuinely unforgettable experience. It introduced us to a range of ‘eateries’ some of which were ‘tucked-away’ historic small restaurants and hawker stalls as well taking-in culturally diverse temples and other fascinating sights. <br /><br />We had an amazing and charming personal guide called ‘TK’ who, during the tour, steered us through over 10 dishes which included Indian, Chinese, and Malay as well as frequently introducing us to the fascinating vendors – some of whom are very senior in age and sadly when some of them finally retire their business will end with them. <br /><br />This private tour (which was longer and more generous than the advertised 4 hours) took place at a time of our choosing and TK, who also handled the booking, was keen to understand our needs, likes and dislikes and following our original confirmation during booking of our dislike of monosodium glutamate (MSG) restructured the tour itinerary to suit us.<br /><br />We highly recommend this tour and actually want to do it again next time we visit Kuala Lumpur!<br /><br />Ten out of ten for this private tour and for ‘TK’.",
        "date": "Written May 31, 2022"
    },
    {
        "title": "Food Tour with May",
        "body": "Me and my boyfriend had a food tour with May - it was awesome! She showed us the most delicious food and told us lots of interesting things about Malaysian lifestyle. Highly recommended!",
        "date": "Written March 13, 2020"
    },
    {
        "title": "Great food tour with May, she is a great host.",
        "body": "We had a great experience with May as our guide in Kuala Lumpur. I've<br />done a few walking food tours in different places but my friends had<br />never done one before, and they really enjoyed it. I found May to be<br />one of the best guides I've ever met - she knew a great variety of<br />places to take us to eat, from hipster cafes to back street food<br />stalls (with fantastically tasty chicken rice!) and also gave us some<br />great insights into landmarks around KL. I definitely recommend May as<br />your guide in KL.",
        "date": "Written March 11, 2020"
    },
    {
        "title": "Average",
        "body": "Average food tour in average corners of the city. Quite expensive for the tour duration and food types experienced (£50 per head). We've done more varied, inspiring tours in other parts of Malaysia and Asia.",
        "date": "Written February 14, 2020"
    },
    {
        "title": "Highly recommended tour with May",
        "body": "We spend a wonderful evening tasting delicious food in vibrant and colourful locations. May did an excellent job showing us around and giving us an insight on local food and culture. For us this was a highlight of our tour and we can recommend this tour with May as a „must do“ for Kuala Lumpur!",
        "date": "Written February 11, 2020"
    },
    {
        "title": "Best decision ever",
        "body": "We  were on a food tour  with May. We ate really delicious and local food.<br />We had a great time in KL and it was really funny.<br />If you like food - try this trip!",
        "date": "Written February 1, 2020"
    },
    {
        "title": "More than a food tour",
        "body": "We had a wonderful time with May. She is so knowledgable about the<br />history and culture of all of the sites we visited. Thank you for<br />exposing us to new foods and experiences! You made our KL trip such a<br />fun adventure! We especially loved visiting the Taoist temple in<br />Chinatown where we observed people celebrating the Chinese New Year,<br />visiting the Hindu temple, viewing the street art, and trying the<br />spicy pork noodles, peanut pancakes, dosas, cham, and teh tarik!! THANK YOU<br />so much for still honoring our tour reservation despite the holiday.<br />Happy New Year!",
        "date": "Written January 27, 2020"
    },
    {
        "title": "Wonderful!",
        "body": "Spent this morning with May as she showed me around her KL. so amazing to see the city though the eyes of someone local! I was lucky enough to be herer over Chinese NY and May talked me through all the traditions as well as knowing exactly the best place to be to see a traditional lion dance! That, together with fabulous street food and lovely cafe culture made this really special, thank you May! I feel a friend had been made x",
        "date": "Written January 24, 2020"
    },
    {
        "title": "Great way to spend 3hrs in KL",
        "body": "Thank you R.  My family really enjoyed the 3hr tour. From the<br />wonderful variety of food tastings, to the interesting temple and<br />cultural history information. Appreciate you customising the tour as<br />well to fit in some specific food requests. The seven of us had a<br />great time. We only had a few hours in KL so this was the perfect<br />thing to do. Highly recommended!",
        "date": "Written January 13, 2020"
    },
    {
        "title": "May’s Food Tour",
        "body": "We had a great Food Tour this evening with May. <br /><br />She was an interesting, knowledgeable and informative guide who adapted the tour to suit us.<br /><br />We sampled a fantastic range of food at some authentic street food venues and she introduced to some fantastic foods we would never have tried on our own!<br /><br />A truly unique experience in this amazing city.<br /><br />Thank you May!",
        "date": "Written January 10, 2020"
    },
    {
        "title": "Lovely food tour",
        "body": "Lovely choices of local and historic restaurants. Ruth was a fantastic guide and we enjoyed every minute. Not sure if we will eat again as we left the tour so full of food.",
        "date": "Written January 8, 2020"
    },
    {
        "title": "Can't go wrong!",
        "body": "My wife and I came to Kuala Lumpur for two nights. Nadia is an<br />exceptional food tour guide and she made our tour very enjoyable. She<br />took us around many local restaurants and areas in central Kuala<br />Lumpur and she customized the tour to our liking and tastes. She<br />emanates positive energy and has a very genuine character. You will<br />never go wrong with Nadia!",
        "date": "Written January 8, 2020"
    },
    {
        "title": "Exceptional food tour!",
        "body": "Whether you are new to the many varieties of Malaysian food or have wider experience, this is a must-do tour! Our delightful host Nadia knew the best places to eat authentic Malay, Indian and Chinese foods where the locals eat, and the experience was well worth it. We were anticipating a street food tour and got that in abundance, but were also hosted to several full restaurant meals as part of the tour, allowing us to sample a wide array of delicious local dishes which would not have been possible if we only visited street-side hawkers. Nadia even went out of her way to help my wife to find a fondly-remembered dish from a childhood visit to Malaysia - not just one version, but two. Nadia could not have been a better host, and we heartily recommend this tour to anyone who loves Malaysian food (or would like to!) Exceptional!",
        "date": "Written December 29, 2019"
    },
    {
        "title": "Amazing Food tour",
        "body": "Nadiah our guide was great. She was very friendly and was very accommodating with our dietary needs (halal and vegetarian). Although we had already been to some of the places, with Nadiah we were able to try food that we would never have tried our selves. A highly recommended tour and a great way to get to know the local culture!",
        "date": "Written December 28, 2019"
    },
    {
        "title": "KL Food tour",
        "body": "May was an awesome host. Super knowledgeable on the history of both<br />the culture and food. Had a chance to taste several dishes throughout<br />different parts of KL. Highly recommend doing a tour with May!",
        "date": "Written December 13, 2019"
    },
    {
        "title": "Very considerate",
        "body": "R was nice and accommodating. Very patient and knowledgeable about the city and the history. The food was delicious and plentiful.",
        "date": "Written December 10, 2019"
    },
    {
        "title": "Amazing food and great conversation!",
        "body": "My husband and I always take a food tour when traveling around the world. It’s the best way to find out about a place, it’s culture, history and foods. While in Kuala Lumpur we took private half day: The Ultimate Kuala Lumpur Food Tour with our excellent tour guide Ranita. She was so knowledgeable about history, culture and multicultural foods of Malaysia. We started from China Town tasting various Chinese Cuisines. Walked towards Malay neighbourhood tasting delicious Malaysian Foods.  Then last stop was Indian food. As we were walking she showed us many interesting and historical sites of the city. On our way we visited many temples, and appreciated street art.  Food was plentiful and delicious. Ranita was very knowledgeable and fun to talk to. Ranita was a great conversationalist, we wish we could spend more time with her.  We highly recommend this tour. Thank you Ranita for all the information and an excellent food tour!!",
        "date": "Written December 7, 2019"
    },
    {
        "title": "Amazing Food Tour!",
        "body": "I loved this food tour, it was amazing to discover the city with May<br />who is really passionate and know so many stuff! Furthermore, the food<br />was amazing, with some hidden places I wouldn't have found by myself.<br />Definitely worth it! Thank you May!",
        "date": "Written December 3, 2019"
    },
    {
        "title": "Hakim is a great guide",
        "body": "I’ve always thought that the best way to learn about a place while traveling is to sit down with a local and chat over food. Hakim is a great tour guide, friendly, and very knowledgeable about all things KL. I tend to ask a lot of random rapid-fire questions and Hakim was well up to the task. Whether it be Malaysian social demographics, KL’s real estate market, or even the history of the Malaysian flag, there wasn’t anything that Hakim couldn’t speak on. The food we ate was wonderfully diverse and delicious, just make sure you bring an appetite as you’ll be eating several lunches throughout the tour! It was a pleasure to experience the culture of KL through its food with Hakim and I recommend anyone coming to the city to check him out. ",
        "date": "Written November 25, 2019"
    },
    {
        "title": "Great way to taste some of what KL has to offer",
        "body": "My wife and I took this tour on our honeymoon and we both thoroughly enjoyed it. R was a great host and incredibly knowledgable on both KL in general and the food we were tasting. Got to see a bit of KL in the process. Would highly recommend to food lovers from anywhere in the world. ",
        "date": "Written November 24, 2019"
    },
    {
        "title": "Unable to attend",
        "body": "Two of our party got very ill the day before the event and we were unable to cancel and receive a refund.<br /><br />I don't blame the tour guide, but it was frustrating.",
        "date": "Written October 20, 2019"
    },
    {
        "title": "Food tour",
        "body": "We had an excellent day with TK. He was very knowledgeable about KL and the local cuisine with spots to check out. We really enjoyed it.",
        "date": "Written October 8, 2019"
    },
    {
        "title": "Very Informative Tour",
        "body": "Food was awesome and we learned SO much. I loved all of the places Hakim took us, and although this was a food tour, he was very knowledgeable and taught us so many other things about Malaysia not food-related. Having a local show you around is an undeniably valuable experience you shouldn’t pass up! Thanks Hakim!",
        "date": "Written September 16, 2019"
    },
    {
        "title": "Best Tour Ever",
        "body": "We visited SouthEast Asia numerous times and explored many food<br />markets while traveling but never felt satisfied after leaving. It<br />seemed like most times when trying new foods in the market we didn't<br />know what we were eating or we couldn't fully communicate with the<br />stall owner because of a language barrier.   With 10 tasting tours by<br />With Locals  our experience completely changed. For started we had a<br />personalized private tour with our amazing host Hakim. Hakim broke<br />down history and culture content of the food while touring around.<br />Running around to different food stalls with a local gave us the<br />chance to explore off the road places, we wouldn't have found or even<br />tried without a recommendation. 10 Tastings left us feeling like a pro<br />for the rest of our stay in Malaysia because we knew which dishes and<br />yummy treats to pick out ourselves.",
        "date": "Written August 28, 2019"
    },
    {
        "title": "Best decision I’ve made traveling. Hakim was the best!",
        "body": "Absolutely choose to do this if you can. Not only did I try the best food, but Hakim took me all around central market, Chinatown, and the old city. During the tour, I was able to talk about Malaysian culture with him, and learned so much about the history of this amazing country. If you’re looking for flavor, sights, and great conversation, this is the way to go! Shoutout to Hakim for being the best guide, even after I came an hour late.",
        "date": "Written August 1, 2019"
    },
    {
        "title": "Great food Tour in KL",
        "body": "We had a great time in KL on the food tour. Our guide was Hakim and he introduced us to some great local foods and eating places.",
        "date": "Written July 21, 2019"
    },
    {
        "title": "Food tour",
        "body": "Our family chose May for food tour in Kuala Lumpur. May was excellent<br />guide and a genuinely warm and friendly person overall. Even though<br />the tour was food-orientated May also took us to several magnificent<br />temples, mosque and other interesting sights of the city. This great<br />combination of interesting sights of the city and the great tastes of<br />Malaysia was a lovely way to get to know some more of Kuala Lumpur and<br />its culture. Would definitely recommend to anyone who wants to taste<br />various kinds of food and also be informed on the culture. Thanks May!",
        "date": "Written July 15, 2019"
    },
    {
        "title": "The best way to experience Kuala Lumpur on foot!",
        "body": "May has crafted a fantastic tour of Kuala Lumpur through it's food scene! She took us to a few significant sites along the way (a temple, a mosque, the point of the rivers' confluence, etc.), explaining the history/lore in detail, and brought us to amazing food! From street vendors hawking their coconut pancakes and fresh soy milk, to sit down restaurants serving hot masala chai tea and dosa with delicious sauces, we ate it all! We ended up near the Petronas Towers and got to experience an outdoor festival where fasting Malays were stocking up on delicious foods for breaking their Ramadan daily fast. May gladly took tons of photos of us along the way to document the experience for us to share with our friends at home. I also appreciate that she is very eco-conscious, encouraging the vendors we met to use less plastic, and bringing along washable cups/metal straws for us to use instead of plastic. She is so knowledgeable both about food and about Kuala Lumpur and Malaysia generally. Any other kind of walking tour would be boring after this one! Thank you, May, for a delicious and exciting excursion! I can't recommend her enough! Would be fun to do this tour with friends or maybe even with kids (not being a parent, I don't know, but May is super friendly). You do walk a lot, so wear comfortable walking shoes and come hungry!",
        "date": "Written June 2, 2019"
    },
    {
        "title": "The Only Neat Thing to Do at first KL",
        "body": "I visit KL at 1st time, and I applied with this trip 1st day.<br />So it is very meaningful for us that many delicious dishes and signature spots were introduced.<br />Thank you Ranita for your knowledge, kindness and politeness.<br /><br />I recommend with all the first KL people and others.<br /><br />At last, I'm sorry for my poor English!",
        "date": "Written May 2, 2019"
    },
    {
        "title": "A fantastic and fun tour!",
        "body": "We had a great time with Hakim. He met us promptly at the meeting site<br />and was very personable. After our first stop, it began to rain and he<br />quickly made adjustments for the weather and changes of venue. We<br />enjoyed all of the foods that we tried and loved learning little<br />cultural tidbits as well. It was a great tour and we would definitely<br />recommend this to anyone visiting KL. It was about 3 hours long, might<br />have been shorter but we waited out some weather and the perfect<br />amount of walking. We were very happy with everything!",
        "date": "Written March 7, 2019"
    },
    {
        "title": "Great introduction to KL",
        "body": "Tour was much more than expected, ticked some of our other tourist must do's as well as giving us a great intro into the foodie world that is KL. May was a great guide but also was fun to be with and we very much enjoyed her company.",
        "date": "Written March 4, 2019"
    },
    {
        "title": "Fantastic Food Experience",
        "body": "Make sure you take a big appetite with you on this food tour. Nadia<br />took us to eat Malaysian, Indian and Chinese dishes in different parts<br />of the city. She knows all the best places. We even tried durian for<br />the first time. A great way to see the different cultures of this<br />fascinating city.",
        "date": "Written February 12, 2019"
    },
    {
        "title": "A really amazing day in KL :-)",
        "body": "We had an amazing experience on our first day in KL. Our guide was<br />very professional and we got to taste many dishes with a wide variety.<br />Thanks a lot! :) We love it !",
        "date": "Written January 28, 2019"
    },
    {
        "title": "Ranita is amazing",
        "body": "How great was our time spent with Ranita. She took us to places where<br />we would not roam by our selfs and with all different tastes and foods<br />thought us little about beautiful KL. And Ranita herself is a great<br />person with who we felt like we belong there. Great talk, we wished to<br />spend more time with her. Highly recommended.<br />",
        "date": "Written January 19, 2019"
    },
    {
        "title": "Great day with TK in KL",
        "body": "We had a great day with TK and got to visit lots of food stalls in KL that we would have just walked by if by ourselves. He’s a great guy with loads of local info. We visited the Chow Kit market which was amazing, bought some local food to try and then off to Chinatown. By the end we were stuffed but TK said we did ok! 👍 I took loads of photos so we have that as a great memory. You will have a great day as we did. Thanks again TK Tom Gillian and Jack Kinnier from Northern Ireland",
        "date": "Written January 12, 2019"
    },
    {
        "title": "Best tour",
        "body": "TK is really friendly and helpful. He even helped us after the tour<br />had ended. We learned a whole lot about the food here in Malaysia<br />while eating some great local dishes. TK is really good with kids and<br />we had an overall interesting and amazing experience. I recommend TK<br />if you want to have a good time and learn about the food culture in<br />Malaysia",
        "date": "Written January 4, 2019"
    },
    {
        "title": "Amazing tour",
        "body": "Best food tour! Not only did we sample street food all around KL<br />Chinatown but we crashed a wedding at a local Indian temple, a<br />wonderful experience (apparently it's an acceptable practice). We<br />never would have been brave enough to order some of the foods we ate<br />without TK's encouragement. His enthusiasm was contagious. TK went<br />above and beyond his duties as a food tour guide. We needed to replace<br />a piece of luggage that had been ruined during our flight and TK drove<br />us to a local shopping center to find a replacement. I highly<br />recommend TK as your next food tour guide in KL.",
        "date": "Written December 20, 2018"
    },
    {
        "title": "Best experience in KL !!!!",
        "body": "Our tour guide TK made our trip to KL special! We learned so much more about the local cuisante than even our friends who have lived there for months! TK is one of those hosts who just keep you smiling and is great company! Not one thing we tried we didn’t like and whenever we come back to KL we will message him again and try to learn even more! ",
        "date": "Written December 6, 2018"
    },
    {
        "title": "Excellent evening food tour with Aida",
        "body": "Met Aida at agreed time, and proceeded to have a wonderful fun evening<br />experiencing many local food types and venues. By agreement, and to<br />maximise opportunities, we jumped the metro a couple of times which<br />meant we could get to a wider variety of venue. Aida was a great host,<br />really knowledgable about foods and lovely company. Also highlighted<br />some other food venues and bars for us to try during our visit. Would<br />highly recommend this tour.",
        "date": "Written November 28, 2018"
    },
    {
        "title": "One of the best food tours we have taken",
        "body": "we take a food tour at every destination — Paris, Nice, Rome, Florence, Venice, Madrid, Barcelona, Bangkok, Seoul, Singapore, etc.  the tour we took with May was one of the best we have taken. May took my wife and I on a culinary adventure through Chinatown, Indian food and finally Malaysian food. Every stop was well researched and vetted by May. Many of the restaurants were family owned and open for generations. We would never have found these places on our own and made the tour well worth it. May is friendly, a passionate foodie and<br />knowledgeable. Take this tour with May! You'll thoroughly enjoy<br />yourself as much as we did",
        "date": "Written October 26, 2018"
    },
    {
        "title": "Foodtour with TK",
        "body": "TK is a fantastic, super friendly host. He showed us great food<br />options and we tried plenty of food. I can highly recommend TK is you<br />like to have a fun time with superb food.",
        "date": "Written October 24, 2018"
    },
    {
        "title": "Amazing food and conversation",
        "body": "What a great way to spend a day! Ranita and her mom took me around to<br />some wonderful places with some of the best local food I'd never find<br />on my own! If you are lucky enough to find yourself in KL, I highly<br />recommend contacting Ranita. But you better be hungry!",
        "date": "Written October 10, 2018"
    },
    {
        "title": "Family Food Tour with May",
        "body": "We did an amazing food tour through Kuala Lumpur with May. We have<br />seen a lot of nice places, nice people and of course we tried a lot of<br />amazing food and drinks. The kids loved kidding with May and they<br />never found it boring running through Chinatown, Little India or the<br />Malay district because evreywhere there was something new to discover.<br />You will get an authentic and honest experience with May and we loved<br />the metal straws! We already have our own and in this way even a touch<br />of sustainability is integrated in May's tour. If you want to have<br />fun, good food and discover parts of KL you will never get to than<br />chose this tour! Thank you May ;-)",
        "date": "Written September 7, 2018"
    }
]