[
    {
        "title": "Has changed little over the years",
        "body": "As the title suggests, not a great deal has changed over the years in Chinatown. I did notice on my recent visit that there is now a roof covering much of the area. I cannot remember seeing this on my last visit. Although that was quite a few years ago.Probably because on The Internet I did not spot a single vendor selling D.V.Ds. However, there are still more than enough stalls selling cheap watches to please even the most fastidious visitor. There appear to be more stalls selling pirated clothing and accessories now than before, but then again it could very well be because of my not being here for a while. As before though, this place is heaving, and it is difficult to wander among some of the stalls because of so many visitors.One thing that has always tickled us is the chap selling roast chestnuts right in the middle of Chinatown. Roasted chestnuts are not something normally associated with a tropical country like Malaysia.",
        "date": "Sep 2023 • Solo"
    },
    {
        "title": "Fake paradise",
        "body": "Very difficult to find rest rooms.. everything is perfectly fake. Very crowded. Bargaining is a must.",
        "date": "Oct 2023 • Family"
    },
    {
        "title": "Not so great anymore",
        "body": "Be ready to be disappointed. No more chinese rather cox bazaar with all Bangladeshi crowd and sellers. No more the great place it used to be with Chinese shops and banter.",
        "date": "Nov 2023 • Family"
    },
    {
        "title": "Commercial street",
        "body": "KL's Chinatown is more than just a commercial street, but almost all the activities are focused there. You'll find stores, restaurants, people walking up and down… it's very alive",
        "date": "Aug 2023 • Couples"
    },
    {
        "title": "Average market but some good food",
        "body": "Market stalls highly repetitive, clothes, bags, lots of fake branded goods, sellers are not too pushy which is good. There are some good cheap places to eat around though.",
        "date": "Oct 2023 • Couples"
    },
    {
        "title": "MUST SEE VISIT IN KL",
        "body": "A great place to haggle and buy cheap knock offs of label brand bags, shirts, shorts, shoes, watches and perfumes.  A great experience and went 3 times as I have a bag fetish.  Haggle with the stall workers over prices as they will highball you but you can get a great quality knock off bag for AU$30 - $40.   It's really hot and humid so either go when it opens or go at night.  Haggle with taxi drivers for the best price when taking your shopping back to your hotel.",
        "date": "Sep 2023 • Friends"
    },
    {
        "title": "Petaling Street",
        "body": "This is the second name for Petaling street. Mainly Chinese shops, hundreds of them along with food stalls, juices, souvenirs and others.",
        "date": "Sep 2023 • Friends"
    },
    {
        "title": "CHINATOWN FOR GOOD STREET FOOD AND CHEAP BUYS",
        "body": "Chinatown was a target area for our food tasting trip.We were surprised at the wide choices for low price branded garments and hand bags.The street food stalls open only in the evening near jalan heng jibat end.There is a popular soya bean stall. Nearby is the famous Kim Lian Kee Restaurant at Petaling Street. The famous KL hokien mee is their signature offering.Typical Chinatown ambience with hordes of tourists looking for Chinese food and good buys.",
        "date": "Sep 2023 • Friends"
    },
    {
        "title": "Shop shop and shop",
        "body": "Shop till you drop ! the whole lane is a treasure box of beach wear, souvenirs, sun glasses, bags, hats, clothes, suitcases and what not! This is the place you can bargain up to even half the price at some places. We bought so many souvenirs and also bought a cute cabin luggage from a Chinese shopkeeper.  This is a must place if you are interested in flea or street market. ",
        "date": "May 2023 • Family"
    },
    {
        "title": "Unmissable",
        "body": "An unmissable aspect of KL, whether you are a shopper or a culture vulture, Chinatown offers you an excellent peek into the lifestyles of the Chinese with its array of shopping & dining options. A few Chinese temples abound as well. ",
        "date": "Jun 2023 • Solo"
    },
    {
        "title": "Batu Cave Temples",
        "body": "Interesting place ....... lots of steps but the effort is worth while. The caves are often used for temples.  Watch the Monkeys.",
        "date": "Written January 17, 2020"
    },
    {
        "title": "don't miss this !",
        "body": "we almost didn't go to the caves as we were on a cruise the trip's they offered were expensive so we opted for a taxi at the gate to the port (Klang) the driver took us here then the petronas towers then to the chinese market it cost about £80 but that was for four of us and lasted about 6 hours so great value !",
        "date": "Written January 10, 2020"
    },
    {
        "title": "Comfortable way to visit the impressive Batu Caves and Hindu temple",
        "body": "A private tour with Razwan helped us see the spectacle of the caves and temple site with ease and comfort, allowing us to time our visit to suit us. We enjoyed our tour very much and it was good value and insightful.",
        "date": "Written January 9, 2020"
    },
    {
        "title": "Great Experience",
        "body": "We had a great day with a great guide showing us place we may not have otherwise seen, this trip is highly recommended.",
        "date": "Written January 7, 2020"
    },
    {
        "title": "My take on this tour",
        "body": "Nice and courteous driver with good air conditioned car.<br />Driver with limited English but not a guide. Cheap tour, but you must read about the places visited as the driver information are very limited. Our tour was less than 3 hours. Total in the car 4 people. Perhaps a larger number of tourist will provide a better guidance. The tour is very good bargain given the places visited.<br />The tour includes visits/gentle sale pitch to 3 places. We refused to go to the third. Driver offer ed to drop us off in a place we wanted: China town.",
        "date": "Written January 6, 2020"
    },
    {
        "title": "You don’t have to be fit",
        "body": "Do this on yr own not a trip as all is free,the stairs are high but do it slowly and anyone can do it,not much at top, monkeys rare funny ,toilet if you can then them that are terrible.terrible parking if any",
        "date": "Written January 6, 2020"
    },
    {
        "title": "Batu Cave Visit",
        "body": "Entrance into the cave is totally free. We took grab to and fro without any hassle. <br />One hour is enough to stay there. Just go up, take pictures and come down.",
        "date": "Written January 2, 2020"
    },
    {
        "title": "Worth a look",
        "body": "Be ready for the crowd and visit it early in the morning because it can be really hot. At entrance is literally no shadow at all. There is a lot of monkeys which are a bit aggressive for food. So just take a care. ",
        "date": "Written January 2, 2020"
    },
    {
        "title": "Culturally Rich",
        "body": "Entrance into the temple is actually free... Beware of the monkeys - although they are generally harmless.",
        "date": "Written January 2, 2020"
    },
    {
        "title": "Awesome ",
        "body": "Such a great morning we went to the Batu Caves this morning. Our driver was so knowledgeable and friendly. While waiting for another traveler we got to go inside the chocolate factory too. The pewter factory was so interesting. Thank you very very much. Fabulous morning and learnt a lot! ",
        "date": "Written January 2, 2020"
    }
]