{
    "articles": [
        {
            "title": "PM Dahal presents proposal in parliament, seeking vote of confidence",
            "description": "CPN (Maoist Centre) Chairperson and Prime Minister Pushpa Kamal Dahal 'Prachanda' has presented a proposal in the House of Representatives today as per the Rule 155 of the House of Representatives Regulations, 2079BS, seeking a vote of confidence in accordance with Article 100, Sub-Article (2) of the Constitution of Nepal.",
            "url": "https://thehimalayantimes.com/kathmandu/pm-dahal-presents-proposal-in-parliament-seeking-vote-of-confidence"
        },
        {
            "title": "Nepal's beautiful nature and rich culture attracts world: President Paudel",
            "description": "President Ram Chandra Paudel has said that Nepal has become a center of attraction in the globe for its beautiful nature and glorious culture.",
            "url": "https://thehimalayantimes.com/kathmandu/nepals-beautiful-nature-and-rich-culture-attracts-world-president-paudel"
        },
        {
            "title": "English language barrier: How it prevents use of technology",
            "description": "A few months ago, I could be seen trekking across the hilly, rugged terrain of my village in Bajhang – in an arduous one-hour journey to the ward office.",
            "url": "https://thehimalayantimes.com/opinion/english-language-barrier-how-it-prevents-use-of-technology"
        },
        {
            "title": "Japan's first private-sector rocket launch attempt ends with explosion shortly after takeoff",
            "description": "A rocket that was supposed to become Japan’s first from the private sector to put a satellite into orbit exploded shortly after takeoff Wednesday, livestreamed video showed.",
            "url": "https://thehimalayantimes.com/science-and-tech/japans-first-private-sector-rocket-launch-attempt-ends-with-explosion-shortly-after-takeoff"
        },
        {
            "title": "Dahal elected National Assembly Chair",
            "description": "Narayan Prasad Dahal, the candidate of the ruling coalition, has been elected to the post of National Assembly Chairperson.",
            "url": "https://thehimalayantimes.com/kathmandu/dahal-elected-national-assembly-chair"
        },
        {
            "title": "Transportation halted on Karnali Bridge after 14 support wires damaged partially in fire",
            "description": "Transportation on the Karnali Bridge has been halted after the damage in 14 support wires when it caught fire from a truck on Monday.",
            "url": "https://thehimalayantimes.com/kathmandu/transportation-halted-on-karnali-bridge-after-14-support-wires-damaged-partially-in-fire"
        },
        {
            "title": "9th Edition of Nepal-Pakistan Friendship T20 Cricket Tournament-2024 concludes",
            "description": "The 9th Edition of Nepal-Pakistan Friendship T20 Cricket Tournament-2024 has concluded in Kathmandu, on Sunday.",
            "url": "https://thehimalayantimes.com/sports/9th-edition-of-nepal-pakistan-friendship-t20-cricket-tournament-2024-concludes"
        },
        {
            "title": "At least 26 dead and 11 missing after flash floods and landslides on Indonesia's Sumatra island",
            "description": "Rescuers recovered more bodies as waters began to recede after flash floods and landslides caused by torrential rains on Indonesia’s Sumatra island, which have killed at least 26 people and left 11 missing, officials said Monday.",
            "url": "https://thehimalayantimes.com/world/at-least-26-dead-and-11-missing-after-flash-floods-and-landslides-on-indonesias-sumatra-island"
        },
        {
            "title": "Festivals fostering unity in diversity-Speaker Ghimire",
            "description": "Speaker of the House of Representatives, Devraj Ghimire wished may the Lhosar festivals be celebrated in a less expensive manner in a way to preserve the vanishing tradition.",
            "url": "https://thehimalayantimes.com/nepal/festivals-fostering-unity-in-diversity-speaker-ghimire"
        },
        {
            "title": "Rupert Murdoch, 92, plans to marry for 5th time",
            "description": "He plans to marry Elena Zhukova, 67, a Russian-born retired scientist he met last year.",
            "url": "https://thehimalayantimes.com/lifestyle/rupert-murdoch-92-plans-to-marry-for-5th-time"
        },
        {
            "title": "Australia needs 202 runs and New Zealand 6 wickets in expected thrilling finish to 2nd test",
            "description": "Australia’s hopes now hang heavily on Marsh and Head.",
            "url": "https://thehimalayantimes.com/sports/australia-needs-202-runs-and-new-zealand-6-wickets-in-expected-thrilling-finish-to-2nd-test"
        },
        {
            "title": "Program that allows 30,000 migrants from 4 countries into the US each month upheld by judge",
            "description": "Advocates for the federal government countered that migrants admitted through the policy helped with a US farm labor shortage.",
            "url": "https://thehimalayantimes.com/world/program-that-allows-30000-migrants-from-4-countries-into-the-us-each-month-upheld-by-judge"
        },
        {
            "title": "Mass kidnappings of Nigerian students leave parents in shock and despair",
            "description": "Rashidat Hamza is in despair. All but one of her six children are among the nearly 300 students abducted from their school in Nigeria’s conflict-battered northwest.",
            "url": "https://thehimalayantimes.com/world/mass-kidnappings-of-nigerian-students-leave-parents-in-shock-and-despair"
        },
        {
            "title": "What is Ramadan and how do Muslims observe the Islamic holy month?",
            "description": "Ramadan is the ninth month of the Islamic lunar calendar; the month cycles through the seasons.",
            "url": "https://thehimalayantimes.com/lifestyle/what-is-ramadan-and-how-do-muslims-observe-the-islamic-holy-month"
        },
        {
            "title": "Liverpool routs Sparta 5-1 and Roma tops Brighton in Europa League. Marseille and Milan win",
            "description": "Darwin Nunez scored twice to help Liverpool rout Sparta 5-1 and take a big step closer to the Europa League quarterfinals on Thursday.",
            "url": "https://thehimalayantimes.com/sports/liverpool-routs-sparta-5-1-and-roma-tops-brighton-in-europa-league-marseille-and-milan-win"
        },
        {
            "title": "Local authorities ease Everest climbing restrictions ahead of spring season",
            "description": "Local authorities in the Khumbu region have eased some of the major restrictions which were announced to curb luxury in the Everest base camp.",
            "url": "https://thehimalayantimes.com/nepal/local-authorities-ease-everest-climbing-restrictions-ahead-of-spring-season"
        },
        {
            "title": "President Paudel observes Army day celebrations in Tundikhel",
            "description": "President Ramchandra Paudel attended a special ceremony organized by the Nepali Army today at Sainik Manch Tundikhel on the occasion of Mahashivaratri and 261st Army Day.",
            "url": "https://thehimalayantimes.com/kathmandu/president-paudel-observes-army-day-celebrations-in-tundikhel"
        },
        {
            "title": "The soul's code: The key to living a full life",
            "description": "We should not — in a few things — outgrow the ‘child’ residing in us when we grow up. Kids, for instance, have an unfettered gift to expressing their emotions.",
            "url": "https://thehimalayantimes.com/opinion/the-souls-code-the-key-to-living-a-full-life"
        },
        {
            "title": "We will regulate cooperatives, micro-finances strictly: PM Dahal",
            "description": "Prime Minister Pushpa Kamal Dahal 'Prachanda' has expressed the commitment to probe and bring the micro-finance financial institutions that are carrying out works in contravention to the prevailing laws and directives issued by the Nepal Rastra Bank under the purview of action.",
            "url": "https://thehimalayantimes.com/kathmandu/we-will-regulate-cooperatives-micro-finances-strictly-pm-dahal"
        },
        {
            "title": "Karnali province producing skilled workers for reconstruction in quake-hit area",
            "description": "The Karnali province government has decided to prepare skilled workers (masons) for reconstruction in Jajarkot earthquake-affected areas.",
            "url": "https://thehimalayantimes.com/nepal/karnali-province-producing-skilled-workers-for-reconstruction-in-quake-hit-area"
        },
        {
            "title": "Harry Kane steers Bayern into Champions League quarterfinals with 2 goals in 3-0 win over Lazio",
            "description": "Harry Kane scored twice to steer Bayern Munich into the quarterfinals of the Champions League with a 3-0 win over Lazio on Tuesday.",
            "url": "https://thehimalayantimes.com/sports/harry-kane-steers-bayern-into-champions-league-quarterfinals-with-2-goals-in-3-0-win-over-lazio"
        },
        {
            "title": "Education Minister to initiate appointment of expert Chancellor and Co-Chancellor for universities",
            "description": "Shrestha holds a master's degree in Business Administration from the MIT Sloan School of Management in Cambridge, Massachusetts, USA.",
            "url": "https://thehimalayantimes.com/kathmandu/education-minister-to-initiate-appointment-of-expert-chancellor-and-co-chancellor-for-universities"
        },
        {
            "title": "MH370 disappeared a decade ago. Here's what we know about one of aviation's biggest mysteries",
            "description": "Malaysia's government has said that someone intentionally severed communications with the ground and diverted the plane.",
            "url": "https://thehimalayantimes.com/world/mh370-disappeared-a-decade-ago-heres-what-we-know-about-one-of-aviations-biggest-mysteries"
        },
        {
            "title": "Bagmati Province establishes Career Guidance Service Center",
            "description": "The Bagmati Province established a Career Guidance Service Center and career guidance digital platform in Dhulikhel, on Wednesday.",
            "url": "https://thehimalayantimes.com/nepal/bagmati-province-establishes-career-guidance-service-center"
        },
        {
            "title": "Recalling Dr Toni Hagen: A truly 'Citizen of the whole Earth'",
            "description": "Among the few names from abroad who come to mind for putting Nepal on the world’s map in the course of its leap from the medieval days towards modernity in the last century, Dr Toni Hagen’s comes foremost.",
            "url": "https://thehimalayantimes.com/opinion/recalling-dr-toni-hagen-a-truly-citizen-of-the-whole-earth"
        },
        {
            "title": "Gaza cease-fire talks have ended without a breakthrough with Ramadan days away, Egypt says",
            "description": "Three days of negotiations with Hamas over a cease-fire in Gaza and the release of Israeli hostages ended Tuesday without a breakthrough",
            "url": "https://thehimalayantimes.com/world/gaza-cease-fire-talks-have-ended-without-a-breakthrough-with-ramadan-days-away-egypt-says"
        },
        {
            "title": "Arsenal demolishes Sheffield United 6-0 in latest statement win in EPL title bid",
            "description": "Arsenal could climb into first place — if only briefly — by beating Brentford on Saturday, ahead of Liverpool hosting Man City on Sunday.",
            "url": "https://thehimalayantimes.com/sports/arsenal-demolishes-sheffield-united-6-0-in-latest-statement-win-in-epl-title-bid"
        },
        {
            "title": "Gang rape of a tourist in India highlights its struggle to curb sexual violence against women",
            "description": "Police in Jharkhand confirmed the incident and arrested three men over the weekend.",
            "url": "https://thehimalayantimes.com/world/gang-rape-of-a-tourist-in-india-highlights-its-struggle-to-curb-sexual-violence-against-women"
        },
        {
            "title": "Taylor Swift struck a deal with Singapore not to perform in any other Southeast Asian country",
            "description": "Swift’s representative did not immediately respond to a request for comment.",
            "url": "https://thehimalayantimes.com/entertainment/taylor-swift-struck-a-deal-with-singapore-not-to-perform-in-any-other-southeast-asian-country"
        },
        {
            "title": "NEPSE plunges 3.38% as it struggles to hold above 2,000 points",
            "description": "The Nepal Stock Exchange (NEPSE) took a significant tumble on Tuesday, plummeting by 70.31 points, marking a 3.38% decline to settle at 2,007.69 points by day's end, barely clinging to the 2,000-point mark.",
            "url": "https://thehimalayantimes.com/business/nepse-plunges-338-as-it-struggles-to-hold-above-2000-points"
        },
        {
            "title": "Bayern most at risk in Champions League as Real Madrid, Man City, PSG take leads into return games",
            "description": "Bayern's home game against Lazio shapes as the game most in the balance this week.",
            "url": "https://thehimalayantimes.com/sports/bayern-most-at-risk-in-champions-league-as-real-madrid-man-city-psg-take-leads-into-return-games"
        },
        {
            "title": "'Dune: Part Two' brings spice power to the box office with $81.5 million debut",
            "description": "Movie theaters were looking for a savior and “ Dune: Part Two ” is delivering on the promise. Armed with sandworms, big screen spectacle and the star power of Timothée Chalamet, Denis Villeneuve ’s science fiction epic stormed the North American box office this weekend earning $81.5 million in ticket sales, according to studio estimates Sunday.",
            "url": "https://thehimalayantimes.com/entertainment/dune-part-two-brings-spice-power-to-the-box-office-with-815-million-debut"
        },
        {
            "title": "Man City's 3-1 win against Man United provides reality check for Jim Ratcliffe",
            "description": "Good luck trying to knock Manchester City off its perch.",
            "url": "https://thehimalayantimes.com/sports/man-citys-3-1-win-against-man-united-provides-reality-check-for-jim-ratcliffe"
        },
        {
            "title": "Liverpool is exhausted, injury-hit and relying on youngsters. They keep on winning for Klopp",
            "description": "Arsenal, a point behind City in third, visits last-placed Sheffield United on Monday.",
            "url": "https://thehimalayantimes.com/sports/liverpool-is-exhausted-injury-hit-and-relying-on-youngsters-they-keep-on-winning-for-klopp"
        },
        {
            "title": "Lyon masterclass leads Australia to 172-run win against New Zealand in 1st test",
            "description": "Lyon completed match figures of 10-108, his fifth 10 wicket bag, which went along with his 41 as nightwatchman in Australia’s second innings.",
            "url": "https://thehimalayantimes.com/sports/lyon-masterclass-leads-australia-to-172-run-win-against-new-zealand-in-1st-test"
        },
        {
            "title": "Last surviving member of the first team to conquer Mount Everest says it is crowded and dirty now",
            "description": "Kanchha was just a young man when he joined the Hillary-Tenzing expedition.",
            "url": "https://thehimalayantimes.com/lifestyle/last-surviving-member-of-the-first-team-to-conquer-mount-everest-says-it-is-crowded-and-dirty-now"
        },
        {
            "title": "Israel's wartime Cabinet is shaken by a dispute between Netanyahu and his top political rival",
            "description": "The US wants to see progress on the creation of a Palestinian state, envisioning a revamped Palestinian leadership running Gaza with an eye toward eventual statehood.",
            "url": "https://thehimalayantimes.com/world/israels-wartime-cabinet-is-shaken-by-a-dispute-between-netanyahu-and-his-top-political-rival"
        },
        {
            "title": "Parliamentarians committed to international human rights obligations to freedom of expression, access to information, press freedom, and safety of journalists",
            "description": "Thirty parliamentarians convened at Nagarkot from 1-2 March, in a workshop organized by UNESCO Nepal in collaboration with the Inter-Parliamentary Union.",
            "url": "https://thehimalayantimes.com/kathmandu/parliamentarians-committed-to-international-human-rights-obligations-to-freedom-of-expression-access-to-information-press-freedom-and-safety-of-journalists"
        },
        {
            "title": "DoB of bride and groom mandatory in invitation card",
            "description": "The Aathbiskot Municipality-3 of Rukum Paschim has implemented a provision that the date of birth of the bridegroom and the bride must be mentioned in the wedding invitation card.",
            "url": "https://thehimalayantimes.com/nepal/dob-of-bride-and-groom-mandatory-in-invitation-card"
        },
        {
            "title": "9th Edition of Nepal-Pakistan Friendship T20 Cricket Tournament-2024 inaugurated",
            "description": "The 9th Edition of its Annual Nepal-Pakistan Friendship Embassy T20 Cricket Tournament was inaugurated at the Pakistan Embassy Ground, in Kathmandu, today.",
            "url": "https://thehimalayantimes.com/sports/9th-edition-of-nepal-pakistan-friendship-t20-cricket-tournament-2024-inaugurated"
        },
        {
            "title": "Black Yak offers support to Icefall doctors",
            "description": "Korea-based Black Yak Company Ltd has announced to support Icefall doctors who are instrumental in fixing routes on Mt Everest.",
            "url": "https://thehimalayantimes.com/nepal/black-yak-offers-support-to-icefall-doctors"
        },
        {
            "title": "\"A fruitful and satisfying stint\"",
            "description": "In a couple of days, the six-year term of the Chairman of the National Assembly of Nepal, Ganesh Prasad Timilsina, will end.",
            "url": "https://thehimalayantimes.com/kathmandu/a-fruitful-and-satisfying-stint"
        },
        {
            "title": "Australia 13-2 as New Zealand strikes back late on Day 2 of the 1st cricket test",
            "description": "At stumps Usman Khawaja was 5 not out and nightwatchman Nathan Lyon was 6 not out.",
            "url": "https://thehimalayantimes.com/sports/australia-13-2-as-new-zealand-strikes-back-late-on-day-2-of-the-1st-cricket-test"
        },
        {
            "title": "French president raised the prospect of Western troops in Ukraine. What was he thinking?",
            "description": "After Russia's full-scale invasion of Ukraine, Macron initially kept open a line of communication with Putin.",
            "url": "https://thehimalayantimes.com/world/french-president-raised-the-prospect-of-western-troops-in-ukraine-what-was-he-thinking"
        },
        {
            "title": "World Bank to provide Rs 26.51 billion for growth reforms, better local roads in Nepal",
            "description": "The World Bank has approved Rs 26.51 billion in new financing for two projects in Nepal aimed at supporting the country’s transition toward Green, Resilient, and Inclusive Development",
            "url": "https://thehimalayantimes.com/business/world-bank-to-provide-rs-2651-billion-for-growth-reforms-better-local-roads-in-nepal"
        },
        {
            "title": "Nepali exodus: People voting with feet",
            "description": "Nepal is grappling with a growing sense of people’s dissatisfaction regarding the performance, efficacy and integrity of the government and the political leadership.",
            "url": "https://thehimalayantimes.com/opinion/nepali-exodus-people-voting-with-feet"
        },
        {
            "title": "India's richest man is bringing Rihanna and 1,200 guests to a pre-wedding bash for his son",
            "description": "It could be the biggest party this small west Indian city has ever seen. As billionaire industrialist Mukesh Ambani prepares for the wedding of his young son this summer, he's expecting billionaires from around the world, heads of state, and Hollywood and Bollywood royalty to attend a three-day bash in the family's hometown, starting Friday.",
            "url": "https://thehimalayantimes.com/entertainment/indias-richest-man-is-bringing-rihanna-and-1200-guests-to-a-pre-wedding-bash-for-his-son"
        },
        {
            "title": "No issues in coalition government: Deuba",
            "description": "Nepali Congress (NC) President Sher Bahadur Deuba has said there is no issues among the political parties in the coalition government.",
            "url": "https://thehimalayantimes.com/nepal/no-issues-in-coalition-government-deuba"
        },
        {
            "title": "One Tech Tip: Don't use rice for your device. Here's how to dry out your smartphone",
            "description": "You were walking next to a swimming pool when you slipped and dropped your phone into the water. Or it slipped out of your hand when you were next to a filled bathtub or toilet.",
            "url": "https://thehimalayantimes.com/science-and-tech/one-tech-tip-dont-use-rice-for-your-device-heres-how-to-dry-out-your-smartphone"
        },
        {
            "title": "How Chinese science fiction went from underground magazines to a big-budget Netflix show",
            "description": "For a few days in October 2023, the capital of the science fiction world was Chengdu, China. Fans traveled from around the world as Worldcon, sci-fi’s biggest annual event, was held in the country for the first time.",
            "url": "https://thehimalayantimes.com/entertainment/how-chinese-science-fiction-went-from-underground-magazines-to-a-big-budget-netflix-show"
        },
        {
            "title": "Infectious Disease Research Centre setup gains momentum in Tikapur",
            "description": "The setup of Infectious Disease Research Centre has gained momentum in the Sudurpaschim province.",
            "url": "https://thehimalayantimes.com/nepal/infectious-disease-research-centre-setup-gains-momentum-in-tikapur"
        },
        {
            "title": "200,000 plus taxpayers not regularly paying tax at KMC",
            "description": "It has been found that around 200,000 taxpayers are not regularly paying tax at the Kathmandu Metropolitan City (KMC).",
            "url": "https://thehimalayantimes.com/kathmandu/200000-plus-taxpayers-not-regularly-paying-tax-at-kmc"
        },
        {
            "title": "A deal between Israel and Hamas appears to be taking shape. What would it look like?",
            "description": "Israel wants to retain overall security control in the Gaza Strip and has rejected having world powers impose a state on it.",
            "url": "https://thehimalayantimes.com/world/a-deal-between-israel-and-hamas-appears-to-be-taking-shape-what-would-it-look-like"
        },
        {
            "title": "Conway out, Ravindra in for New Zealand ahead of 1st test against Australia",
            "description": "Australia captain Pat Cummins has named an unchanged starting XI for the test.",
            "url": "https://thehimalayantimes.com/sports/conway-out-ravindra-in-for-new-zealand-ahead-of-1st-test-against-australia"
        },
        {
            "title": "Govt serious about addressing usury victims' problems: PM Dahal",
            "description": "PM Dahal has assured that the government is seriously working to address the problems of victims of usury, microfinance, and cooperatives.",
            "url": "https://thehimalayantimes.com/nepal/govt-serious-about-addressing-usury-victims-problems-pm-dahal"
        },
        {
            "title": "Climate crisis: Why can't Nepal lead in global action?",
            "description": "In a recent remark, Prime Minister Dahal stressed that “Nepal has a zilch role in climate crisis”.",
            "url": "https://thehimalayantimes.com/opinion/climate-crisis-why-cant-nepal-lead-in-global-action"
        },
        {
            "title": "Agency asks NMA to cancel Al-Arjan's Mera Peak certificate",
            "description": "Fourteen Summits Pvt. Ltd today formally asked the Nepal Mountaineering Association to cancel a summit certificate which was awarded to Abdul Rahim Al-Arjan saying he provided a fake photo of the Mera peak summit.",
            "url": "https://thehimalayantimes.com/nepal/agency-asks-nma-to-cancel-al-arjans-mera-peak-certificate"
        },
        {
            "title": "Reimagine: Himalayan Art Now, the Rubin Museum's final exhibition",
            "description": "The Rubin Museum of Art is organizing its final exhibition at its 17th street location in New York, USA from March 15.",
            "url": "https://thehimalayantimes.com/lifestyle/reimagine-himalayan-art-now-the-rubin-museums-final-exhibition"
        },
        {
            "title": "The Phoenix: Jessica's journey from the brink of death",
            "description": "Against all odds, 9-year-old Jessica Saud from Badimalika Municipality-5 in Bajura has defied death's grip.",
            "url": "https://thehimalayantimes.com/nepal/the-phoenix-jessicas-journey-from-the-brink-of-death"
        },
        {
            "title": "'Efforts on to repatriate Nepali nationals recruited in Russian military'",
            "description": "Minister for Foreign Affairs NP Saud said efforts were underway to repatriate the Nepali nationals recruited in the Russian military.",
            "url": "https://thehimalayantimes.com/nepal/efforts-on-to-repatriate-nepali-nationals-recruited-in-russian-military"
        },
        {
            "title": "PAC directs CIAA to speed up investigation, prosecution process",
            "description": "Chief Commissioner of the CIAA, Prem Kumar Rai, briefed the meeting on the status of the implementation of directives issued by the PAC to the CIAA.",
            "url": "https://thehimalayantimes.com/nepal/pac-directs-ciaa-to-speed-up-investigation-prosecution-process"
        },
        {
            "title": "Pakistan's former premier Imran Khan and his wife plead not guilty in another corruption case",
            "description": "Khan's party on Tuesday announced nationwide protests on Saturday against alleged rigging in the election.",
            "url": "https://thehimalayantimes.com/world/pakistans-former-premier-imran-khan-and-his-wife-plead-not-guilty-in-another-corruption-case"
        },
        {
            "title": "Australian police find bodies of couple after officer who was an ex-boyfriend admits to killing them",
            "description": "State Premier Chris Minns said he hoped police would be allowed to march, but ruled out withdrawing government funding.",
            "url": "https://thehimalayantimes.com/world/australian-police-find-bodies-of-couple-after-officer-who-was-an-ex-boyfriend-admits-to-killing-them"
        },
        {
            "title": "Aba Haschha America\" concludes, spreading laughter across 14 American cities",
            "description": "The tour 'Aba Haschha America' has successully concluded with a group of Nepali comedians brigning laughter to audiences across various cities in the United States.",
            "url": "https://thehimalayantimes.com/nepal/aba-haschha-america-concludes-spreading-laughter-across-14-american-cities"
        },
        {
            "title": "Rare diseases in Nepal: Lack of resources and medicines multiply the patients' hardships",
            "description": "World Health Organization (WHO) delineated rare diseases as conditions affecting a small fraction of the population, specifically fewer than 1 in 2,000 individuals within a given populace.",
            "url": "https://thehimalayantimes.com/nepal/rare-diseases-in-nepal-lack-of-resources-and-medicines-multiply-the-patients-hardships"
        },
        {
            "title": "Hungary's parliament ratifies Sweden's NATO bid, clearing the final obstacle to membership",
            "description": "Hungary’s parliament voted Monday to ratify Sweden's bid to join NATO",
            "url": "https://thehimalayantimes.com/world/hungarys-parliament-ratifies-swedens-nato-bid-clearing-the-final-obstacle-to-membership"
        },
        {
            "title": "Persons with disabilities: Govt be serious about their rights",
            "description": "Each year, the 3rd of December is universally celebrated as the International Day of Persons with Disabilities, more known as International Disability Day. These are citizens still living on the margins of society.",
            "url": "https://thehimalayantimes.com/opinion/persons-with-disabilities-govt-be-serious-about-their-rights"
        },
        {
            "title": "Govt decides to provide Rs 1 mln as relief to victim of Barahathawa incident",
            "description": "Government spokesperson Sharma further informed that the local levels suffering from the Jakarkot Earthquake would be declared a disaster-hit zone.",
            "url": "https://thehimalayantimes.com/nepal/govt-decides-to-provide-rs-1-mln-as-relief-to-victim-of-barahathawa-incident"
        },
        {
            "title": "Reading newspapers: Let's revive the culture",
            "description": "There is something I hardly can live without: reading news. While I do spend a lot of time reading news online, I am a bit of a traditionalist, old school guy, and I still love reading printed newspapers. The other day, my usual newspaper shop was closed, and it was around 5pm in the evening and a sort of “fear of missing out” hit me.",
            "url": "https://thehimalayantimes.com/opinion/reading-newspapers-lets-revive-the-culture-28950"
        },
        {
            "title": "In water-stressed Singapore, a search for new solutions to keep the taps flowing",
            "description": "Despite the leaps that Singapore has made in its journey for water security, Seah warns that continued progress is essential for the island.",
            "url": "https://thehimalayantimes.com/lifestyle/in-water-stressed-singapore-a-search-for-new-solutions-to-keep-the-taps-flowing"
        },
        {
            "title": "South Korea sets Thursday as deadline for striking young doctors to return to work",
            "description": "South Korea's government gave striking young doctors four days to report back to work, saying Monday that they won't be punished if they return by the deadline but will face indictments and suspensions of medical licenses if they don't.",
            "url": "https://thehimalayantimes.com/world/south-korea-sets-thursday-as-deadline-for-striking-young-doctors-to-return-to-work"
        },
        {
            "title": "PM vows to take private sector on board for economic reforms",
            "description": "CNI President Rajesh Kumar Agrawal emphasized that the business community should have an environment to work freely.",
            "url": "https://thehimalayantimes.com/business/pm-vows-to-take-private-sector-on-board-for-economic-reforms"
        },
        {
            "title": "Israeli media report progress on reaching a temporary truce in Gaza and a hostage-prisoner exchange",
            "description": "Israeli Prime Minister Benjamin Netanyahu said he'll convene the Cabinet this week to “approve the operational plans for action in Rafah,” including the evacuation of civilians.",
            "url": "https://thehimalayantimes.com/world/israeli-media-report-progress-on-reaching-a-temporary-truce-in-gaza-and-a-hostage-prisoner-exchange"
        },
        {
            "title": "New era at Man United begins with a loss. Man City and Arsenal win to close gap to Liverpool",
            "description": "It was Foden’s 16th goal of the season in all competitions, already tying the England forward's most in a single season.",
            "url": "https://thehimalayantimes.com/sports/new-era-at-man-united-begins-with-a-loss-man-city-and-arsenal-win-to-close-gap-to-liverpool"
        },
        {
            "title": "After 2 years of war, questions abound on whether Kyiv can sustain the fight against Russia",
            "description": "Ukraine suffered setbacks after the much-anticipated summer counteroffensive failed to produce any breakthroughs.",
            "url": "https://thehimalayantimes.com/world/after-2-years-of-war-questions-abound-on-whether-kyiv-can-sustain-the-fight-against-russia"
        },
        {
            "title": "Even celebrities hesitate to share their cancer struggles: Experts say",
            "description": "Medical experts and activists specialized in cancer care emphasized how swiftly media outlets present a negative narrative surrounding cancer.",
            "url": "https://thehimalayantimes.com/kathmandu/even-celebrities-hesitate-to-share-their-cancer-struggles-experts-say"
        },
        {
            "title": "Japan, Nepal's partner for reliable development: President Paudel",
            "description": "President Ramchandra Paudel has said Japan is very indeed a good friend of Nepal and a reliable partner for fostering sustainable development.",
            "url": "https://thehimalayantimes.com/kathmandu/japan-nepals-partner-for-reliable-development-president-paudel"
        },
        {
            "title": "'Oppenheimer,' Lily Gladstone win at 30th Screen Actors Guild Awards",
            "description": "“Oppenheimer” continued to steamroll through Hollywood’s awards season on Saturday, winning the top prize, for outstanding cast, along with awards for Cillian Murphy and Robert Downey Jr., at the 30th Screen Actors Guild Awards.",
            "url": "https://thehimalayantimes.com/entertainment/oppenheimer-lily-gladstone-win-at-30th-screen-actors-guild-awards"
        },
        {
            "title": "Narayangadh-Muglin road no longer closing daily from today",
            "description": "The Narayangadh-Muglin road, which was being closed for four hours every day in the afternoon, will not be closed from today.",
            "url": "https://thehimalayantimes.com/nepal/narayangadh-muglin-road-no-longer-closing-daily-from-today"
        },
        {
            "title": "Country cannot develop without development of Madhesh: PM Dahal",
            "description": "Prime Minister Pushpa Kamal Dahal 'Prachanda' has said that the country will not develop without the development of Madhes. He also pledged to continue to work for the development of the Madhes region.",
            "url": "https://thehimalayantimes.com/nepal/country-cannot-develop-without-development-of-madhesh-pm-dahal"
        },
        {
            "title": "KMC to take strict action against plastic bouquet, flower users",
            "description": "The Kathmandu Metropolitan City (KMC) has warned to take strict action against those using plastic bouquets and flowers.",
            "url": "https://thehimalayantimes.com/kathmandu/kmc-to-take-strict-against-plastic-bouquet-flower-users"
        },
        {
            "title": "Glimpses into autobiography of mountaineer Lhakpa Sonam Sherpa\r ",
            "description": "Senior tourism entrepreneur Lhakpa Sonam Sherpa, who successfully scaled Mt Everest last year, has proposed to form a special committee comprising representatives from different agencies to monitor mountaineering expeditions in the Everest base camp.",
            "url": "https://thehimalayantimes.com/nepal/glimpses-into-autobiography-of-mountaineer-lhakpa-sonam-sherpa"
        },
        {
            "title": "Australia beats New Zealand by 72 runs in 2nd T20 to win 3-match series",
            "description": "Australia won the first match by six wickets with a four off the last ball and the third match between the teams is at Eden Park on Sunday.",
            "url": "https://thehimalayantimes.com/sports/australia-beats-new-zealand-by-72-runs-in-2nd-t20-to-win-3-match-series"
        },
        {
            "title": "MoHA directs DAOs to report illegally usurped land",
            "description": "The Ministry of Home Affairs has issued a circular to the chief district officers of 77 districts, instructing them to collect and send details about government-owned land.",
            "url": "https://thehimalayantimes.com/nepal/moha-directs-daos-to-report-illegally-usurped-land"
        },
        {
            "title": "Israeli strikes in Gaza kill 48 as fears mount over humanitarian crisis and West Bank violence",
            "description": "Tempers are likely to be even more volatile this year over the Gaza war and spiraling violence in the West Bank.",
            "url": "https://thehimalayantimes.com/world/israeli-strikes-in-gaza-kill-48-as-fears-mount-over-humanitarian-crisis-and-west-bank-violence"
        },
        {
            "title": "Newly appointed TU Vice-Chancellor Baral assumes office",
            "description": "Newly Appointed Tribhuvan University Vice-Chancellor, Prof. Dr. Keshar Jung Baral, Assumes Office.",
            "url": "https://thehimalayantimes.com/kathmandu/newly-appointed-tu-vice-chancellor-baral-assumes-office"
        },
        {
            "title": "Soccer star Dani Alves found guilty of rape, sentenced to four and a half years in prison",
            "description": "A three-judge panel at the Barcelona Provincial Court convicted the 40-year-old Alves of sexual assault for the incident on Dec. 31, 2022.",
            "url": "https://thehimalayantimes.com/sports/soccer-star-dani-alves-found-guilty-of-rape-sentenced-to-four-and-a-half-years-in-prison"
        },
        {
            "title": "Russia's forces turn their focus on Ukraine's northeast in what may be an ambitious new push",
            "description": "Russian forces are probing Ukrainian defenses for weak points in the country’s northeast, an official said Thursday",
            "url": "https://thehimalayantimes.com/world/russias-forces-turn-their-focus-on-ukraines-northeast-in-what-may-be-an-ambitious-new-push"
        },
        {
            "title": "In Pictures: Daily life at Brick Kiln",
            "description": "A worker loads bricks on her back while walking to unload them at a brick kiln in Bhaktapur, Nepal on Thursday.",
            "url": "https://thehimalayantimes.com/photo-gallery/in-pictures-daily-life-at-brick-kiln"
        },
        {
            "title": "NNMGA's Aspirant Guide Course: Forging Excellence in Mountaineering Education and Leadership",
            "description": "The Aspirant Guide Course, offered by the Nepal National Mountain Guide Association (NNMGA), stands as a transformative journey recognized by the International Federation of Mountain Guide Associations (IFMGA).",
            "url": "https://thehimalayantimes.com/nepal/nnmgas-aspirant-guide-course-forging-excellence-in-mountaineering-education-and-leadership"
        },
        {
            "title": "UK minister launches new UK-Nepal development portfolio",
            "description": "UK Minister of State for Development and Africa Andrew Mitchell visited Nepal on 19-20 February and announced a new development portfolio.",
            "url": "https://thehimalayantimes.com/kathmandu/uk-minister-launches-new-uk-nepal-development-portfolio"
        },
        {
            "title": "Life is a process: It is also balance",
            "description": "Our life is like the seasons. It is simple; it is complex; it is also, at times, tetchy. Yet, in the midst of happiness and chaos, it is as exciting as a nail-biting Twenty20 cricket match.",
            "url": "https://thehimalayantimes.com/opinion/life-is-a-process-it-is-also-balance"
        },
        {
            "title": "Curfew relaxed in Birgunj",
            "description": "The curfew imposed in Birgunj area for an indefinite period due to security concern has been relaxed to some extent.",
            "url": "https://thehimalayantimes.com/nepal/curfew-relaxed-in-birgunj"
        },
        {
            "title": "Nepal and UK sign agreement to enforce programs on business and Green Growth",
            "description": "Nepal and the UK have signed two grant agreements - the Nepal in Business (NIB) programs and the implementation of Green Growth Nepal (GGN) programs on Tuesday.",
            "url": "https://thehimalayantimes.com/business/nepal-and-uk-sign-agreement-to-enforce-programs-on-business-and-green-growth"
        },
        {
            "title": "British Minister Mitchell pays courtesy call on PM Dahal",
            "description": "British Minister for the Development of Africa, Andrew Mitchell, paid a courtesy call on Prime Minister Pushpa Kamal Dahal on Tuesday.",
            "url": "https://thehimalayantimes.com/kathmandu/british-minister-mitchell-pays-courtesy-call-on-pm-dahal"
        },
        {
            "title": "Mathews stars for Sri Lanka in T20 series-clinching win over Afghanistan",
            "description": "Angelo Mathews starred with a brisk unbeaten 42 then both opening wickets.",
            "url": "https://thehimalayantimes.com/sports/mathews-stars-for-sri-lanka-in-t20-series-clinching-win-over-afghanistan"
        },
        {
            "title": "Indefinite curfew clamped in Birgunj",
            "description": "Meanwhile, security measures have been intensified in Birgunj Metropolitan City in response to the curfew.",
            "url": "https://thehimalayantimes.com/nepal/indefinite-curfew-clamped-in-birgunj"
        },
        {
            "title": "Astronomers find what may be the universe's brightest object with a black hole devouring a sun a day",
            "description": "While the quasar resembles a mere dot in images, scientists envision a ferocious place.",
            "url": "https://thehimalayantimes.com/science-and-tech/astronomers-find-what-may-be-the-universes-brightest-object-with-a-black-hole-devouring-a-sun-a-day"
        },
        {
            "title": "Russia says it has crushed the last pocket of resistance in Avdiivka to complete the city's capture",
            "description": "Russian forces have completed their takeover of Avdiivka by eliminating the last pocket of resistance at the eastern Ukraine city’s huge coke plant,",
            "url": "https://thehimalayantimes.com/world/russia-says-it-has-crushed-the-last-pocket-of-resistance-in-avdiivka-to-complete-the-citys-capture"
        },
        {
            "title": "Gaza Health Ministry says over 29,000 Palestinians have been killed in Israel-Hamas war",
            "description": "More than 29,000 Palestinians have been killed in the Gaza Strip since the start of the Israel-Hamas war, the territory's Health Ministry said Monday,",
            "url": "https://thehimalayantimes.com/world/gaza-health-ministry-says-over-29000-palestinians-have-been-killed-in-israel-hamas-war"
        },
        {
            "title": "Education Bill will be passed with amendments, says PM Dahal",
            "description": "PM Dahal has indicated that the School Education Bill, currently under consideration in the Federal Parliament, will be passed following necessary amendments.",
            "url": "https://thehimalayantimes.com/nepal/education-bill-will-be-passed-with-amendments-says-pm-dahal"
        },
        {
            "title": "'Oppenheimer' wins 7 prizes, including best picture, at the British Academy Film Awards",
            "description": "Atom bomb epic “Oppenheimer” won seven prizes, including best picture, director and actor, at the 77th British Academy Film Awards on Sunday, cementing its front-runner status for the Oscars next month.",
            "url": "https://thehimalayantimes.com/entertainment/oppenheimer-wins-7-prizes-including-best-picture-at-the-british-academy-film-awards"
        },
        {
            "title": "Himalaya Jet signs with Aloft Hotel asas its first hotel under Himalya Jet Holidays",
            "description": "The Himalaya Jet has announced its first partnership with Aloft Hotel under its Himalayan Jet Holidays program.",
            "url": "https://thehimalayantimes.com/business/himalaya-jet-signs-with-aloft-hotel-asas-its-first-hotel-under-himalya-jet-holidays"
        },
        {
            "title": "Gold prices surge, silver declines in domestic market",
            "description": "The domestic market witnessed a increase in gold prices on Monday, climbing by Rs 400 per tola, while silver experienced a contrasting trend, dropping by Rs 20 per tola.",
            "url": "https://thehimalayantimes.com/business/gold-prices-surge-silver-declines-in-domestic-market"
        },
        {
            "title": "President Paudel observes Madhavnarayan Mela",
            "description": "On the occasion, President Paudel paid obeisance and worshipped Shri Swasthani and Madhavnarayan.",
            "url": "https://thehimalayantimes.com/kathmandu/president-paudel-observes-madhavnarayan-mela"
        },
        {
            "title": "Russia takes control of a city in eastern Ukraine after Ukrainian troops withdraw",
            "description": "White House National Security Council spokesperson Adrienne Watson called the withdrawal “the cost of Congressional inaction.”",
            "url": "https://thehimalayantimes.com/world/russia-takes-control-of-a-city-in-eastern-ukraine-after-ukrainian-troops-withdraw"
        },
        {
            "title": "Klinsmann fired as coach of South Korea's national soccer team after Asian Cup semifinal loss",
            "description": "Klinsmann, head coach of the United States national team from 2011 to 2016, thanked his players in a social media post.",
            "url": "https://thehimalayantimes.com/sports/klinsmann-fired-as-coach-of-south-koreas-national-soccer-team-after-asian-cup-semifinal-loss"
        },
        {
            "title": "Thai ex-Prime Minister Thaksin gets free on parole, but can he restore his old political luster?",
            "description": "Current Prime Minister Srettha Thavisin, a leading member of the ruling Thaksin-backed Pheu Thai party, expressed congratulations to his predecessor.",
            "url": "https://thehimalayantimes.com/world/thai-ex-prime-minister-thaksin-gets-free-on-parole-but-can-he-restore-his-old-political-luster"
        },
        {
            "title": "Jaiswal double hundred headlines India's record 434-run win over England in 3rd test",
            "description": "It was England’s second biggest defeat by runs in test cricket after losing by 562 runs against Australia in 1934.",
            "url": "https://thehimalayantimes.com/sports/jaiswal-double-hundred-headlines-indias-record-434-run-win-over-england-in-3rd-test"
        },
        {
            "title": "'Treat your body through the mouth'",
            "description": "In order to be healthy and live a long life, Dr. Roochi Patel Sahi opines, “People of Nepal must understand that oral health is not just mouth health; it is the gateway to the human body and a signal to the health of your entire human system.”",
            "url": "https://thehimalayantimes.com/nepal/treat-your-body-through-the-mouth"
        },
        {
            "title": "Kylian Mbappe has told PSG he will leave at the end of the season, AP sources say",
            "description": "Kylian Mbappe has told Paris Saint-Germain he will leave the club at the end of the season.",
            "url": "https://thehimalayantimes.com/sports/kylian-mbappe-has-told-psg-he-will-leave-at-the-end-of-the-season-ap-sources-say"
        },
        {
            "title": "Alexei Navalny, galvanizing opposition leader and Putin's fiercest foe, died in prison, Russia says",
            "description": "Navalny was in a medically induced coma for about two weeks.",
            "url": "https://thehimalayantimes.com/world/alexei-navalny-galvanizing-opposition-leader-and-putins-fiercest-foe-died-in-prison-russia-says"
        },
        {
            "title": "Postage stamps printed within country after 64 years",
            "description": "The government has accomplished the feat of printing postage stamps within the country after 64 years.",
            "url": "https://thehimalayantimes.com/kathmandu/postage-stamps-printed-within-country-after-64-years"
        },
        {
            "title": "Russia tightens the noose on Ukraine's city of Avdiivka where outnumbered defenders are holding out",
            "description": "The Ukrainian defenders prepared for “any possible scenarios,” according to Brig. Gen. Oleksandr Tarnavskyi, head of the Ukrainian forces in Avdiivka.",
            "url": "https://thehimalayantimes.com/world/russia-tightens-the-noose-on-ukraines-city-of-avdiivka-where-outnumbered-defenders-are-holding-out"
        },
        {
            "title": "Kane Williamson leads the way as New Zealand beats South Africa by 7 wickets in 2nd test",
            "description": "Williamson scored centuries in both innings of the first test which New Zealand won by 281 runs.",
            "url": "https://thehimalayantimes.com/sports/kane-williamson-leads-the-way-as-new-zealand-beats-south-africa-by-7-wickets-in-2nd-test"
        },
        {
            "title": "Proposing on Valentine's Day, Albanese becomes Australia's first leader to get engaged in office",
            "description": "Albanese, 60, has an adult son with his first wife. They divorced after a 19-year marriage.",
            "url": "https://thehimalayantimes.com/lifestyle/proposing-on-valentines-day-albanese-becomes-australias-first-leader-to-get-engaged-in-office"
        },
        {
            "title": "New Zealand is 40-1 after Day 3, chasing 267 to beat South Africa in the 2nd cricket test",
            "description": "The highest successful fourth innings run chase at any ground in New Zealand is 345 by the West Indies at Eden Park, Auckland in 1969.",
            "url": "https://thehimalayantimes.com/sports/new-zealand-is-40-1-after-day-3-chasing-267-to-beat-south-africa-in-the-2nd-cricket-test"
        },
        {
            "title": "US company's lunar lander rockets toward the moon for a touchdown attempt next week",
            "description": "Another private US company took a shot at the moon Thursday, launching a month after a rival’s lunar lander missed its mark and came crashing back.",
            "url": "https://thehimalayantimes.com/science-and-tech/us-companys-lunar-lander-rockets-toward-the-moon-for-a-touchdown-attempt-next-week"
        },
        {
            "title": "Israeli forces storm the main hospital in southern Gaza, saying hostages were likely held there",
            "description": "Israeli forces stormed the main hospital in southern Gaza on Thursday, hours after Israeli fire killed a patient and wounded six others inside the complex.",
            "url": "https://thehimalayantimes.com/world/israeli-forces-storm-the-main-hospital-in-southern-gaza-saying-hostages-were-likely-held-there"
        },
        {
            "title": "Consensus needed among political parties for achieving prosperity: Speaker Ghimire",
            "description": "Speaker of the House of Representatives, Devraj Ghimire, has underscored on the need of all political parties to move ahead with consensus for achieving prosperity.",
            "url": "https://thehimalayantimes.com/nepal/consensus-needed-among-political-parties-for-achieving-prosperity-speaker-ghimire"
        }
    ],
    "current_page": 11
}