{
    "articles": [
        {
            "title": "Bayern Munich seeks consistency to make Lazio win the start of a turnaround",
            "description": "Next up for Bayern on Saturday at home is relegation-threatened Mainz, the club which gave Tuchel his first head coach job back in 2009.",
            "url": "https://thehimalayantimes.com/sports/bayern-munich-seeks-consistency-to-make-lazio-win-the-start-of-a-turnaround"
        },
        {
            "title": "China accuses US of devising tactics to suppress China despite improvement in relations",
            "description": "“Our bottom line is also very clear,” Wang said. “That is Taiwan will never be allowed to split from the motherland.”",
            "url": "https://thehimalayantimes.com/world/china-accuses-us-of-devising-tactics-to-suppress-china-despite-improvement-in-relations"
        },
        {
            "title": "Modi visits Kashmir's main city for the first time since revoking region's semi-autonomy",
            "description": "India's powerful home minister, Amit Shah, has repeatedly promised that the region would regain statehood after elections.",
            "url": "https://thehimalayantimes.com/world/modi-visits-kashmirs-main-city-for-the-first-time-since-revoking-regions-semi-autonomy"
        },
        {
            "title": "From Blue Mountains, Pepper eyes fastest no O2 ascent of 14 peaks",
            "description": "An Australian woman climber is all set to leave for Mt Annapurna in a bid to complete all 14 peaks above 8,000m without using supplemental oxygen.",
            "url": "https://thehimalayantimes.com/nepal/from-blue-mountains-pepper-eyes-fastest-no-o2-ascent-of-14-peaks"
        },
        {
            "title": "Bagmati Province establishes Career Guidance Service Center",
            "description": "The Bagmati Province established a Career Guidance Service Center and career guidance digital platform in Dhulikhel, on Wednesday.",
            "url": "https://thehimalayantimes.com/nepal/bagmati-province-establishes-career-guidance-service-center"
        },
        {
            "title": "Man City's 3-1 win against Man United provides reality check for Jim Ratcliffe",
            "description": "Good luck trying to knock Manchester City off its perch.",
            "url": "https://thehimalayantimes.com/sports/man-citys-3-1-win-against-man-united-provides-reality-check-for-jim-ratcliffe"
        },
        {
            "title": "\"A fruitful and satisfying stint\"",
            "description": "In a couple of days, the six-year term of the Chairman of the National Assembly of Nepal, Ganesh Prasad Timilsina, will end.",
            "url": "https://thehimalayantimes.com/kathmandu/a-fruitful-and-satisfying-stint"
        },
        {
            "title": "Nepali exodus: People voting with feet",
            "description": "Nepal is grappling with a growing sense of people’s dissatisfaction regarding the performance, efficacy and integrity of the government and the political leadership.",
            "url": "https://thehimalayantimes.com/opinion/nepali-exodus-people-voting-with-feet"
        },
        {
            "title": "Climate crisis: Why can't Nepal lead in global action?",
            "description": "In a recent remark, Prime Minister Dahal stressed that “Nepal has a zilch role in climate crisis”.",
            "url": "https://thehimalayantimes.com/opinion/climate-crisis-why-cant-nepal-lead-in-global-action"
        },
        {
            "title": "EPR is most efficient curb on plastic pollution, say experts",
            "description": "While plastic pollution is hazardous to human health and the environment, experts claim that plastic producers, such as large corporations, have been able to avoid prosecution by exploiting legal loopholes.",
            "url": "https://thehimalayantimes.com/nepal/epr-is-most-efficient-curb-on-plastic-pollution-say-experts"
        },
        {
            "title": "Rare diseases in Nepal: Lack of resources and medicines multiply the patients' hardships",
            "description": "World Health Organization (WHO) delineated rare diseases as conditions affecting a small fraction of the population, specifically fewer than 1 in 2,000 individuals within a given populace.",
            "url": "https://thehimalayantimes.com/nepal/rare-diseases-in-nepal-lack-of-resources-and-medicines-multiply-the-patients-hardships"
        },
        {
            "title": "South Korea sets Thursday as deadline for striking young doctors to return to work",
            "description": "South Korea's government gave striking young doctors four days to report back to work, saying Monday that they won't be punished if they return by the deadline but will face indictments and suspensions of medical licenses if they don't.",
            "url": "https://thehimalayantimes.com/world/south-korea-sets-thursday-as-deadline-for-striking-young-doctors-to-return-to-work"
        },
        {
            "title": "Glimpses into autobiography of mountaineer Lhakpa Sonam Sherpa\r ",
            "description": "Senior tourism entrepreneur Lhakpa Sonam Sherpa, who successfully scaled Mt Everest last year, has proposed to form a special committee comprising representatives from different agencies to monitor mountaineering expeditions in the Everest base camp.",
            "url": "https://thehimalayantimes.com/nepal/glimpses-into-autobiography-of-mountaineer-lhakpa-sonam-sherpa"
        },
        {
            "title": "The opposition alliance that aimed to oust Modi appears to be cracking just before India's elections",
            "description": "Modi’s party denies using law enforcement agencies to target the opposition and says the agencies act independently.",
            "url": "https://thehimalayantimes.com/world/the-opposition-alliance-that-aimed-to-oust-modi-appears-to-be-cracking-just-before-indias-elections"
        },
        {
            "title": "UML's demand to table the report on Balkumari incident in the House",
            "description": "The main opposition CPN (UML) has demanded that the government table the report of the commission formed to investigate the fatal incident that took place in Balkumari of Lalitpur. I",
            "url": "https://thehimalayantimes.com/kathmandu/umls-demand-to-table-the-report-on-balkumari-incident-in-the-house"
        },
        {
            "title": "Burst of high-profile coaching departures leaves 3 iconic European clubs scrambling for replacements",
            "description": "That’s three of Europe’s iconic soccer clubs needing a new coach at the end of the season.",
            "url": "https://thehimalayantimes.com/sports/burst-of-high-profile-coaching-departures-leaves-3-iconic-european-clubs-scrambling-for-replacements"
        },
        {
            "title": "UK minister launches new UK-Nepal development portfolio",
            "description": "UK Minister of State for Development and Africa Andrew Mitchell visited Nepal on 19-20 February and announced a new development portfolio.",
            "url": "https://thehimalayantimes.com/kathmandu/uk-minister-launches-new-uk-nepal-development-portfolio"
        },
        {
            "title": "Life is a process: It is also balance",
            "description": "Our life is like the seasons. It is simple; it is complex; it is also, at times, tetchy. Yet, in the midst of happiness and chaos, it is as exciting as a nail-biting Twenty20 cricket match.",
            "url": "https://thehimalayantimes.com/opinion/life-is-a-process-it-is-also-balance"
        },
        {
            "title": "Nepal and UK sign agreement to enforce programs on business and Green Growth",
            "description": "Nepal and the UK have signed two grant agreements - the Nepal in Business (NIB) programs and the implementation of Green Growth Nepal (GGN) programs on Tuesday.",
            "url": "https://thehimalayantimes.com/business/nepal-and-uk-sign-agreement-to-enforce-programs-on-business-and-green-growth"
        },
        {
            "title": "Potential of federalism should be realized: PM Dahal",
            "description": "Prime Minister Pushpa Kamal Dahal \"Prachanda\" has said that the immense potential brought about by the federal democratic system of governance should be realized into opportunities.",
            "url": "https://thehimalayantimes.com/kathmandu/potential-of-federalism-should-be-realized-pm-dahal"
        },
        {
            "title": "Migrant worker plight highlighted at World Social Forum 2024",
            "description": "The discussion shed light on the formidable challenges confronting migrant workers globally.",
            "url": "https://thehimalayantimes.com/kathmandu/panel-discussion-illuminates-challenges-confronting-migrant-workers-at-world-social-forum-2024"
        },
        {
            "title": "Policy against same individual owning business and bank, says PM Dahal",
            "description": "Prime Minister Pushpa Kamal Dahal 'Prachanda' has said that the government has made legal arrangements to address the problems arising from the same individual or group owning both business and bank.",
            "url": "https://thehimalayantimes.com/kathmandu/policy-against-same-individual-owning-business-and-bank-says-pm-dahal"
        },
        {
            "title": "Ben Affleck inspired J.Lo's first album in a decade. She's using it to poke fun at her romantic past",
            "description": "Throughout her career, Jennifer Lopez has been hailed as an epochal, prolific and hard-working artist.",
            "url": "https://thehimalayantimes.com/entertainment/ben-affleck-inspired-jlos-first-album-in-a-decade-shes-using-it-to-poke-fun-at-her-romantic-past"
        },
        {
            "title": "Indonesian voters choose a new president in one of the world's largest elections",
            "description": "Indonesians have voted for a new president Wednesday as the world’s third-largest democracy aspires to become a global economic powerhouse a quarter-century after shaking off a brutal dictatorship.",
            "url": "https://thehimalayantimes.com/world/indonesian-voters-choose-a-new-president-in-one-of-the-worlds-largest-elections"
        },
        {
            "title": "Jobs for persons with disability: The corporate sector must step in",
            "description": "Last Saturday, I met Sarita Thulung, the para-athlete and disability and social inclusion activist.",
            "url": "https://thehimalayantimes.com/opinion/jobs-for-persons-with-disability-the-corporate-sector-must-step-in"
        },
        {
            "title": "Fusemachines announces AI Fellowship 2024 in Nepal",
            "description": "Fusemachines Inc., a leading provider of enterprise AI products and solutions has announced the opening of registration for the Fusemachines AI Fellowship 2024 - Nepal cohort.",
            "url": "https://thehimalayantimes.com/science-and-tech/fusemachines-announces-ai-fellowship-2024-in-nepal"
        },
        {
            "title": "'Public-private partnership must for development'",
            "description": "Chief Minister of Koshi Province, Kedar Karki, has said public-private partnership is essential for economic prosperity.",
            "url": "https://thehimalayantimes.com/nepal/public-private-partnership-must-for-development"
        },
        {
            "title": "IT development is instrumental for good governance, prosperity: Minister Sharma",
            "description": "Minister for Communications and Information Technology, Rekha Sharma, has advocated for utilising information technology as the basis of good governance and prosperity.",
            "url": "https://thehimalayantimes.com/kathmandu/it-development-is-instrumental-for-good-governance-prosperity-minister-sharma"
        },
        {
            "title": "PM Dahal directs party lawmakers to play strong role in the Parliament",
            "description": "CPN (Maoist Centre) Chairperson and Prime Minister Pushpa Kamal Dahal 'Prachanda' has directed the lawmakers of the party to play a strong role in the Parliament in favour of people.",
            "url": "https://thehimalayantimes.com/kathmandu/pm-dahal-directs-party-lawmakers-to-play-strong-role-in-the-parliament"
        },
        {
            "title": "Plight of youth who escaped from Russian army",
            "description": "\"I would not have survived if I had remained in the Russian military. My brother-in-law, who is currently working in South Korea, advised me not to be concerned about money.",
            "url": "https://thehimalayantimes.com/nepal/plight-of-youth-who-escaped-from-russian-army"
        },
        {
            "title": "Bank interest should only increase with consent of both parties: UML Chair Oli",
            "description": "CPN (UML) Chair KP Sharma Oli has stated that provisions should require the consent of both parties for increasing the bank interest rate.",
            "url": "https://thehimalayantimes.com/business/bank-interest-should-only-increase-with-consent-of-both-parties-uml-chair-oli"
        },
        {
            "title": "Liverpool flexes squad depth in 4-0 win over Bournemouth to move 5 points clear in Premier League",
            "description": "Liverpool appears to have the squad depth to last the pace in the Premier League title race.",
            "url": "https://thehimalayantimes.com/sports/liverpool-flexes-squad-depth-in-4-0-win-over-bournemouth-to-move-5-points-clear-in-premier-league"
        },
        {
            "title": "IFC Appoints Imad N. Fakhoury as Regional Director for South Asia",
            "description": "The International Finance Corporation (IFC), a member of the World Bank Group, has appointed Imad N. Fakhoury as Regional Director for South Asia.",
            "url": "https://thehimalayantimes.com/business/ifc-appoints-imad-n-fakhoury-as-regional-director-for-south-asia"
        },
        {
            "title": "High Court Patan issues stay order over PADT executive director appointment",
            "description": "The High Court Patan has issued an interim order asking the Pashupati Area Development Trust (PADT), Governing Council to refrain from implementing its decision to appoint Laxmi Pun as the executive director of the PADT.",
            "url": "https://thehimalayantimes.com/kathmandu/high-court-patan-issues-stay-order-over-padt-executive-director-appointment"
        },
        {
            "title": "Remaining works of peace process to be completed on consensus: PM Dahal",
            "description": "Prime Minister Pushpa Kamal Dahal 'Prachanda' has expressed the belief that the remaining works of the peace process would be completed on the basis of consensus.",
            "url": "https://thehimalayantimes.com/kathmandu/remaining-works-of-peace-process-to-be-completed-on-consensus-pm-dahal"
        },
        {
            "title": "High-speed, high-scoring Loïs Openda and Leipzig aim to end Leverkusen's unbeaten run",
            "description": "Confidence is the key ingredient in Loïs Openda's recipe for becoming one of soccer's global superstars.",
            "url": "https://thehimalayantimes.com/sports/high-speed-high-scoring-lois-openda-and-leipzig-aim-to-end-leverkusens-unbeaten-run"
        }
    ],
    "current_page": 4
}