[
    {
        "title": "China accuses US of devising tactics to suppress China despite improvement in relations",
        "description": "\n                                                “Our bottom line is also very clear,” Wang said. “That is Taiwan will never be allowed to split from the motherland.”\n                                            \n                    ",
        "url": "https://thehimalayantimes.com/world/china-accuses-us-of-devising-tactics-to-suppress-china-despite-improvement-in-relations"
    },
    {
        "title": "Modi visits Kashmir's main city for the first time since revoking region's semi-autonomy",
        "description": "\n                                                India's powerful home minister, Amit Shah, has repeatedly promised that the region would regain statehood after elections.\n                                            \n                    ",
        "url": "https://thehimalayantimes.com/world/modi-visits-kashmirs-main-city-for-the-first-time-since-revoking-regions-semi-autonomy"
    },
    {
        "title": "From Blue Mountains, Pepper eyes fastest no O2 ascent of 14 peaks",
        "description": "\n                                                An Australian woman climber is all set to leave for Mt Annapurna in a bid to complete all 14 peaks above 8,000m without using supplemental oxygen.\n                                            \n                    ",
        "url": "https://thehimalayantimes.com/nepal/from-blue-mountains-pepper-eyes-fastest-no-o2-ascent-of-14-peaks"
    },
    {
        "title": "Bagmati Province establishes Career Guidance Service Center",
        "description": "\n                                                The Bagmati Province established a Career Guidance Service Center and career guidance digital platform in Dhulikhel, on Wednesday. \n                                            \n                    ",
        "url": "https://thehimalayantimes.com/nepal/bagmati-province-establishes-career-guidance-service-center"
    },
    {
        "title": "Man City's 3-1 win against Man United provides reality check for Jim Ratcliffe",
        "description": "\n                                                Good luck trying to knock Manchester City off its perch.\n                                            \n                    ",
        "url": "https://thehimalayantimes.com/sports/man-citys-3-1-win-against-man-united-provides-reality-check-for-jim-ratcliffe"
    },
    {
        "title": "\"A fruitful and satisfying stint\"",
        "description": "\n                                                In a couple of days, the six-year term of the Chairman of the National Assembly of Nepal, Ganesh Prasad Timilsina, will end. \n                                            \n                    ",
        "url": "https://thehimalayantimes.com/kathmandu/a-fruitful-and-satisfying-stint"
    },
    {
        "title": "Nepali exodus: People voting with feet",
        "description": "\n                                                Nepal is grappling with a growing sense of people’s dissatisfaction regarding the performance, efficacy and integrity of the government and the political leadership. \n                                            \n                    ",
        "url": "https://thehimalayantimes.com/opinion/nepali-exodus-people-voting-with-feet"
    },
    {
        "title": "Climate crisis: Why can't Nepal lead in global action?",
        "description": "\n                                                In a recent remark, Prime Minister Dahal stressed that “Nepal has a zilch role in climate crisis”.\n                                            \n                    ",
        "url": "https://thehimalayantimes.com/opinion/climate-crisis-why-cant-nepal-lead-in-global-action"
    },
    {
        "title": "EPR is most efficient curb on plastic pollution, say experts",
        "description": "\n                                                While plastic pollution is hazardous to human health and the environment, experts claim that plastic producers, such as large corporations, have been able to avoid prosecution by exploiting legal loopholes. \n                                            \n                    ",
        "url": "https://thehimalayantimes.com/nepal/epr-is-most-efficient-curb-on-plastic-pollution-say-experts"
    },
    {
        "title": "Rare diseases in Nepal: Lack of resources and medicines multiply the patients' hardships",
        "description": "\n                                                World Health Organization (WHO) delineated rare diseases as conditions affecting a small fraction of the population, specifically fewer than 1 in 2,000 individuals within a given populace.\n                                            \n                    ",
        "url": "https://thehimalayantimes.com/nepal/rare-diseases-in-nepal-lack-of-resources-and-medicines-multiply-the-patients-hardships"
    },
    {
        "title": "South Korea sets Thursday as deadline for striking young doctors to return to work",
        "description": "\n                                                South Korea's government gave striking young doctors four days to report back to work, saying Monday that they won't be punished if they return by the deadline but will face indictments and suspensions of medical licenses if they don't. \n                                            \n                    ",
        "url": "https://thehimalayantimes.com/world/south-korea-sets-thursday-as-deadline-for-striking-young-doctors-to-return-to-work"
    },
    {
        "title": "Glimpses into autobiography of mountaineer Lhakpa Sonam Sherpa\r ",
        "description": "\n                                                Senior tourism entrepreneur Lhakpa Sonam Sherpa, who successfully scaled Mt Everest last year, has proposed to form a special committee comprising representatives from different agencies to monitor mountaineering expeditions in the Everest base camp.\n                                            \n                    ",
        "url": "https://thehimalayantimes.com/nepal/glimpses-into-autobiography-of-mountaineer-lhakpa-sonam-sherpa"
    }
]