{
    "articles": [
        {
            "title": "Nepal's beautiful nature and rich culture attracts world: President Paudel",
            "published_date": " Published: 11:53 am Mar 13, 2024  ",
            "url": "https://thehimalayantimes.com/kathmandu/nepals-beautiful-nature-and-rich-culture-attracts-world-president-paudel",
            "content": "President Ram Chandra Paudel has said that Nepal has become a center of attraction in the globe for its beautiful nature and glorious culture.In his address to the inaugural ceremony of the reconstructed Balkumari Temple at Balkumari in Lalitpur, President Paudel lauded the efforts made by the government to rebuild and keep alive the important historical heritages of Kathmandu, Lalitpur and Bhaktapur.\"Kathmandu Valley is a glorious city of art and multi-culture. Lalitpur Metropolitan City's contribution in bringing freshness by rebuilding many heritages is commendable. Among the local levels across the country, this metropolitan city has become an exemplary municipality. If other local levels follow the suit, we can be confident that the country will become prosperous\", the President noted.Lalitpur Metropolitan City mayor Chiribabu Maharjan shared that the metropolis has provided financial assistance for the construction of Balkumari temple which was damaged by the earthquake in 2015.Stating that the Public Procurement Act, 2063 BS was an obstacle in the construction of heritages of archaeological importance such as Devalaya and Shivalaya, he suggested amending the Act.Chairperson of Balkumari Temple Conservation and Reconstruction Committee Khadga Lal Maharjan briefed about the historical background and reconstruction of the temple."
        },
        {
            "title": "English language barrier: How it prevents use of technology",
            "published_date": " Published: 11:50 am Mar 13, 2024  ",
            "url": "https://thehimalayantimes.com/opinion/english-language-barrier-how-it-prevents-use-of-technology",
            "content": "The events of the day did make me wonder: What sets back many people in Nepal from using technology proficiently? In an age where digital accessibility is valued by many companies and governments, most software is made to be easily understood and navigated by the general population. But from my own personal observation, in my home for example, relatives and family members often have me do simple things for them like creating new Gmail accounts, downloading apps, registering online forms and so on. Technology to them is not as comprehensible as it is to me, who has been exposed to smartphones ever since childhood. But more significant than that, I realised, is the English language barrier that is preventing them from gaining confidence in using these applications.Most computer systems currently used by the Nepali people have an English language interface. Most messages, captions, warnings, headings and instructions on our computer or mobile phone screens are displayed in English. The internet is filled to the brim with English content, from blogs, health websites and online Wikipedia to international news portals and shopping platforms. Our social media is inundated with English posts, messages and notifications. Even websites of Nepali non-profits, youth organisations, businesses and personal portfolios are written down in English. Aside from governmental websites, Nepali news portals, occasional Nepali tweets and some amount of Nepali video content, our local language is hard to come by in the digital world. The situation is even more observable in graphical user interfaces of operating systems and offline computer applications.Consequently, people not comfortable with the English language have a hard time navigating the digital world. Learning to use software applications where everything is labeled in an unfamiliar language becomes daunting. Lack of tech support services in the local language intensifies this issue. For instance, there exists a vast array of resources such as how-to-articles and videos to help customers use software and digital products on the internet. But since most of this is communicated in English, non-English speakers face limited and subpar Nepali alternatives compared to the abundance and quality of resources available otherwise.Newer technologies that could potentially benefit many fall short of delivering their potential because of the language barrier. Good examples are AI chatbots like Open AI's Chat GPT, Google's Gemini or Microsoft's Bard. They are quite helpful so long as you can chat with them in English.Every year, when the season is just right, you can see the hustle and bustle in unofficial electronic DV form filling stations, where people hankering after the enticing chance of going to the US come to submit the forms for a few hundred rupees. Perhaps, an even more perennial flurry of activity happens at unofficial passport form filling stations, right outside the building of the Department of Passports.While it's reasonable for those without access to a computer to utilise these facilities, filling an online form is hardly a technical task. Still many prefer these services over filling online forms themselves.This could be because of lack of confidence in using digital applications and technology. Subsequently, the language barrier has a direct role in magnifying this lack in confidence.This is because understanding how to use computers and software becomes more intuitive when you can read the text on the screen. Let's illustrate this with a simple hypothetical scenario. Imagine using Microsoft Word and you encounter the 'Find' and 'Replace' options on the toolbar. You might not immediately understand their functions. However, if you understand the meanings of the words, you could intuitively guess that the 'Find' option allows you to locate any word or phrase in the document, and perhaps the 'Replace' option enables you to substitute those words with others. This intuition is not accessible to individuals who are unfamiliar with the English language.One straightforward answer to solving the language barrier is translation. However, translation comes with its own range of difficulties. It is tricky to provide quality translation for the vast amount of content present in the digital world. Furthermore, unlike English, Nepali did not evolve to be well integrated with technological interfaces and often, there exist no good alternatives in Nepali to technological and other jargons. It also takes extra effort from all entities that work in the digital domain to make their website and content available in Nepali as well. However, successful integration of our own language in the digital world is possible and beneficial, so relevant organisations and the government should allocate time, money and people to work on this end.While an internet completely translated in Nepali may appear appealing, individually, the most immediate step one can take is to try to understand computer systems intuitively by learning the rudimentary skills of English necessary to navigate the digital world. While technological interfaces use English, the language used is often very simple, and running that extra mile will make us more comfortable with computers, making us more productive in our work."
        },
        {
            "title": "Japan's first private-sector rocket launch attempt ends with explosion shortly after takeoff",
            "published_date": " Published: 10:14 am Mar 13, 2024  ",
            "url": "https://thehimalayantimes.com/science-and-tech/japans-first-private-sector-rocket-launch-attempt-ends-with-explosion-shortly-after-takeoff",
            "content": "A rocket that was supposed to become Japan's first from the private sector to put a satellite into orbit exploded shortly after takeoff Wednesday, livestreamed video showed.Online video showed the rocket called Kairos blasting off from Wakayama Prefecture, in central Japan, a mountainous area filled with trees, but exploding midair within seconds.A huge plume of smoke engulfed the area, and flames shot up in some spots. The video then showed spurts of water trying to put out the blaze.There were no reports of injuries, and the fire has been brought under control, according to the fire department in Kushimoto city, Wakayama,Tokyo-based startup Space One, behind the rocket launch, did not immediately respond to a request for comment.Live footage on public broadcaster NHK relayed a voice announcing to the crowd gathered to watch the takeoff from a safe distance. NHK showed debris scattering from the sky, and later charred pieces strewn about on the ground. The cause of the problems was still under investigation, according to NHK.The launch was already delayed several times, with the last postponement coming Saturday, after a ship was spotted in a risk area, according to Japanese media reports.If it had succeeded, Space One would have been the first private company to put a rocket into orbit.Tokyo-based Space One was set up in 2018, with investments from major Japanese companies, including Canon Electronics, IHI, Shimizu and major banks.Japan's main space exploration effort has been led by the government's NASDA, which stands for The National Space Development Agency of Japan, this nation's equivalent of NASA of the U.S. The agency is now called JAXA, or Japan Aerospace Exploration Agency.Wednesday's failure is likely to work as a setback for such private sector efforts. The rocket was supposed to have sent a satellite into orbit around earth to gather various information."
        },
        {
            "title": "Dahal elected National Assembly Chair",
            "published_date": " Published: 02:09 pm Mar 12, 2024  ",
            "url": "https://thehimalayantimes.com/kathmandu/dahal-elected-national-assembly-chair",
            "content": "Narayan Prasad Dahal, the candidate of the ruling coalition, has been elected to the post of National Assembly Chairperson.Announcing the results of the voting held through the 'voice vote' method in the meeting of the National Assembly today, Vice-Chairperson Urmila Aryal, who chaired the meeting, declared that the proposal seeking Dahal's election to the post has been passed as 39 votes went in his favour.Before this, 17 votes went in favour of the proposal seeking election of Dahal's contender and candidate of the main opposition Nepali Congress, Yubaraj Sharma. Fifty-six lawmakers participated in the voting on both proposals while one lawmaker stayed neutral.The upper house of the Federal Parliament has 59 members, but presently it has 58 members.CPN (Maoist Centre)'s lawmaker Gopi Bahadur Sarki Achhami proposed the candidacy of Dahal before the meeting and urged the upper house to elect Dahal on the post, citing that he is from the new political alliance that 'aims' to promote social justice and bring prosperity in the country. CPN (UML) lawmaker Devendra Dahal, Beduram Bhusal of CPN (Unified Socialist) and Mohammed Khalid of JanataSamajbadi Party supported the nomination of Dahal.Congratulating the newly-elected Chair Dahal, Vice-Chairperson Aryal wished him a successful term in office.Ananda Prasad Dhungana of NC tabled the candidacy of Sharma, proposing the meeting to elect him on the post while Kiran Babu Shrestha and Loktantrik Samajbadi Party Nepal's Kishore Kumar Singh backed the nomination of Sharma.The National Assembly will next meet at 1.09 pm on March 13."
        },
        {
            "title": "Transportation halted on Karnali Bridge after 14 support wires damaged partially in fire",
            "published_date": " Published: 09:36 am Mar 12, 2024  ",
            "url": "https://thehimalayantimes.com/kathmandu/transportation-halted-on-karnali-bridge-after-14-support-wires-damaged-partially-in-fire",
            "content": "Transportation on the Karnali Bridge has been halted after the damage in 14 support wires when it caught fire from a truck on Monday.A special technical team suggested the authority not to operate vehicles on bridge till the conduct of a detailed inspection, according to Road Division Office, Nepalgunj.Engineer at Division Office, Niraj Shakya, said vehicular movement along the bridge was stopped for now. \"We reached the incident site last night. Another technical team is arriving today for further inspection,\" he added.Police Inspector at Area Police Office, Chisapani, Hariram Dangi, said everyone driving vehicles was requested to adopt diversion in traffic route with the closure of regular route.The vehicles operated from Sudurpaschim Province to federal capital Kathmandu and other provinces are asked to use the way from Bardiya and Nepalgunj via Sattipur Bridge.A truck (Na 5 Kha 5297) heading to west had suddenly caught fire while running on the Karnali Bridge on Monday afternoon. The fire from truck later caught the construction wires of the bridge, spreading panic among the people."
        },
        {
            "title": "9th Edition of Nepal-Pakistan Friendship T20 Cricket Tournament-2024 concludes",
            "published_date": " Published: 01:19 pm Mar 11, 2024  ",
            "url": "https://thehimalayantimes.com/sports/9th-edition-of-nepal-pakistan-friendship-t20-cricket-tournament-2024-concludes",
            "content": "The 9th Edition of Nepal-Pakistan Friendship T20 Cricket Tournament-2024 has concluded in Kathmandu, on Sunday.The closing ceremony and prize distribution of the tournament which commenced on march 2, took place on March 10 with the tournament seing the participation of twelve teams representing various clubs.During the event, Shiva Koirala (Jwala), Vice President of the National Sports Council, Nepal, and the Chief Guest awarded the trophy to the winning team, Cricket Excellence Centre Kathmandu. The Lee Cricket secured the runners-up position in the tournament and also received a trophy.Distinguished guests included Golam Sarwar, Secretary-General of SAARC, Noha Hamdy Ahmed Elgebaly, Ambassador of Egypt to Nepal, Salahuddin Noman Chowdhury, Ambassador of Bangladesh to Nepal, Xie Yu Economic & Commercial Counsellor of the Chinese Embassy in Nepal, Utsav Dhungana, General Manager of the Cricket Association of Nepal, Prachanda Bahdur Shrestha, Chairman of Himalayan Bank Limited, and Ashoke SJB Rana, Chief Executive Officer of Himalayan Bank Limited. The ceremony was also attended by journalists, civil society representatives, and sports enthusiasts, according to the press statement issued by the Pakistan Embassy in Kathmandu.The special guests also presented the prizes to prominent players and officials of the T20 Cricket Tournament.Addressing the gathering, Shiva Koirala lauded the Pakistan Embassy's initiative for successfully organizing the event. He added that the event is now on the sporting calendar of Kathmandu and manifestation of close relations between Nepal and Pakistan.Ambassador Abrar H. Hashmi congratulated the winning teams and lauded the organizers on successfully materializing the event. He added that the tournament contributed in providing opportunities to emerging cricket players of Nepal.\"This yearly event since 2014 has been an avenue to forge strong relations between both countries,\" he said while commiting to continue to bring the youths of two countries together by organizing such events in future as well. The Ambassador also thanked the Chief guest, special guests and the participants for their interest and presence in the event and extended his gratitude to Himalayan Bank Limited on supporting the event."
        }
    ],
    "current_page": "https://thehimalayantimes.com/sports/9th-edition-of-nepal-pakistan-friendship-t20-cricket-tournament-2024-concludes"
}