{
    "articles": [
        {
            "title": "Nepal Police unveils comprehensive security measures for Maha Shivaratri celebration",
            "description": "KATHMANDU: Nepal Police has revealed its meticulous security arrangements for the upcoming Maha Shivaratri celebration...",
            "url": "https://english.ratopati.com/story/31992"
        },
        {
            "title": "Minister Sharma appointed government spokesperson",
            "description": "KATHMANDU: The recently established Council of Ministers convened for a meeting on Thursday. ...",
            "url": "https://english.ratopati.com/story/31987"
        },
        {
            "title": "Psychological impact of hair loss and the role of hair transplantation",
            "description": "Losing hair is a common experience that can deeply affect individuals worldwide, impacting their self-esteem...",
            "url": "https://english.ratopati.com/story/31974"
        },
        {
            "title": "PM Dahal advocates for 'Paperless and Faceless' system to enhance governance",
            "description": "KATHMANDU: Prime Minister Pushpa Kamal Dahal 'Prachanda' has emphasized the significance of adopting a 'pa...",
            "url": "https://english.ratopati.com/story/31942"
        },
        {
            "title": "Enhancing Nepal's Library System: Embracing digital innovation for global impact",
            "description": "What comes to your mind when you hear the word ‘Library&r ...",
            "url": "https://english.ratopati.com/story/31918"
        },
        {
            "title": "Government initiates startup loans program to boost business growth",
            "description": "KATHMANDU: The government is extending support to startup businesses, which refer to newly established companies...",
            "url": "https://english.ratopati.com/story/31884"
        },
        {
            "title": "U.S. makes first lunar landing in over 50 years",
            "description": "LOS ANGELES: U.S. company Intuitive Machines' first lunar lander touched down on the moon Thursday,...",
            "url": "https://english.ratopati.com/story/31879"
        },
        {
            "title": "Prof. Dr. Kesharjung Baral appointed Vice Chancellor at TU",
            "description": "KATHMANDU: Tribhuvan University (TU) welcomes Professor Dr. Kesharjung Baral as its new Vice Chancellor. ...",
            "url": "https://english.ratopati.com/story/31876"
        },
        {
            "title": "Historic Milestone: Legal recognition for first lesbian couple marriage",
            "description": "BANKE: In a groundbreaking development, the same-sex marriage between 33-year-old Anju Devi Shrestha of Bardiya...",
            "url": "https://english.ratopati.com/story/31820"
        },
        {
            "title": "Addressing Female Hair Loss",
            "description": "Hair loss is a universal concern that exceeds geographical boundaries, impacting people worldwide. In Nepal,...",
            "url": "https://english.ratopati.com/story/31812"
        },
        {
            "title": "EPS Korean Language exam date announcement faces delay",
            "description": "KATHMANDU: The eagerly awaited announcement of the EPS Korean Language Examination date is encountering a...",
            "url": "https://english.ratopati.com/story/31793"
        },
        {
            "title": "PM Dahal urges action against alarming brain drain",
            "description": "KATHMANDU: Prime Minister Pushpa Kamal Dahal 'Prachanda' has voiced concern over the critical issue of...",
            "url": "https://english.ratopati.com/story/31761"
        },
        {
            "title": "PM Dahal advocates strategies to retain students in Nepal",
            "description": "KATHMANDU: Prime Minister Pushpa Kamal Dahal 'Prachanda' has urged a concerted effort to retain students...",
            "url": "https://english.ratopati.com/story/31756"
        },
        {
            "title": "Surge in seasonal flu cases amidst widespread winter chill",
            "description": "KATHMANDU: As winter's icy grip tightens across most parts of the country, there's a noticeable...",
            "url": "https://english.ratopati.com/story/31743"
        },
        {
            "title": "Apple overtakes Samsung as world's biggest phonemaker",
            "description": "Apple now has the lion's share of the global smartphone market, knocking Samsung off the...",
            "url": "https://english.ratopati.com/story/31659"
        },
        {
            "title": "North Korea's Kim Jong Un abandons unification goal with South",
            "description": "North Korean leader Kim Jong Un has said unification with the South is no longer...",
            "url": "https://english.ratopati.com/story/31658"
        },
        {
            "title": "EPS Korean language examinations likely to face slight delay",
            "description": "KATHMANDU: The EPS language examinations for applicants in the manufacturing sectors are anticipated to face...",
            "url": "https://english.ratopati.com/story/31656"
        },
        {
            "title": "Chairman Purushottam Khanal resigns from Nepal Telecommunications Authority",
            "description": "KATHMANDU: Purushottam Khanal, the Chairman of the Nepal Telecommunications Authority (NTA), has officially stepped do...",
            "url": "https://english.ratopati.com/story/31623"
        },
        {
            "title": "Sweet success in Rukum Paschim as honey production hits Rs 25 million mark",
            "description": "RUKUM PASCHIM: In a sweet victory for Rukum Paschim district, this year's honey production has...",
            "url": "https://english.ratopati.com/story/31594"
        },
        {
            "title": "Nepali media faces unprecedented financial crisis, threatening press sustainability",
            "description": "KATHMANDU: A recent report indicates that Nepali media endured a significant financial crisis throughout 2023,...",
            "url": "https://english.ratopati.com/story/31565"
        },
        {
            "title": "Bill on Nepal University discussed",
            "description": "KATHMANDU, Dec 22: The House of Representatives' Education, Health and Information Technology Committee today held...",
            "url": "https://english.ratopati.com/story/31557"
        },
        {
            "title": "PM Dahal inaugurates Inaruwa substation",
            "description": "KATHMANDU, Dec 22: Prime Minister Pushpa Kamal Dahal 'Prachanda' has inaugurated Inaruwa substation today. Ina...",
            "url": "https://english.ratopati.com/story/31550"
        },
        {
            "title": "EC determines voting stations for NA election",
            "description": "KATHMANDU, Dec 21: The Election Commission (EC) has determined one voting station in each province...",
            "url": "https://english.ratopati.com/story/31542"
        },
        {
            "title": "End of an era for electronics giant Toshiba",
            "description": "Dec 20: There was a time when more than one of your TVs, computers, speaker...",
            "url": "https://english.ratopati.com/story/31538"
        },
        {
            "title": "COP 28: Pathways for Nepal to Combat Climate Change",
            "description": "Nepal as a Himalayan nation, is highly susceptible to the repercussions of climate change. The...",
            "url": "https://english.ratopati.com/story/31519"
        },
        {
            "title": "Lenovo unveils its first micro form factor device, the Chromebox Micro",
            "description": "Dec 17: ChromeOS, Google's browser-based operating system, is most commonly associated with Chromebooks. But it...",
            "url": "https://english.ratopati.com/story/31517"
        },
        {
            "title": "Apple agrees to pay out $25M to settle lawsuit over Family Sharing",
            "description": "Dec 17: Apple has agreed to pay out $25 million to settle a class action...",
            "url": "https://english.ratopati.com/story/31515"
        },
        {
            "title": "WHO chief reiterates call for ceasefire in Gaza",
            "description": "GENEVA, Dec 17: Tedros Adhanom Ghebreyesus, director-general of the World Health Organization (WHO), reiterated his...",
            "url": "https://english.ratopati.com/story/31511"
        },
        {
            "title": "Renovation of Swoyambhunath Stupa completed",
            "description": "KATHMANDU, Dec 17: The renovation of Swoyambhunath Stupa, a world heritage site, has been completed....",
            "url": "https://english.ratopati.com/story/31509"
        },
        {
            "title": "30 percent of families in Karnali Province self-reliant on agricultural production",
            "description": "BHERIGANGA, Surkhet, Dec 14: Thirty percent of families in Karnali Province are self-reliant on agricultural...",
            "url": "https://english.ratopati.com/story/31493"
        },
        {
            "title": "Repair of border pillars along Nepal-India border begins today",
            "description": "JHAPA, Dec 4: Repair of 317 borer pillars from Mechinagar to Gaurigunj in Jhapa on...",
            "url": "https://english.ratopati.com/story/31429"
        },
        {
            "title": "Tiny living robots made from human cells surprise scientists",
            "description": "Dec 1: Scientists have created tiny living robots from human cells that can move around...",
            "url": "https://english.ratopati.com/story/31417"
        },
        {
            "title": "After 17 days trapped in tunnel, India workers say hope kept them alive",
            "description": "SILKYARA TUNNEL, India, Nov 29: After 17 days trapped inside a collapsed Himalayan road tunnel they...",
            "url": "https://english.ratopati.com/story/31397"
        },
        {
            "title": "Technorion Nepal 2023 being organized in collaboration with ARC",
            "description": "Nov 28: Techfest at IIT Bombay is one of the largest events in Asia that...",
            "url": "https://english.ratopati.com/story/31383"
        },
        {
            "title": "Poem: The Tug Of War",
            "description": "Big cities  and big hospitals lots of  medicines  and big expenses  Mo ...",
            "url": "https://english.ratopati.com/story/31375"
        },
        {
            "title": "'Enduro Int'l Mountain Bike' race kicks off in Pokhara",
            "description": "KASKI, Nov 23: The 'Enduro International Mountain Bike' race has kicked off today in Pokhara....",
            "url": "https://english.ratopati.com/story/31344"
        },
        {
            "title": "Egypt hosts ICT expo to facilitate digital transformation",
            "description": "CAIRO, Nov 23: Egypt has hosted the 27th edition of Cairo ICT 2023 expo, the...",
            "url": "https://english.ratopati.com/story/31339"
        },
        {
            "title": "Global IME Bank highest taxpayer in banking sector",
            "description": "KATHMANDU, Nov 23: Global IME Bank has emerged as the highest taxpayer among all banks...",
            "url": "https://english.ratopati.com/story/31337"
        },
        {
            "title": "Government approves resignations of Army Major General and Energy Secretary",
            "description": "KATHMANDU, Nov 23: The government has approved the resignation of Nepali Army Major General Taradhoj...",
            "url": "https://english.ratopati.com/story/31336"
        },
        {
            "title": "Sam Altman agrees to return to OpenAI in a bizarre reversal of fortunes",
            "description": "NEW YORK, Nov 22: Sam Altman has agreed to return to lead OpenAI, the company...",
            "url": "https://english.ratopati.com/story/31330"
        },
        {
            "title": "Are all things, living and non-living, conscious?",
            "description": "What is consciousness? Are living and non-living things both conscious? What characteristics set living things...",
            "url": "https://english.ratopati.com/story/31317"
        },
        {
            "title": "OpenAI fires CEO Sam Altman, citing less than “candid” communications",
            "description": "Nov 19: OpenAI, the company behind ChatGPT and DALL-E, announced Friday that co-founder and CEO...",
            "url": "https://english.ratopati.com/story/31305"
        },
        {
            "title": "Pokhara to host International Mountain Cross-country Championship on Nov 25",
            "description": "KASKI, Nov 19: The Nepal-China International Mountain Cross-country Championship is to take place in Pokhara...",
            "url": "https://english.ratopati.com/story/31304"
        },
        {
            "title": "UN Security Council extends authorization for African Union Mission in Somalia",
            "description": "UNITED NATIONS, Nov 16: The Security Council on Wednesday adopted a resolution to extend the...",
            "url": "https://english.ratopati.com/story/31285"
        },
        {
            "title": "Global South campaigners march in Kenya amid calls to phase out plastics",
            "description": "NAIROBI, Nov 12: Hundreds of green campaigners drawn from the Global South marched through the...",
            "url": "https://english.ratopati.com/story/31267"
        },
        {
            "title": "Pokhara Metropolis, USAID sign agreement for tourism development",
            "description": "KASKI, Nov 10: An agreement has been made between Pokhara Metropolitan City (PMC) and USAID...",
            "url": "https://english.ratopati.com/story/31255"
        },
        {
            "title": "Decisions of Cabinet meeting",
            "description": "KATHMANDU, Nov 9: The Cabinet meeting was held on Thursday today.  In the ...",
            "url": "https://english.ratopati.com/story/31249"
        },
        {
            "title": "Daraz 11.11, Biggest Sale of the Year Returns",
            "description": "KATHMANDU, November 8: Daraz, Nepal’s leading e-commerce platform, has announced the return of its highly-antici...",
            "url": "https://english.ratopati.com/story/31237"
        },
        {
            "title": "UNIFIL condemns killing of civilians, warns of escalation on Lebanon's southern border",
            "description": "BEIRUT, Nov 8: The potential for escalation on the Lebanese-Israeli border is clear and must...",
            "url": "https://english.ratopati.com/story/31234"
        },
        {
            "title": "South Korea plans to launch its 1st military spy satellite on Nov 30",
            "description": "SEOUL, Nov 6: South Korea said Monday it plans to launch its first domestically built...",
            "url": "https://english.ratopati.com/story/31212"
        },
        {
            "title": "NPC starts holding provincial-level discussion for 16th Plan",
            "description": "KATHMANDU, Nov 6: The National Planning Commission (NPC) has started holding a provincial-level discussion after...",
            "url": "https://english.ratopati.com/story/31209"
        },
        {
            "title": "Sources of Noise and Vibration in Electric Vehicles",
            "description": "In recent years, the demand for electric vehicles in the market has increased in an...",
            "url": "https://english.ratopati.com/story/31202"
        },
        {
            "title": "Government to provide Rs 200,000 per each quake dead as immediate relief",
            "description": "KATHMANDU, Nov 5: The government has decided to provide Rs 200,000 per person who died...",
            "url": "https://english.ratopati.com/story/31197"
        },
        {
            "title": "Sam Bankman-Fried found guilty on all seven counts",
            "description": "Nov 3: Sam Bankman-Fried, the co-founder and former CEO of crypto exchange FTX and trading...",
            "url": "https://english.ratopati.com/story/31189"
        },
        {
            "title": "ADB's commitment to invest in Dudh Koshi Project",
            "description": "KATHMANDU, Nov 2: The Asian Development Bank (ADB) has expressed its commitment to invest in...",
            "url": "https://english.ratopati.com/story/31180"
        },
        {
            "title": "Officials call for investment in Tech sector of Nepal at London conference",
            "description": "LONDON, Nov 2: Nepali officials and tech entrepreneurs have called upon leading global companies to...",
            "url": "https://english.ratopati.com/story/31177"
        },
        {
            "title": "Global AI Safety Summit kicks off in Britain",
            "description": "BLETCHLEY PARK, Britain, Nov 2: A global summit on artificial intelligence (AI) safety opened in...",
            "url": "https://english.ratopati.com/story/31176"
        },
        {
            "title": "Chief Justice Shrestha and his Chinese counterpart meet",
            "description": "KATHMANDU, Nov 2: Chief Justice Bishowambhar Prasad Shrestha, who is currently in Beijing, China, held...",
            "url": "https://english.ratopati.com/story/31173"
        },
        {
            "title": "CG Elex Chatbot: The AI-driven customer support in the digital commerce industry",
            "description": "KATHMANDU, Nov 2: The development of the AI-based CG Elex Chatbot serves as a strategic...",
            "url": "https://english.ratopati.com/story/31172"
        },
        {
            "title": "Elon Musk warns AI could lead to human extinction",
            "description": "Nov 1: Elon Musk has warned that Artificial Intelligence (AI) if programmed by people in...",
            "url": "https://english.ratopati.com/story/31171"
        },
        {
            "title": "Bangladesh enters new era of transportation with Chinese-built 1st underwater tunnel",
            "description": "CHATTOGRAM, Bangladesh, Oct 30: A Chinese-built underwater tunnel, the first in Bangladesh and South Asia,...",
            "url": "https://english.ratopati.com/story/31149"
        },
        {
            "title": "Learn to protect your Privacy and Anonymity",
            "description": "The new book \"The Art of Cyber Law & Cyber Crimes\" by eminent Supreme Court...",
            "url": "https://english.ratopati.com/story/31141"
        },
        {
            "title": "Education Matters: Data-Driven Decision-Making in Nepal’s Education Reform",
            "description": "In the previous installment of this series “From Theory to Prac ...",
            "url": "https://english.ratopati.com/story/31110"
        },
        {
            "title": "The world exists, and it will continue to exist: Mahayogi Pilot Baba",
            "description": "I was recently on a trip to Kathmandu. At the invitation of a popular guru...",
            "url": "https://english.ratopati.com/story/31107"
        },
        {
            "title": "PM Dahal briefs cabinet about DPM Shrestha's health condition",
            "description": "Kathmandu, Oct 19: Prime Minister Pushpa Kamal Dahal 'Prachanda' has briefed the Cabinet meeting today...",
            "url": "https://english.ratopati.com/story/31098"
        },
        {
            "title": "Fighting inequality: Time to invest in Resilient Recovery",
            "description": "In the wake of unprecedented natural disasters, Nepal finds itself at a critical juncture, demanding...",
            "url": "https://english.ratopati.com/story/31062"
        },
        {
            "title": "The Flight of Nepal's Youth: A Plea to Halt the Brain Drain Crisis",
            "description": "In recent years, Nepal has witnessed a concerning trend - the flight of its youth...",
            "url": "https://english.ratopati.com/story/31047"
        },
        {
            "title": "Global IME Bank receives first loan from GCPF to finance energy efficiency projects in Nepal",
            "description": "KATHMANDU/LUXEMBOURG, Oct 11: Global IME Bank Limited (GIBL) and the Global Climate Partnership Fund (GCPF)...",
            "url": "https://english.ratopati.com/story/31046"
        },
        {
            "title": "FNCCI President Dhakal Highlights Private Sector's Role in Advancing SDGs",
            "description": "KATHMANDU, Oct 10: Chandra Prasad Dhakal, President of the Federation of Nepalese Chambers of Commerce...",
            "url": "https://english.ratopati.com/story/31041"
        },
        {
            "title": "Govt. to provide 10 Lakhs each to families of those who died in Israel",
            "description": "KATHMANDU, Oct 9: The government will provide 10 Lakhs each to the families of 10...",
            "url": "https://english.ratopati.com/story/31029"
        },
        {
            "title": "The Trailblazing First: A Groundbreaking Treatise on Commercial Law by Dr. Newal Chaudhary",
            "description": "Dr. Newal Chaudhary's groundbreaking new book represents a pivotal milestone for both Nepal's legal landscape...",
            "url": "https://english.ratopati.com/story/31028"
        },
        {
            "title": "Next-gen Windows is coming in 2024, Intel exec confirms (without mentioning Windows 12)",
            "description": "Oct 9: We appear to have got our clearest indication yet that a whole new...",
            "url": "https://english.ratopati.com/story/31026"
        },
        {
            "title": "Education Matters: From Theory to Practice",
            "description": "In our 7th article entitled “21st Century Teaching”, we d ...",
            "url": "https://english.ratopati.com/story/31018"
        },
        {
            "title": "PM Dahal calls special Cabinet meeting and all-party meeting",
            "description": "KATHMANDU, Oct 9: Prime Minister Pushpa Kamal Dahal ‘Prachanda’ has called a special Cabinet meeting...",
            "url": "https://english.ratopati.com/story/31017"
        },
        {
            "title": "Agendas of HoR meeting today",
            "description": "KATHMANDU, Oct 8: The House of Representatives meeting has been called for 1 pm at...",
            "url": "https://english.ratopati.com/story/31000"
        },
        {
            "title": "Book Review of Commercial Law, with Special Reference to Foreign Direct Investment in Nepal",
            "description": "Foreign direct investment (FDI) has become a crucial driver of economic growth and development in...",
            "url": "https://english.ratopati.com/story/30985"
        },
        {
            "title": "Water: The Basis of Life and Food",
            "description": "Water, being the paramount resource for survival, has been a major concern on the global...",
            "url": "https://english.ratopati.com/story/30984"
        },
        {
            "title": "Nepal will be removed from EU's security list soon: Minister Kirati",
            "description": "KATHMANDU, Oct 5: Minister for Culture, Tourism and Civil Aviation Sudan Kirati today claimed that...",
            "url": "https://english.ratopati.com/story/30977"
        },
        {
            "title": "NAC aircraft returns to Kathmandu due to technical issues",
            "description": "KATHMANDU, Oct 5: An aircraft of the National flag carrier, Nepal Airlines Corporation (NAC), en...",
            "url": "https://english.ratopati.com/story/30971"
        },
        {
            "title": "Moungi Bawendi, Louis Brus and Alexei Ekimov win Nobel Prize in Chemistry",
            "description": "Oct 4: Scientists Moungi Bawendi, Louis Brus and Alexei Ekimov have won the 2023 Nobel...",
            "url": "https://english.ratopati.com/story/30966"
        }
    ],
    "current_page": 3
}